
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章 编写一个网络聊天程序 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="04.html" />
    
    
    <link rel="prev" href="02.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="nimspecial.html">
            
                <a href="nimspecial.html">
            
                    
                    Nim特色
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="nim2.0.html">
            
                <a href="nim2.0.html">
            
                    
                    Nim 2.0 的改进
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2020-10-15-introduction-to-arc-orc-in-nim.html">
            
                <a href="2020-10-15-introduction-to-arc-orc-in-nim.html">
            
                    
                    Nim 的 ARC/ORC 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2020-12-08-introducing-orc.html">
            
                <a href="2020-12-08-introducing-orc.html">
            
                    
                     ORC 卓越的 GC 算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="09a_cn.html">
            
                <a href="09a_cn.html">
            
                    
                     Nim实战补充章节：Nim 程序的文档和调试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="2022-11-11-a-cost-model-for-nim_cn.html">
            
                <a href="2022-11-11-a-cost-model-for-nim_cn.html">
            
                    
                     Nim2.0 的成本模型 
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="00a.html">
            
                <a href="00a.html">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="00w.html">
            
                <a href="00w.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    第一章 初识Nim
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    第二章 开始使用Nim
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter active" data-level="4.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    第三章 编写一个网络聊天程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    第四章 标准库畅游
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    第五章 包管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    第六章 并行编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    第七章 构建一个Twitter克隆
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    第八章 外部程序接口FFI
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    第九章 元编程
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三章 编写一个网络聊天程序</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E09;&#x7AE0;-&#x7F16;&#x5199;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;">&#x7B2C;&#x4E09;&#x7AE0; &#x7F16;&#x5199;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</h1>
<p>&#x672C;&#x7AE0;&#x6DB5;&#x76D6;&#xFF1A;</p>
<ul>
<li>&#x8981;&#x6C42;&#x7528;&#x6237;&#x8F93;&#x5165;</li>
<li>&#x521B;&#x5EFA;&#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;</li>
<li>&#x89E3;&#x6790;&#x548C;&#x751F;&#x6210; JSON</li>
<li>&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6570;&#x636E;</li>
<li>&#x4F7F;&#x7528;&#x548C;&#x521B;&#x5EFA;&#x6A21;&#x5757;</li>
</ul>
<p>&#x5728;&#x4E0A;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x60A8;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x8BBE;&#x7F6E; Nim &#x7F16;&#x8BD1;&#x5668;&#x53CA;&#x5176;&#x73AF;&#x5883;&#xFF0C;&#x4ECE;&#x800C;&#x5141;&#x8BB8;&#x60A8;&#x7F16;&#x8BD1;&#x60A8;&#x7684;&#x7B2C;&#x4E00;&#x4E2A; Nim &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x60A8;&#x8FD8;&#x5B66;&#x4E60;&#x4E86; Nim &#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#xFF0C;&#x5305;&#x62EC;&#x8BED;&#x6CD5;&#x3001;&#x4E00;&#x4E9B;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x3001;&#x6709;&#x5173;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x548C;&#x8FC7;&#x7A0B;&#x7684;&#x4FE1;&#x606F;&#x3001;&#x63A7;&#x5236;&#x6D41;&#x8BED;&#x53E5;&#x3001;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3001;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x7B49;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x60A8;&#x5C06;&#x901A;&#x8FC7;&#x5F00;&#x53D1;&#x529F;&#x80FD;&#x9F50;&#x5168;&#x7684;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x6784;&#x5EFA;&#x548C;&#x5DE9;&#x56FA;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x3002;&#x60A8;&#x8FD8;&#x5C06;&#x5B66;&#x4E60;&#x8BB8;&#x591A;&#x5BF9;&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5F00;&#x53D1;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x65B0;&#x6982;&#x5FF5;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x60A8;&#x5C06;&#xFF1A;</p>
<ul>
<li>&#x6784;&#x5EFA;&#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;&#xFF0C;&#x8BE5;&#x754C;&#x9762;&#x5C06;&#x5145;&#x5F53;&#x8BF7;&#x6C42;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5957;&#x63A5;&#x5B57;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x7B49;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x3002;</li>
<li>&#x4F7F;&#x7528; JSON &#x89E3;&#x6790;&#x5668;&#x6784;&#x5EFA;&#x7B80;&#x5355;&#x7684;&#x804A;&#x5929;&#x534F;&#x8BAE;&#x3002;&#x8FD9;&#x5C06;&#x7528;&#x4E8E;&#x5141;&#x8BB8;&#x60A8;&#x7684;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x6807;&#x51C6;&#x548C;&#x4E00;&#x81F4;&#x7684;&#x65B9;&#x5F0F;&#x4EA4;&#x6362;&#x6D88;&#x606F;&#x3002;</li>
<li>&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#x5C06;&#x4EE3;&#x7801;&#x5206;&#x79BB;&#x4E3A;&#x72EC;&#x7ACB;&#x7684;&#x5355;&#x5143;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x4E8E;&#x91CD;&#x7528;&#x3002;</li>
</ul>
<p>&#x968F;&#x7740;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x666E;&#x53CA;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x3002;&#x4E92;&#x8054;&#x7F51;&#x6700;&#x57FA;&#x672C;&#x7684;&#x529F;&#x80FD;&#x662F;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;&#x8FD9;&#x4E00;&#x529F;&#x80FD;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7EA7;&#x522B;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x3002;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x4ECB;&#x7ECD;&#x5728;&#x591A;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x95F4;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x5C06;&#x5176;&#x7528;&#x4F5C;&#x793A;&#x4F8B;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x60A8;&#x5C06;&#x6210;&#x529F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7531;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7EC4;&#x4EF6;&#x7EC4;&#x6210;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF1A;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x60A8;&#x5C06;&#x80FD;&#x591F;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x7EC4;&#x4EF6;&#x53D1;&#x9001;&#x7ED9;&#x60A8;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5B83;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x5B9E;&#x65F6;&#x804A;&#x5929;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#x3002;&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x5411;&#x60A8;&#x4ECB;&#x7ECD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
<h2 id="31-&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;">3.1 &#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;</h2>
<p>&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x5141;&#x8BB8;&#x591A;&#x4EBA;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;&#x5B8C;&#x6210;&#x6B64;&#x4EFB;&#x52A1;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8BA1;&#x7B97;&#x673A;&#x8FDE;&#x63A5;&#x5230;&#x7684;&#x7F51;&#x7EDC;&#xFF08;&#x5982; Internet&#xFF09;&#x5E76;&#x901A;&#x8FC7;&#x8BE5;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;&#x4E0E;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x4E00;&#x5BF9;&#x4E00;&#x901A;&#x4FE1;&#x7684;Facebook Messenger&#x6216;WhatsApp&#x7B49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x540C;&#xFF0C;&#x672C;&#x7AE0;&#x5F00;&#x53D1;&#x7684;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x4E3B;&#x8981;&#x652F;&#x6301;&#x7C7B;&#x4F3C;&#x4E8E;Internet Relay Chat&#x6216;Slack&#x7684;&#x7FA4;&#x7EC4;&#x901A;&#x4FE1;&#xFF08;&#x591A;&#x5BF9;&#x591A;&#xFF09;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x5C06;&#x53D1;&#x9001;&#x7ED9;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x3002;</p>
<p>&#x5B8C;&#x6210;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF1F;</p>
<p>&#x5047;&#x8BBE;&#x6211;&#x521A;&#x521A;&#x770B;&#x4E86;&#x6700;&#x65B0;&#x7684;&#x300A;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x300B;&#x5267;&#x96C6;&#xFF0C;&#x73B0;&#x5728;&#x5F88;&#x9AD8;&#x5174;&#x80FD;&#x548C;&#x6211;&#x7684;&#x670B;&#x53CB;&#x8C08;&#x8BBA;&#x5B83;&#x3002;&#x6211;&#x4F1A;&#x79F0;&#x4ED6;&#x4EEC;&#x4E3A;&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#xFF0C;&#x4EE5;&#x9632;&#x4ED6;&#x4EEC;&#x4E0D;&#x559C;&#x6B22;&#x6211;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x771F;&#x5B9E;&#x59D3;&#x540D;&#x3002;&#x8C08;&#x8BDD;&#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF08;&#x6211;&#x4FDD;&#x8BC1;&#x6CA1;&#x6709;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x5267;&#x900F;&#xFF09;&#xFF1A;</p>
<p>&#x6E05;&#x5355; 3.1.&#x6211;&#x3001;&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#x5173;&#x4E8E;&#x300A;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x300B;&#x7684;&#x5BF9;&#x8BDD;</p>
<pre><code>*Dominik said* What did you guys think about the latest Game of Thrones
episode?
*Grace said* I thought Tyrion was really great in it!
*John said* I agree with Grace. Tyrion deserves an Emmy for his performance.
</code></pre><p>&#x5728;&#x672C;&#x7AE0;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x60A8;&#x5C06;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x5141;&#x8BB8;&#x8FDB;&#x884C;&#x6B64;&#x8BA8;&#x8BBA;&#x3002;&#x8BA9;&#x6211;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5B8C;&#x6210;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x6E05;&#x5355; 3.1 &#x4E2D;&#x6982;&#x8FF0;&#x7684;&#x5BF9;&#x8BDD;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<p>&#x6267;&#x884C;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7EC4;&#x4EF6;&#x5E76;&#x5141;&#x8BB8;&#x5B83;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x540E;&#xFF0C;&#x6211;&#x5C06;&#x80FD;&#x591F;&#x5F00;&#x59CB;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;&#x6211;&#x5148;&#x95EE;&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x6700;&#x65B0;&#x7684;&#x300A;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x300B;&#x5267;&#x96C6;&#x6709;&#x4EC0;&#x4E48;&#x770B;&#x6CD5;&#x3002;&#x6211;&#x5C06;&#x901A;&#x8FC7;&#x5728;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x8F93;&#x5165;&#x6211;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x6309; Enter &#x952E;&#x53D1;&#x9001;&#x5B83;&#x6765;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x56FE; 3.1.&#x53D1;&#x9001;&#x6D88;&#x606F;&#x540E;&#x7684;&#x5C4F;&#x5E55;</p>
<p><img src="Images/ch03_Dominik_1.png" alt="ch03 Dominik 1"></p>
<p>&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#x90FD;&#x4F1A;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x6536;&#x5230;&#x8FD9;&#x6761;&#x6D88;&#x606F;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5411;&#x4E24;&#x8005;&#x663E;&#x793A;&#x5B83;&#x3002;</p>
<p>&#x56FE; 3.2.&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#x7684;&#x5C4F;&#x5E55;</p>
<p><img src="Images/ch03_john_grace.png" alt="ch03 john grace"></p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8BE5;&#x6D88;&#x606F;&#x4EE5;&#x591A;&#x7C73;&#x5C3C;&#x514B;&#x8BF4;&#x4E3A;&#x524D;&#x7F00;&#xFF0C;&#x8BA9;&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#x77E5;&#x9053;&#x662F;&#x8C01;&#x53D1;&#x9001;&#x4E86;&#x6D88;&#x606F;&#x3002;&#x7136;&#x540E;&#xFF0C;Grace &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x952E;&#x5165;&#x5979;&#x7684;&#x56DE;&#x590D;&#x5E76;&#x6309; Enter &#x952E;&#x53D1;&#x9001;&#x6765;&#x56DE;&#x7B54;&#x6211;&#x7684;&#x95EE;&#x9898;&#x3002;&#x7EA6;&#x7FF0;&#x548C;&#x6211;&#x90FD;&#x6536;&#x5230;&#x4E86;&#x5979;&#x7684;&#x56DE;&#x590D;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x8F7B;&#x677E;&#x5730;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x8FD9;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x8BA9;&#x60A8;&#x5728;&#x672C;&#x7AE0;&#x7ED3;&#x675F;&#x65F6;&#x4E86;&#x89E3;&#x60A8;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x50CF;&#x5305;&#x542B;&#x56FE;&#x5F62;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x5B8C;&#x6574;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90A3;&#x6837;&#x4EE4;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x59CB;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x7EE7;&#x7EED;&#x8BA8;&#x8BBA;&#x6B64;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x65B9;&#x9762;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5176;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;</p>
<p>  <strong>&#x7F51;&#x7EDC;&#x67B6;&#x6784;&#x548C;&#x6A21;&#x578B;</strong></p>
<p>&#x6B64;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7F51;&#x7EDC;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF1A;&#x5BF9;&#x7B49;&#x7F51;&#x7EDC;&#x548C;&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x5668;&#x6A21;&#x578B;&#x3002;&#x4F7F;&#x7528;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x670D;&#x52A1;&#x5668;;&#x76F8;&#x53CD;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x8FDE;&#x63A5;&#x5230;&#x591A;&#x4E2A;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x3002;&#x4F7F;&#x7528;&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x5668;&#x6A21;&#x578B;&#xFF0C;&#x6240;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x8FDE;&#x63A5;&#x5230;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x3002;&#x6D88;&#x606F;&#x5168;&#x90E8;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x5B83;&#x4EEC;&#x91CD;&#x65B0;&#x5206;&#x53D1;&#x5230;&#x6B63;&#x786E;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x56FE; 3.3.&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x5668;&#x4E0E;&#x70B9;&#x5BF9;&#x70B9;</p>
<p><img src="Images/ch03_network_models.png" alt="ch03 network models"></p>
<p>&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x5668;&#x6A21;&#x578B;&#x662F;&#x4E24;&#x8005;&#x4E2D;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x4E2A;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x60A8;&#x5C06;&#x8981;&#x7F16;&#x5199;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x5C06;&#x7528;&#x4F5C;&#x6B64;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x8981;&#x8003;&#x8651;&#x7684;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF0C;&#x60A8;&#x5C06;&#x4F7F;&#x7528;&#x8BE5;&#x534F;&#x8BAE;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F20;&#x8F93;&#x6D88;&#x606F;&#x3002;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x534F;&#x8BAE;&#x662F;TCP&#x548C;UDP&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x534F;&#x8BAE;&#x90FD;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5728;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x65B9;&#x9762;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;</p>
<p>TCP &#x534F;&#x8BAE;&#x6700;&#x91CD;&#x8981;&#x7684;&#x529F;&#x80FD;&#x662F;&#x5B83;&#x786E;&#x4FDD;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x5230;&#x5176;&#x76EE;&#x7684;&#x5730;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x968F;&#x6D88;&#x606F;&#x4E00;&#x8D77;&#x53D1;&#x9001;&#x989D;&#x5916;&#x4FE1;&#x606F;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x4EE5;&#x9A8C;&#x8BC1;&#x6D88;&#x606F;&#x662F;&#x5426;&#x5DF2;&#x6B63;&#x786E;&#x4F20;&#x9012;&#x3002;TCP &#x534F;&#x8BAE;&#x4EE5;&#x727A;&#x7272;&#x67D0;&#x4E9B;&#x6027;&#x80FD;&#x4E3A;&#x4EE3;&#x4EF7;&#x6765;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;</p>
<p>UDP &#x534F;&#x8BAE;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x4F7F;&#x7528;UDP&#xFF0C;&#x6570;&#x636E;&#x88AB;&#x5FEB;&#x901F;&#x53D1;&#x9001;&#xFF0C;&#x534F;&#x8BAE;&#x4E0D;&#x4F1A;&#x68C0;&#x67E5;&#x6570;&#x636E;&#x662F;&#x5426;&#x5230;&#x8FBE;&#x76EE;&#x7684;&#x5730;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;UDP&#x7684;&#x6027;&#x80FD;&#x4F18;&#x4E8E;TCP&#xFF0C;&#x4F46;&#x5177;&#x6709;&#x4F7F;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x53EF;&#x9760;&#x6027;&#x964D;&#x4F4E;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x662F;&#x9AD8;&#x6548;&#x7684;&#xFF0C;&#x4F46;&#x6D88;&#x606F;&#x7684;&#x53EF;&#x9760;&#x4F20;&#x9012;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x4EC5;&#x57FA;&#x4E8E;&#x8FD9;&#x4E00;&#x65B9;&#x9762;&#xFF1A;TCP&#x83B7;&#x80DC;&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#x610F; &#x7F51;&#x7EDC;
&#x5173;&#x4E8E;&#x7F51;&#x7EDC;&#x4E3B;&#x9898;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x8981;&#x591A;&#x5F97;&#x591A;&#xFF0C;&#x8FD9;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x4E66;&#x7684;&#x8303;&#x56F4;&#x3002;&#x5982;&#x679C;&#x60A8;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x6211;&#x9F13;&#x52B1;&#x60A8;&#x8FDB;&#x4E00;&#x6B65;&#x7814;&#x7A76;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x3002;</p>
</blockquote>
<p><strong>&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7EC4;&#x4EF6;</strong></p>
<p>&#x73B0;&#x5728;&#x60A8;&#x5BF9;&#x7F51;&#x7EDC;&#x65B9;&#x9762;&#x6709;&#x6240;&#x4E86;&#x89E3;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8C08;&#x8C08;&#x8F6F;&#x4EF6;&#x7684;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;&#x8BA1;&#x5212;&#x662F;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x79F0;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x7EC4;&#x4EF6;&#xFF0C;&#x5C06;&#x670D;&#x52A1;&#x5668;&#x79F0;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x5F53;&#x670D;&#x52A1;&#x5668;&#x9996;&#x6B21;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x5F00;&#x59CB;&#x4FA6;&#x542C;&#x6765;&#x81EA;&#x7279;&#x5B9A;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x7AEF;&#x53E3;&#x5C06;&#x88AB;&#x786C;&#x7F16;&#x7801;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#xFF0C;&#x5E76;&#x63D0;&#x524D;&#x9009;&#x62E9;&#xFF0C;&#x4EE5;&#x514D;&#x4E0E;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x51B2;&#x7A81;&#x3002;&#x6211;&#x4E0D;&#x5E0C;&#x671B;&#x5B83;&#x963B;&#x6B62;&#x4F60;&#x73B0;&#x5728;&#x4EAB;&#x53D7;&#x300A;&#x4F7F;&#x547D;&#x53EC;&#x5524;&#x300B;&#x7684;&#x7CBE;&#x5F69;&#x6E38;&#x620F;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x4E00;&#x65E6;&#x68C0;&#x6D4B;&#x5230;&#x8BE5;&#x7AEF;&#x53E3;&#x4E0A;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x63A5;&#x53D7;&#x8BE5;&#x8FDE;&#x63A5;&#x5E76;&#x7B49;&#x5F85;&#x6765;&#x81EA;&#x8BE5;&#x7AEF;&#x53E3;&#x7684;&#x6D88;&#x606F;&#x3002;&#x65B0;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x5C06;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x524D;&#x63A5;&#x53D7;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x9996;&#x6B21;&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x8FDE;&#x63A5;&#x5230;&#x7528;&#x6237;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#x6307;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x3002;&#x6210;&#x529F;&#x8FDE;&#x63A5;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7528;&#x6237;&#x5C06;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x8F93;&#x5165;&#x6D88;&#x606F;&#x6765;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x8FD8;&#x5C06;&#x4E3B;&#x52A8;&#x4FA6;&#x542C;&#x6765;&#x81EA;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x4E00;&#x65E6;&#x6536;&#x5230;&#x6D88;&#x606F;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x663E;&#x793A;&#x7ED9;&#x7528;&#x6237;&#x3002;</p>
<p>&#x56FE; 3.4.&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x64CD;&#x4F5C;</p>
<p><img src="Images/ch03_chat_server.png" alt="ch03 chat server"></p>
<p>&#x8FD9;&#x4E9B;&#x53EA;&#x662F;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x3002;&#x56FE; 3.8 &#x663E;&#x793A;&#x4E86;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x6D89;&#x53CA; 3 &#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7B80;&#x5355;&#x7528;&#x4F8B;&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x3002;Dom&#x3001;John &#x548C; Grace &#x90FD;&#x662F;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x56FE; 3.8 &#x663E;&#x793A;&#x4E86; Dom &#x901A;&#x8FC7;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001; <code>Hello</code> &#x6D88;&#x606F;&#x3002;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x63A5;&#x53D7;&#x6B64;&#x6D88;&#x606F;&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;&#x5F53;&#x524D;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x7684;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x56FE; 3.8 &#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x573A;&#x666F;&#x3002;</p>
<p>&#x60A8;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5BF9;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x51C6;&#x5907;&#x597D;&#x5F00;&#x59CB;&#x5B9E;&#x65BD;&#x5B83;&#x3002;&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#xFF01;</p>
<h2 id="32-&#x542F;&#x52A8;&#x9879;&#x76EE;">3.2 &#x542F;&#x52A8;&#x9879;&#x76EE;</h2>
<p>&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x5BF9;&#x8981;&#x6784;&#x5EFA;&#x7684;&#x5185;&#x5BB9;&#x6709;&#x6240;&#x4E86;&#x89E3;&#x3002;&#x4E0A;&#x4E00;&#x8282;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E86;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;&#x672C;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x5F00;&#x59CB;&#x9879;&#x76EE;&#x6240;&#x9700;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x3002;&#x672C;&#x7AE0;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x7EC3;&#x4E60;&#xFF0C;&#x6211;&#x9F13;&#x52B1;&#x4F60;&#x5728;&#x9605;&#x8BFB;&#x5B83;&#x65F6;&#x8DDF;&#x968F;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x611F;&#x5230;&#x60CA;&#x8BB6;&#xFF0C;&#x4F46;&#x5728;Nim&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x975E;&#x5E38;&#x5FEB;&#x901F;&#x548C;&#x5BB9;&#x6613;&#x7684;&#x3002;&#x53EA;&#x9700;&#x6253;&#x5F00;&#x60A8;&#x559C;&#x7231;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6587;&#x4EF6;&#x5E76;&#x5F00;&#x59CB;&#x7F16;&#x7801;&#x3002;&#x4F46;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x786E;&#x5B9A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x3002;&#x8FD9;&#x662F;&#x5B8C;&#x5168;&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5C06;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x4FDD;&#x5B58;&#x5728; <code>C:\code</code> &#x4E2D;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x4F1A;&#x4ECB;&#x610F;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x662F;&#x4E0D;&#x597D;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x4EC5;&#x4E3A;&#x6B64;&#x9879;&#x76EE;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x76EE;&#x5F55;&#xFF0C;&#x4F8B;&#x5982; <code>C:\code\ChatApp</code> &#xFF08;&#x6216;~/code/ChatApp&#xFF09;&#x3002;&#x5728;&#x8BE5;&#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; <code>src</code> &#x76EE;&#x5F55;&#x4EE5;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x5C06;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x521B;&#x5EFA;&#x5176;&#x4ED6;&#x76EE;&#x5F55;&#xFF0C;&#x5982; <code>tests</code> &#x3001; <code>images</code> &#x3001; <code>docs</code> &#x7B49;&#x3002;&#x5927;&#x591A;&#x6570;&#x5176;&#x4ED6;Nim&#x9879;&#x76EE;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#x5E03;&#x5C40;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x5F88;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x53EA;&#x4F7F;&#x7528; <code>src</code> &#x76EE;&#x5F55;<em>&#x4E0B;&#x9762;&#x7684;&#x6E05;&#x5355;3.2</em>&#x663E;&#x793A;&#x4E86;&#x5178;&#x578B;&#x7684;Nim&#x9879;&#x76EE;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.2.&#x5178;&#x578B;&#x76EE;&#x5F55;&#x5E03;&#x5C40;</p>
<p>MyAwesomeApp   <1>
&#x251C;&#x2500;&#x2500; bin        <2>
&#x2502;   &#x2514;&#x2500;&#x2500; MyAwesomeApp
&#x251C;&#x2500;&#x2500; images     <3>
&#x2502;   &#x2514;&#x2500;&#x2500; logo.png
&#x251C;&#x2500;&#x2500; src        <4>
&#x2502;   &#x2514;&#x2500;&#x2500; MyAwesomeApp.nim
&#x2514;&#x2500;&#x2500; tests      <5>
    &#x2514;&#x2500;&#x2500; generictest.nim</5></4></3></2></1></p>
<blockquote>
<p><1>     <code>MyAwesomeApp</code> &#x9879;&#x76EE;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x3002;</1></p>
<p><2>    &#x6B64;&#x76EE;&#x5F55;&#x5305;&#x542B;&#x6B64;&#x9879;&#x76EE;&#x7684;&#x6240;&#x6709;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;</2></p>
<p><3>    &#x6B64;&#x76EE;&#x5F55;&#x5305;&#x542B;&#x6B64;&#x9879;&#x76EE;&#x4F7F;&#x7528;&#x7684;&#x6240;&#x6709;&#x56FE;&#x50CF;&#x3002;</3></p>
<p><4>    &#x6B64;&#x76EE;&#x5F55;&#x5305;&#x542B;&#x4E0E;&#x6B64;&#x9879;&#x76EE;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709; Nim &#x6E90;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x3002;</4></p>
<p><5>    &#x6B64;&#x76EE;&#x5F55;&#x5305;&#x542B;&#x6240;&#x6709; Nim &#x6E90;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5BF9; <code>src</code> &#x4E2D;&#x5305;&#x542B;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x6D4B;&#x8BD5;&#x3002;</5></p>
<p>&#x6CE8;&#x91CA; &#x9879;&#x76EE;&#x76EE;&#x5F55;&#x5E03;&#x5C40;
&#x826F;&#x597D;&#x7684;&#x9879;&#x76EE;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x662F;&#x975E;&#x5E38;&#x6709;&#x76CA;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x6700;&#x597D;&#x5C3D;&#x65E9;&#x8BBE;&#x7F6E;&#x5B83;&#x3002;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6E90;&#x4EE3;&#x7801;&#x4E0E;&#x6D4B;&#x8BD5;&#x5206;&#x5F00;&#x610F;&#x5473;&#x7740;&#x60A8;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x7F16;&#x5199;&#x4E0D;&#x51B2;&#x7A81;&#x6216;&#x4E0D;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5206;&#x79BB;&#x4E5F;&#x4F7F;&#x4EE3;&#x7801;&#x5BFC;&#x822A;&#x66F4;&#x5BB9;&#x6613;&#x3002;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#x5728; <code>src</code> &#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x4EF6; <code>client.nim</code> &#x3002;&#x6B64;&#x6587;&#x4EF6;&#x5C06;&#x7F16;&#x8BD1;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6; <code>client</code> &#xFF0C;&#x5E76;&#x5145;&#x5F53;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5C0F;&#x6D4B;&#x8BD5;&#xFF0C;&#x9996;&#x5148;&#x5C06;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x5199;&#x5165;&#x65B0;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x4FDD;&#x5B58; <code>client.nim</code> &#x3002;</p>
<pre><code class="lang-nim">echo(<span class="hljs-string">&quot;Chat application started&quot;</span>)
</code></pre>
<p>&#x4E3A;&#x4E86;&#x7F16;&#x8BD1;&#x60A8;&#x7684;&#x65B0; <code>client.nim</code> &#x6587;&#x4EF6;&#xFF0C;&#x8BF7;&#x6309;&#x7167;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x64CD;&#x4F5C;&#x3002;</p>
<p>1.&#x6253;&#x5F00;&#x65B0;&#x7684;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x3002;
2.&#x901A;&#x8FC7;&#x6267;&#x884C; <code>cd ~/code/ChatApp</code> &#x5C06; <code>cd</code> &#x63D2;&#x5165;&#x9879;&#x76EE;&#x76EE;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;~/codeChatApp&#x5E94;&#x66FF;&#x6362;&#x4E3A;&#x9879;&#x76EE;&#x76EE;&#x5F55;&#x7684;&#x8DEF;&#x5F84;&#x3002;
3.&#x901A;&#x8FC7;&#x6267;&#x884C; <code>nim c src/client.nim</code> &#x7F16;&#x8BD1; <code>client.nim</code> &#x6587;&#x4EF6;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A; Aporia 
&#x5982;&#x679C;&#x60A8;&#x4F7F;&#x7528;&#x7684;&#x662F;Aporia&#xFF0C;&#x5219;&#x53EA;&#x9700;&#x6309;F4&#x6216;&#x5728;&#x83DC;&#x5355;&#x680F;&#x4E2D;&#x9009;&#x62E9;&#x5DE5;&#x5177;&gt;&#x7F16;&#x8BD1;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x5373;&#x53EF;&#x7F16;&#x8BD1;&#x5F53;&#x524D;&#x9009;&#x5B9A;&#x7684;&#x9009;&#x9879;&#x5361;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x6309; F5 &#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#x3002;</p>
</blockquote>
<p>&#x5982;&#x679C;&#x60A8;&#x6B63;&#x786E;&#x5B8C;&#x6210;&#x4E86;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x56FE; 3.5.&#x6210;&#x529F;&#x7F16;&#x8BD1; <code>client.nim</code>  <code>.</code> </p>
<p><img src="Images/ch03_successful_compilation.png" alt="ch03 successful compilation"></p>
<blockquote>
<p>&#x63D0;&#x793A;&#x8F93;&#x51FA;&#x76EE;&#x5F55;
&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Nim&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x5728;&#x4E0E;&#x7F16;&#x8BD1;&#x6587;&#x4EF6;&#x76F8;&#x540C;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x751F;&#x6210;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>-o</code> &#x6807;&#x5FD7;&#x6765;&#x66F4;&#x6539;&#x6B64;&#x8BBE;&#x7F6E;&#x3002;&#x4F8B;&#x5982;&#xFF0C; <code>nim c -o:chat src/client.nim</code>  &#x5C06;&#x5728;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x653E;&#x7F6E;&#x4E00;&#x4E2A; <code>chat</code> &#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;</p>
</blockquote>
<p>&#x5047;&#x8BBE;&#x7F16;&#x8BD1;&#x6210;&#x529F;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x521B;&#x5EFA;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x542F;&#x52A8;&#x4E86;&#x3002;&#x8981;&#x5F00;&#x59CB;&#x6267;&#x884C;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;/src/client&#x3002;&#x8FD9;&#x5C06;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A; <code>Chat application started</code> &#xFF0C;&#x7136;&#x540E;&#x9000;&#x51FA;&#x3002;</p>
<p>&#x60A8;&#x73B0;&#x5728;&#x6709;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#x7684;&#x826F;&#x597D;&#x8D77;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x8D77;&#x6B65;&#x5F88;&#x6162;&#xFF0C;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E76;&#x6CA1;&#x6709;&#x505A;&#x592A;&#x591A;&#x4E8B;&#x60C5;&#x3002;&#x4F46;&#x5B83;&#x5E94;&#x8BE5;&#x8BA9;&#x60A8;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x542F;&#x52A8; Nim &#x4E2D;&#x7684;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x786E;&#x4FDD; Nim &#x7F16;&#x8BD1;&#x5668;&#x5728;&#x60A8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x60A8;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4E86;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x7B2C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF1A;&#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;&#x3002;</p>
<h2 id="33-&#x68C0;&#x7D22;&#x5BA2;&#x6237;&#x7AEF;&#x7EC4;&#x4EF6;&#x4E2D;&#x7684;&#x8F93;&#x5165;">3.3 &#x68C0;&#x7D22;&#x5BA2;&#x6237;&#x7AEF;&#x7EC4;&#x4EF6;&#x4E2D;&#x7684;&#x8F93;&#x5165;</h2>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x5E0C;&#x671B;&#x4ECE;&#x7528;&#x6237;&#x90A3;&#x91CC;&#x83B7;&#x5F97;&#x67D0;&#x79CD;&#x6307;&#x5BFC;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x8981;&#x5BFC;&#x822A;&#x5230;&#x7684;&#x7F51;&#x7AD9;&#x7684; URL &#x6216;&#x8981;&#x64AD;&#x653E;&#x7684;&#x89C6;&#x9891;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x8FD9;&#x79CD;&#x6307;&#x5BFC;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#xFF08;&#x8FD8;&#xFF09;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x4ECE;&#x6211;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x4E2D;&#x8BFB;&#x53D6;&#x6211;&#x4EEC;&#x7684;&#x610F;&#x56FE;&#xFF0C;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x547D;&#x4EE4;&#x6216;&#x9F20;&#x6807;&#x70B9;&#x51FB;&#x5F62;&#x5F0F;&#x7684;&#x660E;&#x786E;&#x6307;&#x4EE4;&#x3002;&#x6307;&#x5BFC;&#x8F6F;&#x4EF6;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#x7ED9;&#x5B83;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x5728;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x66F4;&#x5177;&#x4F53;&#x5730;&#x8BF4;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x7EC4;&#x4EF6;&#x3002;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;&#x5B83;&#x6240;&#x9700;&#x7684;&#x8F93;&#x5165;&#x7247;&#x6BB5;&#x5C06;&#x5305;&#x62EC;&#x8981;&#x5411;&#x5176;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5730;&#x5740;&#x4EE5;&#x53CA;&#x8981;&#x53D1;&#x9001;&#x5230;&#x8BE5;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E00;&#x6761;&#x6216;&#x591A;&#x6761;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x6700;&#x4F4E;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x4E00;&#x79CD;&#x65E2;&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7279;&#x5B9A;&#x8F93;&#x5165;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53C8;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x5B9E;&#x9645;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x952E;&#x76D8;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7528;&#x6237;&#x6240;&#x9700;&#x7684;&#x6700;&#x4F4E;&#x6570;&#x636E;&#x8981;&#x6C42;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x8FDE;&#x63A5;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5730;&#x5740;&#x6709;&#x4E9B;&#x5173;&#x952E;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x5730;&#x5740;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x542F;&#x52A8;&#x540E;&#x7ACB;&#x5373;&#x5411;&#x7528;&#x6237;&#x8BE2;&#x95EE;&#x8BE5;&#x4FE1;&#x606F;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x524D;&#xFF0C;&#x7528;&#x6237;&#x5C06;&#x65E0;&#x6CD5;&#x53D1;&#x9001;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x8981;&#x6C42;&#x7528;&#x6237;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x4E4B;&#x540E;&#x3002;</p>
<p><strong>&#x68C0;&#x7D22;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;</strong></p>
<p>&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4ECE;&#x7528;&#x6237;&#x90A3;&#x91CC;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF1A;</p>
<p>&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#x4F20;&#x9012;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;
&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x8BFB;&#x53D6;&#x3002;
&#x901A;&#x5E38;&#xFF0C;&#x4E00;&#x6761;&#x4FE1;&#x606F;&#xFF08;&#x5982;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#xFF09;&#x5C06;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x5F00;&#x59CB;&#x65F6;&#x77E5;&#x9053;&#x3002;</p>
<p>&#x5728;Nim&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>os</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>paramStr</code> &#x8FC7;&#x7A0B;&#x8BBF;&#x95EE;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x3002;&#x8981;&#x4F7F;&#x7528; <code>paramStr</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x5BFC;&#x5165; <code>os</code> &#x6A21;&#x5757;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x5728; <code>client.nim</code> &#x6587;&#x4EF6;&#x7684;&#x9876;&#x90E8;&#x6DFB;&#x52A0; <code>import os</code> &#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x6269;&#x5C55; <code>client.nim</code> &#x4EE5;&#x8BFB;&#x53D6;&#x7B2C;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x4E3A;<em>&#x6E05;&#x5355;3.3</em>&#x4E2D;&#x5217;&#x51FA;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6DFB;&#x52A0;&#x7684;&#x4EE3;&#x7801;&#x4EE5;&#x7C97;&#x4F53;&#x663E;&#x793A;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.3.&#x8BFB;&#x53D6;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;</p>
<pre><code class="lang-nim">**<span class="hljs-keyword">import</span> os**                 <span class="hljs-comment"># &lt;1&gt;</span>
echo(<span class="hljs-string">&quot;Chat application started&quot;</span>)
**<span class="hljs-keyword">if</span> paramCount() == <span class="hljs-number">0</span>:**     <span class="hljs-comment"># &lt;2&gt;</span>
  **quit(<span class="hljs-string">&quot;Please specify the server address, e.g. ./client localhost&quot;</span>)**     <span class="hljs-comment"># &lt;3&gt;</span>

**<span class="hljs-keyword">let</span> serverAddr = paramStr(<span class="hljs-number">1</span>)**           <span class="hljs-comment"># &lt;4&gt;</span>
**echo(<span class="hljs-string">&quot;Connecting to &quot;</span>, serverAddr)**     <span class="hljs-comment"># &lt;4&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x8FD9;&#x662F;&#x4F7F;&#x7528; <code>os</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>paramCount</code> &#x8FC7;&#x7A0B;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x3002;</1></p>
<p><2>    &#x786E;&#x4FDD;&#x7528;&#x6237;&#x5DF2;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#x6307;&#x5B9A;&#x4E86;&#x53C2;&#x6570;&#x3002;</2></p>
<p><3>    &#x8FC7;&#x65E9;&#x505C;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8BE5;&#x53C2;&#x6570;&#xFF0C;&#x5B83;&#x5C06;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x3002;</3></p>
<p><4>    &#x68C0;&#x7D22;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x914D;&#x7ED9;&#x65B0; <code>serverAddr</code> &#x53D8;&#x91CF;&#x3002;</4></p>
<p><5>    &#x5411;&#x7528;&#x6237;&#x663E;&#x793A;&#x6D88;&#x606F;&quot;Connecting to <serveraddr>&quot;&#xFF0C;&#x5176;&#x4E2D;  <code>&lt;serverAddr&gt;</code>  &#x662F;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x7684;&#x5730;&#x5740;&#x3002;</serveraddr></5></p>
</blockquote>
<p>&#x68C0;&#x67E5;&#x63D0;&#x4F9B;&#x7ED9;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x7684;&#x53C2;&#x6570;&#x6570;&#x91CF;&#x603B;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002; <code>paramCount</code> &#x8FC7;&#x7A0B;&#x4EE5;&#x6574;&#x6570;&#x5F62;&#x5F0F;&#x8FD4;&#x56DE;&#x53C2;&#x6570;&#x6570;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x68C0;&#x67E5;&#x53C2;&#x6570;&#x7684;&#x6570;&#x91CF;&#x662F;&#x5426;&#x4E3A;0&#xFF0C;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x5219;&#x8C03;&#x7528;&#x9000;&#x51FA;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x7684;&#x8BE6;&#x7EC6;&#x6D88;&#x606F;&#x3002;&#x9000;&#x51FA;&#x8FC7;&#x7A0B;&#x9000;&#x51FA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x679C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x5B83;&#x5C06;&#x9996;&#x5148;&#x663E;&#x793A;&#x8BE5;&#x6D88;&#x606F;&#x5E76;&#x9000;&#x51FA;&#xFF0C;&#x9000;&#x51FA;&#x4EE3;&#x7801;&#x544A;&#x8BC9;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5931;&#x8D25;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7528;&#x6237;&#x786E;&#x5B9E;&#x63D0;&#x4F9B;&#x4E86;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#xFF0C;&#x5219;&#x4F7F;&#x7528; <code>paramStr</code> &#x8FC7;&#x7A0B;&#x68C0;&#x7D22;&#x63D0;&#x4F9B;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x4F7F;&#x7528;&#x7D22;&#x5F15;1&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x540D;&#x5B58;&#x50A8;&#x5728;&#x7D22;&#x5F15;0&#x5904;&#x3002;&#x7136;&#x540E;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x7ED1;&#x5B9A;&#x5230; <code>serverAddr</code> &#x53D8;&#x91CF;&#x3002;</p>
<blockquote>
<p>[&#x8B66;&#x544A;]    &#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x540D;&#x79F0;
&#x4E0D;&#x8981;&#x901A;&#x8FC7;  <code>paramStr(0)</code> &#x68C0;&#x7D22;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x540D;&#x79F0;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x4F9B;&#x4E0D;&#x53EF;&#x79FB;&#x690D;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7279;&#x5B9A;&#x6570;&#x636E;&#x3002;&#x5E94;&#x6539;&#x7528;  <code>os</code>  &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>getAppFilename</code> &#x8FC7;&#x7A0B;&#x3002;    </p>
<p>[&#x6CE8;&#x610F;]    &#x59CB;&#x7EC8;&#x4F7F;&#x7528; <code>paramCount</code> 
|&#x5F53;&#x901A;&#x8FC7;&#x4E0D;&#x5B58;&#x5728;&#x7684;  <code>paramStr</code> &#x8FC7;&#x7A0B;&#x8BBF;&#x95EE;&#x53C2;&#x6570;&#x65F6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5F53; <code>paramCount() == 1</code> &#x65F6;&#x4E3A; <code>paramStr(56)</code> &#xFF09;&#xFF0C;&#x4F1A;&#x5F15;&#x53D1; <code>IndexError</code> &#x5F02;&#x5E38;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x59CB;&#x7EC8;&#x63D0;&#x524D;&#x4F7F;&#x7528;  <code>paramCount</code> &#x6765;&#x68C0;&#x67E5;&#x5DF2;&#x63D0;&#x4F9B;&#x7684;&#x53C2;&#x6570;&#x6570;&#x91CF;&#x3002;</p>
</blockquote>
<p><em>&#x6E05;&#x5355;3.3</em>&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x884C;&#x4F7F;&#x7528; <code>echo</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x663E;&#x793A;&#x9644;&#x52A0;&#x5230; <code>serverAddr</code> &#x53D8;&#x91CF;&#x5185;&#x5BB9;&#x7684;&#x5B57;&#x7B26;&#x4E32; <code>Connecting to</code> &#x3002; <code>echo</code> &#x8FC7;&#x7A0B;&#x63A5;&#x53D7;&#x53EF;&#x53D8;&#x6570;&#x91CF;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x5728;&#x540C;&#x4E00;&#x884C;&#x4E2D;&#x663E;&#x793A;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<blockquote>
<p>[&#x63D0;&#x793A;] &#x5206;&#x6790;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570; 
&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x4E3A;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x5B9E;&#x73B0;&#x7279;&#x6B8A;&#x8BED;&#x6CD5;&#x3002;&#x6B64;&#x8BED;&#x6CD5;&#x5305;&#x62EC; <code>--help</code> &#x7B49;&#x6807;&#x5FD7;&#x3002;&#x5C3C;&#x59C6;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x5305;&#x542B;&#x7684; <code>parseopt</code> &#x6A21;&#x5757;&#x5141;&#x8BB8;&#x89E3;&#x6790;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x3002;Nim&#x793E;&#x533A;&#x8FD8;&#x4E3A;&#x68C0;&#x7D22;&#x548C;&#x89E3;&#x6790;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x521B;&#x5EFA;&#x4E86;&#x5176;&#x4ED6;&#x66F4;&#x76F4;&#x89C2;&#x7684;&#x5305;&#xFF0C;&#x60A8;&#x5C06;&#x5728;&#x672C;&#x4E66;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x5305;&#x3002;</p>
</blockquote>
<p>&#x4F7F;&#x7528;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x7684;&#x547D;&#x4EE4;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x65B0;&#x7684; <code>client.nim</code> &#x6A21;&#x5757;&#xFF0C;&#x5E76;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x6267;&#x884C;&#x5B83;&#x3002;</p>
<p>&#x56FE; 3.6.&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x53C2;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x542F;&#x52A8;&#x5BA2;&#x6237;&#x7AEF;</p>
<p><img src="Images/ch03_exec1.png" alt="ch03 exec1"></p>
<p>&#x5982;&#x60A8;&#x5728;<em>&#x56FE;3.10</em>&#x4E2D;&#x6240;&#x89C1;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x7ACB;&#x5373;&#x9000;&#x51FA;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x6D88;&#x606F;<em> <code>Please specify the server address&#xFF0C;e.g./client localhost</code> </em>&#x3002;&#x73B0;&#x5728;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x6267;&#x884C;&#x5B83;&#xFF0C;&#x5982;&#x793A;&#x4F8B;&#x4E2D;&#x6240;&#x793A;&#xFF1A; <code>src/client localhost</code> &#x3002;</p>
<p>&#x56FE; 3.7.&#x4F7F;&#x7528;1&#x4E2A;&#x53C2;&#x6570;&#x542F;&#x52A8;&#x5BA2;&#x6237;&#x7AEF;</p>
<p><img src="Images/ch03_exec2.png" alt="ch03 exec2"></p>
<p>&#x60A8;&#x5C06;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x73B0;&#x5728;&#x663E;&#x793A;&#x6D88;&#x606F; <em>&quot;Connecting to localhost&quot;</em>&#xFF0C;&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x6307;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x5E76;&#x67E5;&#x770B;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x952E;&#x5165;&#x591A;&#x5C11;&#x53C2;&#x6570;&#xFF0C;&#x53EA;&#x8981;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#xFF0C;&#x6D88;&#x606F;&#x5C06;&#x59CB;&#x7EC8;&#x5305;&#x542B; <em>&quot;Connecting to &quot;</em> &#xFF0C;&#x540E;&#x8DDF;&#x6307;&#x5B9A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p><em>&#x56FE;3.12</em>&#x663E;&#x793A;&#x4E86;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x5982;&#x4F55;&#x6620;&#x5C04;&#x5230;&#x4E0D;&#x540C;&#x7684; <code>paramStr</code> &#x7D22;&#x5F15;&#x3002;</p>
<p>&#x56FE;3.8&#x63D0;&#x4F9B;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x53CA;&#x5176;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;</p>
<p><img src="Images/ch03_paramStr.png" alt="ch03 paramStr"></p>
<p>&#x73B0;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x6210;&#x529F;&#x6355;&#x83B7;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x5C06;&#x77E5;&#x9053;&#x8981;&#x8FDE;&#x63A5;&#x5230;&#x54EA;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x8003;&#x8651;&#x5411;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p><strong>&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8BFB;&#x53D6;&#x6570;&#x636E;</strong></p>
<p>&#x4E0E;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x4E4B;&#x524D;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7528;&#x6237;&#x80FD;&#x591F;&#x5B9E;&#x65F6;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x4EE5;&#x54CD;&#x5E94;&#x4ED6;&#x4EEC;&#x4ECE;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7406;&#x60F3;&#x5730;&#x505A;&#x7684;&#x662F;&#x59CB;&#x7EC8;&#x51C6;&#x5907;&#x597D;&#x4ECE;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x7EC8;&#x7AEF;&#x6216;&#x547D;&#x4EE4;&#x884C;&#x5185;&#x90E8;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x952E;&#x5165;&#x5B57;&#x7B26;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x68C0;&#x7D22;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x3002;&#x4E0E;Python&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>stdin</code> &#x53D8;&#x91CF;&#x8BBF;&#x95EE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x3002;&#x5728;Nim&#x4E2D;&#xFF0C;&#x6B64;&#x53D8;&#x91CF;&#x5728;&#x9690;&#x5F0F;&#x5BFC;&#x5165;&#x7684; <code>system</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x5176;&#x7C7B;&#x578B;&#x4E3A; <code>File</code> &#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x50CF;&#x8BFB;&#x53D6;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&quot;&#x6587;&#x4EF6;&quot;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#x8BFB;&#x53D6;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x3002;&#x4E3A;&#x4ECE; &quot;File&quot; &#x5BF9;&#x8C61;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x4E86;&#x8BB8;&#x591A;&#x8FC7;&#x7A0B;&#xFF0C;&#x901A;&#x5E38;&#x6700;&#x6709;&#x7528;&#x7684;&#x662F;&#x4ECE;&#x6307;&#x5B9A;&#x7684;&quot;File&quot;&#x8BFB;&#x53D6;&#x5355;&#x884C;&#x6570;&#x636E;&#x7684; <code>readLine</code> &#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5C06;<em>&#x6E05;&#x5355;3.4</em>&#x4E2D;&#x7684;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x5230; <code>client.nim</code> &#x7684;&#x5E95;&#x90E8;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#xFF08;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4; <code>nim c-r src/client.nim localhost</code> &#x5FEB;&#x901F;&#x5B8C;&#x6210;&#xFF09;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.4.&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8BFB;&#x53D6;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">let</span> message = <span class="hljs-literal">stdin</span>.readLine()        <span class="hljs-comment"># &lt;1&gt;</span>
echo(<span class="hljs-string">&quot;Sending \&quot;&quot;</span>, message, <span class="hljs-string">&quot;\&quot;&quot;</span>)     <span class="hljs-comment"># &lt;2&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x4E2D;&#x8BFB;&#x53D6;&#x4E00;&#x884C;&#x6587;&#x672C;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x914D;&#x7ED9;&#x53D8;&#x91CF;message&#x3002;</1></p>
<p><2>    &#x663E;&#x793A;&#x6D88;&#x606F; <em>&quot;Sending &quot;<message>&quot;&quot;</message></em>&#xFF0C;&#x5176;&#x4E2D; <code>&lt;message&gt;</code> &#x662F;&#x53D8;&#x91CF; <code>message</code> &#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x7528;&#x6237;&#x5728;&#x5176;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x952E;&#x5165;&#x7684;&#x6587;&#x672C;&#x884C;&#x3002;</2></p>
<p>&#x6CE8;&#x91CA;&#x5B57;&#x7B26;&#x8F6C;&#x4E49;&#x5E8F;&#x5217;
<em>&#x6E05;&#x5355;3.4</em>&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x884C;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x8F6C;&#x4E49;&#x5E8F;&#x5217;&#x6765;&#x663E;&#x793A;  <code>&quot;</code>  &#x5B57;&#x7B26;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x8F6C;&#x4E49;&#xFF0C;&#x5426;&#x5219;&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x8BA4;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x6587;&#x672C;&#x5DF2;&#x7ECF;&#x7ED3;&#x675F;</p>
</blockquote>
<p>&#x60A8;&#x5C06;&#x770B;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x518D;&#x7ACB;&#x5373;&#x9000;&#x51FA;&#xFF0C;&#x800C;&#x662F;&#x7B49;&#x5F85;&#x60A8;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x952E;&#x5165;&#x5185;&#x5BB9;&#x5E76;&#x6309;Enter&#x952E;&#x3002;&#x5B8C;&#x6210;&#x6B64;&#x64CD;&#x4F5C;&#x540E;&#xFF0C;&#x5C06;&#x663E;&#x793A;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x60A8;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x952E;&#x5165;&#x7684;&#x6587;&#x672C;&#x3002;</p>
<p>&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8BFB;&#x53D6;&#x5C06;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x505C;&#x6B62;&#x6267;&#x884C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x88AB; <em>&#x963B;&#x585E;</em> &#x3002;&#x4E00;&#x65E6;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x88AB;&#x5B8C;&#x5168;&#x8BFB;&#x53D6;&#xFF0C;&#x5C06;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x5728; <code>stdin.readLine</code> &#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x5411;&#x7EC8;&#x7AEF;&#x8F93;&#x5165;&#x4E00;&#x4E9B;&#x5B57;&#x7B26;&#x5E76;&#x6309;&#x4E0B; <code>Enter</code> &#x952E;&#x4E4B;&#x524D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E00;&#x76F4;&#x88AB;&#x963B;&#x585E;&#x3002;&#x5F53;&#x7528;&#x6237;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5C06;&#x4E00;&#x884C;&#x6587;&#x672C;&#x5B58;&#x50A8;&#x5230; <code>stdin</code> &#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x3002;</p>
<p>&#x963B;&#x585E;&#x662F;&#x5927;&#x591A;&#x6570;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x8C03;&#x7528;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x5E78;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x7B49;&#x5F85;&#x7528;&#x6237;&#x8F93;&#x5165;&#x65F6;&#x5C06;&#x65E0;&#x6CD5;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4E3B;&#x52A8;&#x4FDD;&#x6301;&#x4E0E;&#x804A;&#x5929;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x7B49;&#x5F85;&#x7528;&#x6237;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x952E;&#x5165;&#x6587;&#x672C;&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9; <em>&#x4E0B;&#x56FE;3.13</em> &#x663E;&#x793A;&#x4E86;&#x8FD9;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x56FE;3.9.&#x5BA2;&#x6237;&#x7AEF;&#x88AB;&#x65E0;&#x9650;&#x671F;&#x963B;&#x585E;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;</p>
<p><img src="Images/ch03_client_blocked.png" alt="ch03 client blocked"></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E4B;&#x524D;&#x3002;&#x6E05;&#x5355; 3.4 &#x4E2D;&#x7F3A;&#x5C11;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4EE3;&#x7801;&#x53EA;&#x8BFB;&#x53D6;&#x6D88;&#x606F;&#x4E00;&#x6B21;&#xFF0C;&#x4F46;&#x76EE;&#x7684;&#x662F;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x53D1;&#x9001;&#x591A;&#x6761;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x4F7F;&#x7528;  <code>while</code>  &#x8BED;&#x53E5;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x3002;&#x53EA;&#x9700;&#x5C06;&#x6E05;&#x5355; 3.4 &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x5305;&#x88C5;&#x5728;  <code>while</code>  &#x8BED;&#x53E5;&#x4E2D;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">let</span> message = <span class="hljs-literal">stdin</span>.readLine()     <span class="hljs-comment"># &lt;2&gt;</span>
  echo(<span class="hljs-string">&quot;Sending \&quot;&quot;</span>, message, <span class="hljs-string">&quot;\&quot;&quot;</span>)
</code></pre>
<blockquote>
<p><1>    &#x8BE5;&#x8BED;&#x53E5;&#x5C06;&#x5728;&#x5176;&#x6B63;&#x6587;&#x4E2D;&#x91CD;&#x590D;&#x8FD9;&#x4E9B;&#x8BED;&#x53E5;&#xFF0C;&#x800C;&#x5176;&#x6761;&#x4EF6;&#x4E3A; &#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x5C06;&#x91CD;&#x590D;&#x5176;&#x4E0B;&#x9762;&#x7684;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x76F4;&#x5230;&#x7528;&#x6237;&#x624B;&#x52A8;&#x5173;&#x95ED;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;whiletrue</1></p>
<p><2>    &#x8FD9;&#x4E24;&#x884C;&#x5C06;&#x65E0;&#x9650;&#x91CD;&#x590D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5728; while &#x8BED;&#x53E5;&#x4E0B;&#x7F29;&#x8FDB;&#x3002;</2></p>
</blockquote>
<p>&#x73B0;&#x5728;&#x518D;&#x6B21;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4EB2;&#x81EA;&#x67E5;&#x770B;&#x7ED3;&#x679C;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x8F93;&#x5165;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x6587;&#x672C;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x60A8;&#x5F53;&#x7136;&#x901A;&#x8FC7;&#x6309;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x7684; Control &#x548C; C &#x7EC4;&#x5408;&#x952E;&#xFF08;&#x540C;&#x65F6;&#x6309; Ctrl + C&#xFF09;&#x7EC8;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x7EC8;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x5E94;&#x4F1A;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x7684;&#x56DE;&#x6EAF;&#x3002;</p>
<pre><code class="lang-bash">Traceback (most recent call last)
client.nim(9)            client
sysio.nim(115)           <span class="hljs-built_in">read</span>Line
sysio.nim(72)            raiseEIO
system.nim(2531)         sysFatal
SIGINT: Interrupted by Ctrl-C.
</code></pre>
<p>&#x7EC8;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x786E;&#x5B9A;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x6267;&#x884C;&#x54EA;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x4E0A;&#x9762;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EC8;&#x6B62;&#x65F6;&#xFF0C; <code>client.nim</code>  &#x4E2D;&#x7684;&#x7B2C; 9 &#x884C;&#x6B63;&#x5728;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x5BF9;&#x5E94;&#x4E8E;&#x7B49;&#x5F85;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x963B;&#x585E;&#x8C03;&#x7528;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">let</span> message = <span class="hljs-literal">stdin</span>.readLine()readLine
</code></pre>
<p>&#x56FE; 3.10.&#x5F53;&#x524D;&#x6267;&#x884C;client.nim</p>
<p><img src="Images/ch03_input_thread.png" alt="ch03 input thread"></p>
<p>&#x56FE; 3.14 &#x663E;&#x793A;&#x4E86; <code>client.nim</code> &#x4E2D;&#x7684;&#x5F53;&#x524D;&#x6267;&#x884C;&#x6D41;&#x7A0B;&#x3002;&#x4E3B;&#x7EBF;&#x7A0B;&#x5728;&#x7B49;&#x5F85;&#x7528;&#x6237;&#x8F93;&#x5165;&#x65F6;&#x88AB;&#x963B;&#x585E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x5904;&#x4E8E;&#x7A7A;&#x95F2;&#x72B6;&#x6001;&#xFF0C;&#x76F4;&#x5230;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x952E;&#x5165;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#x5E76;&#x6309; Enter &#x5C06;&#x5176;&#x5524;&#x9192;&#x3002;&#x8FD9;&#x662F;&#x963B;&#x585E;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x7684;&#x56FA;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x3002;&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6301;&#x4E45;&#x8FDE;&#x63A5;&#x624D;&#x80FD;&#x4ECE;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x3002;</p>
<p><strong>&#x4F7F;&#x7528; <code>spawn</code> &#x751F;&#x6210;&#x907F;&#x514D;&#x963B;&#x585E; &#x8F93;&#x5165;/&#x8F93;&#x51FA;</strong></p>
<p>&#x6709;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x3002;&#x4E00;&#x79CD;&#x662F;&#x5F02;&#x6B65;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#xFF0C;&#x5373;&#x4F7F;&#x7ED3;&#x679C;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x53EF;&#x7528;&#xFF0C;&#x5B83;&#x4E5F;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x65E0;&#x6CD5;&#x5F02;&#x6B65;&#x8BFB;&#x53D6;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x6B21;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x5F02;&#x6B65; I/O&#xFF0C;&#x4F46;&#x7A0D;&#x540E;&#x5C06;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x65F6;&#x4F7F;&#x7528;&#x3002;&#x5C4A;&#x65F6;&#x5C06;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x89E3;&#x91CA;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x8BE5;&#x7EBF;&#x7A0B;&#x5C06;&#x8BFB;&#x53D6;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#xFF0C;&#x4FDD;&#x6301;&#x4E3B;&#x7EBF;&#x7A0B;&#x7545;&#x901A;&#x65E0;&#x963B;&#x5E76;&#x81EA;&#x7531;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x3002;&#x6211;&#x73B0;&#x5728;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x4FEE;&#x6539; <code>client.nim</code> &#x4EE5;&#x5B9E;&#x73B0;&#x6B64;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x5E76;&#x884C;&#x6027;&#x7684;&#x5168;&#x90E8;&#x7EC6;&#x8282;&#x53CA;&#x5176;&#x5728; Nim &#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x4E0D;&#x63CF;&#x8FF0;&#xFF0C;&#x4F46;&#x5C06;&#x5728;&#x672C;&#x4E66;&#x540E;&#x9762;&#x4ECB;&#x7ECD;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x81F3;&#x5C11;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4EC5;&#x4ECE;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;&#x7EBF;&#x7A0B;&#x5F00;&#x59CB;&#x3002; <code>client.nim</code> &#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x5F53;&#x524D;&#x90FD;&#x5728;&#x8BE5;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x3002;&#x8C03;&#x7528;  <code>readLine</code>  &#x65F6;&#xFF0C;&#x6B64;&#x4E3B;&#x7EBF;&#x7A0B;&#x5C06;&#x88AB;&#x963B;&#x585E;&#x3002;&#x5F53;&#x7528;&#x6237;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x8F93;&#x5165;&#x4E00;&#x884C;&#x65F6;&#xFF0C;&#x7EBF;&#x7A0B;&#x5C06;&#x53D8;&#x5F97;&#x7545;&#x901A;&#x65E0;&#x963B;&#x3002;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x4EE5;&#x4F7F;&#x4E3B;&#x7EBF;&#x7A0B;&#x4FDD;&#x6301;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#xFF0C;&#x4ECE;&#x800C;&#x786E;&#x4FDD;&#x521B;&#x5EFA;&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x88AB;&#x963B;&#x585E;&#x7684;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>spawn</code> &#x8FC7;&#x7A0B;&#x5728;&#x65B0;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x6F14;&#x793A;&#x5982;&#x4F55;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;&#x5C06;&#x5176;&#x66FF;&#x6362;&#x4E3A;&#x4E4B;&#x524D;&#x521B;&#x5EFA;&#x7684; while &#x8BED;&#x53E5;&#xFF0C;&#x4F46;&#x6682;&#x65F6;&#x4E0D;&#x8981;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
  <span class="hljs-keyword">let</span> message = spawn <span class="hljs-literal">stdin</span>.readLine()     <span class="hljs-comment"># &lt;1&gt;</span>
  echo(<span class="hljs-string">&quot;Sending \&quot;&quot;</span>, ^message, <span class="hljs-string">&quot;\&quot;&quot;</span>)       <span class="hljs-comment"># &lt;2&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x73B0;&#x5728;&#x4F7F;&#x7528; <code>spawn</code> &#x5173;&#x952E;&#x5B57;&#x6765;&#x8C03;&#x7528; <code>readLine</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x5C06;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7EBF;&#x7A0B;&#x5E76;&#x5728;&#x90A3;&#x91CC;&#x6267;&#x884C; <code>readLine</code> &#x3002;</1></p>
<p><2>    &#x4ECE;&#x7EBF;&#x7A0B;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x53EF;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x8BFB;&#x53D6;&#x5B83;&#x5FC5;&#x987B;&#x7531;&#x64CD;&#x4F5C;&#x7B26; <code>^</code> &#x663E;&#x5F0F;&#x5B8C;&#x6210;&#x3002;</2></p>
</blockquote>
<p> <code>readLine</code> &#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x53EF;&#x7528;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C; <code>spawn</code>  &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>FlowVar[T]</code> &#x7684;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#x3002;&#x6B64;&#x7C7B;&#x578B;&#x4FDD;&#x5B58;&#x60A8;&#x6D3E;&#x751F;&#x7684;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x3002;</p>
<p> <code>^</code> &#x8FD0;&#x7B97;&#x7B26;&#x53EF;&#x7528;&#x4E8E;&#x68C0;&#x7D22; <code>FlowVar[T]</code> &#x7C7B;&#x578B;&#x4FDD;&#x5B58;&#x7684;&#x503C;&#x3002;&#x4F46; <code>FlowVar[T]</code> &#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x4E0D;&#x603B;&#x662F;&#x5305;&#x542B;&#x503C;&#xFF0C;&#x5B83;&#x5C06;&#x5F00;&#x59CB;&#x4E3A;&#x7A7A;&#xFF0C;&#x4E00;&#x65E6;&#x6D3E;&#x751F;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x503C;&#xFF0C; <code>FlowVar[T]</code> &#x5BF9;&#x8C61;&#x5C06;&#x5305;&#x542B;&#x8BE5;&#x503C;&#x3002;&#x5F53; <code>FlowVar[N]</code> &#x5BF9;&#x8C61;&#x4E3A;&#x7A7A;&#x65F6;&#xFF0C; <code>^</code> &#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x963B;&#x6B62;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#xFF0C;&#x76F4;&#x5230; <code>FlowVar[T]</code> &#x4E0D;&#x518D;&#x4E3A;&#x7A7A;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5F00;&#x59CB;&#x4E0D;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219; <code>^</code> &#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x4EE5;&#x4E0E;&#x524D;&#x9762;&#x4EE3;&#x7801;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>isReady</code> &#x8FC7;&#x7A0B;&#x68C0;&#x67E5; <code>FlowVar[T]</code> &#x7C7B;&#x578B;&#x662F;&#x5426;&#x5305;&#x542B;&#x503C;&#x3002;&#x4F7F;&#x7528;&#x8BE5;&#x8FC7;&#x7A0B;&#x5C06;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x907F;&#x514D;&#x963B;&#x585E;&#x884C;&#x4E3A;&#x3002;</p>
<p><strong>&#x6CDB; &#x578B;</strong></p>
<p>&#x6CDB;&#x578B;&#x662F;Nim&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x60A8;&#x5C06;&#x5728;<em>&#x7B2C;9&#x7AE0;</em>&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053; <code>FlowVar[T]</code> &#x662F;&#x4E00;&#x79CD;&#x6CDB;&#x578B;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x5B83;&#x5B58;&#x50A8;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5728;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#x6307;&#x5B9A;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C; <code>spawn stdin.readLine()</code>  &#x8868;&#x8FBE;&#x5F0F;&#x8FD4;&#x56DE; <code>FlowVar[string]</code> &#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A; <code>readLine</code> &#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x662F; <code>string</code> &#xFF0C;&#x5E76;&#x4E14;&#x56E0;&#x4E3A; <code>FlowVar</code> &#x5305;&#x88C5;&#x6D3E;&#x751F;&#x8FC7;&#x7A0B;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x3002;</p>
<p>&#x5C06; <code>spawn</code> &#x6D3E;&#x751F;&#x8C03;&#x7528;&#x5E94;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x8FD4;&#x56DE;&#x5B57;&#x7B26;&#x4E32; <code>string</code> &#x7684;&#x8FC7;&#x7A0B;&#x5C06;&#x4EA7;&#x751F; <code>FlowVar[string]</code> &#x503C;&#xFF1A;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> threadpool
<span class="hljs-keyword">proc</span> foo: <span class="hljs-built_in">string</span> = <span class="hljs-string">&quot;Dog&quot;</span>
<span class="hljs-keyword">var</span> x: <span class="hljs-type">FlowVar</span>[<span class="hljs-built_in">string</span>] = spawn foo()
assert(^x == <span class="hljs-string">&quot;Dog&quot;</span>)
</code></pre>
<p>&#x53C2;&#x89C1;<em>&#x56FE;3.15</em>&#xFF0C;&#x4E86;&#x89E3;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x5982;&#x4F55;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;&#x5C06;&#x5176;&#x4E0E;<em>&#x56FE;3.14</em>&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x770B;&#x770B;&#x5728;&#x5F15;&#x5165; <code>spawn</code> &#x4E4B;&#x540E;&#xFF0C; <code>client</code>  &#x7684;&#x6267;&#x884C;&#x662F;&#x5982;&#x4F55;&#x53D8;&#x5316;&#x7684;&#x3002;</p>
<p>&#x56FE;3.11  <code>client.nim</code> &#x7684;&#x5F53;&#x524D;&#x6267;&#x884C;</p>
<p><img src="Images/ch03_input_thread_2.png" alt="ch03 input thread 2"></p>
<p>&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x8F85;&#x52A9; <code>readLine</code> &#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x7ED3;&#x679C;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4E3B;&#x7EBF;&#x7A0B;&#x548C; <code>readLine</code> &#x7EBF;&#x7A0B;&#x90FD;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x4FEE;&#x6539; <code>client.nim</code> &#x4EE5;&#x4F7F;&#x7528; <code>spawn</code>  <em>&#x6E05;&#x5355;3.5</em> &#x4EE5;&#x7C97;&#x4F53;&#x663E;&#x793A;&#x4E86;&#x66F4;&#x6539;&#x884C;&#x7684;&#x5B8C;&#x6574;&#x4EE3;&#x7801;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5173;&#x952E;&#x70B9;&#x662F;&#xFF0C; <code>spawn</code>  &#x8FC7;&#x7A0B;&#x662F;&#x5728; <code>threadpool</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x5FC5;&#x987B;&#x8BB0;&#x4F4F;&#x901A;&#x8FC7; <code>import threadpool</code> &#x5BFC;&#x5165;&#x5B83;&#x3002;</p>
<p>&#x6E05;&#x5355;3.5.&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62; <code>client.nim</code> &#x4E2D;&#x7684;&#x4EE3;&#x7801;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> os, **threadpool**

echo(<span class="hljs-string">&quot;Chat application started&quot;</span>)
<span class="hljs-keyword">if</span> paramCount() == <span class="hljs-number">0</span>:
  quit(<span class="hljs-string">&quot;Please specify the server address, e.g. ./client localhost&quot;</span>)
<span class="hljs-keyword">let</span> serverAddr = paramStr(<span class="hljs-number">1</span>)
echo(<span class="hljs-string">&quot;Connecting to &quot;</span>, serverAddr)
<span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
  <span class="hljs-keyword">let</span> message = **spawn** <span class="hljs-literal">stdin</span>.readLine()
  echo(<span class="hljs-string">&quot;Sending \&quot;&quot;</span>, **^message**, <span class="hljs-string">&quot;\&quot;&quot;</span>)
</code></pre>
<p>&#x7F16;&#x8BD1;&#x73B0;&#x5728;&#x9700;&#x8981; <code>--threads:on</code> &#x6807;&#x5FD7;&#x3002;&#x8981;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C; <code>client.nim</code> &#x6587;&#x4EF6;&#xFF0C;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5728; <code>src/client.nim localhost</code> &#x4E0A;&#x6267;&#x884C; <code>nim c -r --threads:on</code> &#x3002; <code>--threads:on</code> &#x6807;&#x5FD7;&#x662F;&#x6253;&#x5F00;Nim&#x7684;&#x7EBF;&#x7A0B;&#x652F;&#x6301;&#x6240;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B83;&#xFF0C; <code>spawn</code> &#x5C31;&#x65E0;&#x6CD5;&#x8FD0;&#x884C;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A; Nim&#x914D;&#x7F6E;&#x6587;&#x4EF6;
&#x8BF8;&#x5982; <code>--threads:on</code> &#x6807;&#x5FD7;&#x4E4B;&#x7C7B;&#x7684;&#x6807;&#x5FD7;&#x53EF;&#x80FD;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;Nim&#x7F16;&#x8BD1;&#x5668;&#x652F;&#x6301;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x60A8;&#x65E0;&#x9700;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#x91CD;&#x65B0;&#x952E;&#x5165;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#x3002;&#x53EA;&#x9700;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; <code>client.nim.cfg</code> &#x6587;&#x4EF6;&#xFF08;&#x5728; <code>client.nim</code> &#x6587;&#x4EF6;&#x65C1;&#x8FB9;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5176;&#x4E2D;&#x6DFB;&#x52A0; <code>--threads:on</code> &#x3002;&#x6BCF;&#x4E2A;&#x6807;&#x5FD7;&#x90FD;&#x9700;&#x8981;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x60A8;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7528;&#x6362;&#x884C;&#x7B26;&#x5206;&#x9694;&#x5B83;&#x4EEC;&#x6765;&#x6DFB;&#x52A0;&#x989D;&#x5916;&#x7684;&#x6807;&#x5FD7;&#x3002;</p>
</blockquote>
<p> <code>client</code> &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#x4ECD;&#x4E0E;&#x4EE5;&#x524D;&#x76F8;&#x540C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8BFB;&#x53D6;&#x4EE3;&#x7801;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x90E8;&#x5206;&#x6709;&#x7528;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x6DFB;&#x52A0;&#x5141;&#x8BB8;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5F02;&#x6B65;&#x7F51;&#x7EDC;&#x4EE3;&#x7801;&#x3002;&#x670D;&#x52A1;&#x5668;&#x672C;&#x8EAB;&#x4E5F;&#x5C06;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5F02;&#x6B65;I/O&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E00;&#x6B21;&#x4E0E;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x4FE1;&#x3002;</p>
<p>&#x672C;&#x8282;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x4EE5;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x4ECE;&#x7528;&#x6237;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#xFF0C;&#x5373;&#x4F5C;&#x4E3A;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x548C;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#x3002;&#x6211;&#x8FD8;&#x8BA8;&#x8BBA;&#x4E86;&#x6807;&#x51C6;&#x963B;&#x585E;I/O&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x4E86;&#x89E3;&#x51B3;&#x5B83;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x7F16;&#x5199;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x534F;&#x8BAE;&#x3002;</p>
<h2 id="34-&#x5B9E;&#x73B0;&#x534F;&#x8BAE;">3.4 &#x5B9E;&#x73B0;&#x534F;&#x8BAE;</h2>
<p>&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x4FE1;&#x7684;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x7528;&#x4E8E;&#x8BE5;&#x901A;&#x4FE1;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x534F;&#x8BAE;&#x53EF;&#x786E;&#x4FDD;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x76F8;&#x4E92;&#x7406;&#x89E3;&#x3002;&#x5B83;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x4EBA;&#x7C7B;&#x4F7F;&#x7528;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x672C;&#x4E00;&#x81F4;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x88AB;&#x901A;&#x4FE1;&#x53CC;&#x65B9;&#x7406;&#x89E3;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x8BD5;&#x56FE;&#x4E0E;&#x4E00;&#x4E2A;&#x53EA;&#x4F1A;&#x8BF4;&#x4E2D;&#x6587;&#x7684;&#x4EBA;&#x7528;&#x82F1;&#x8BED;&#x4EA4;&#x6D41;&#x3002;&#x4F60;&#x4E0D;&#x4F1A;&#x7406;&#x89E3;&#x4ED6;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x4E0D;&#x4F1A;&#x7406;&#x89E3;&#x4F60;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x7EC4;&#x4EF6;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x624D;&#x80FD;&#x76F8;&#x4E92;&#x7406;&#x89E3;&#x3002;</p>
<p><img src="Images/ch03_human_protocol.png" alt="ch03 human protocol"></p>
<p>&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x8BB0;&#x4F4F;&#xFF0C;&#x5373;&#x4F7F;&#x534F;&#x8BAE;&#x5B9A;&#x4E49;&#x826F;&#x597D;&#xFF0C;&#x4ECD;&#x7136;&#x6709;&#x5F88;&#x5927;&#x7684;&#x9519;&#x8BEF;&#x7A7A;&#x95F4;&#x3002;&#x6D88;&#x606F;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x672A;&#x6B63;&#x786E;&#x4F20;&#x8F93;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x89E3;&#x6790;&#x7ED9;&#x5B9A;&#x6D88;&#x606F;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x683C;&#x5F0F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x6D88;&#x606F;&#x6216;&#x4E0D;&#x5305;&#x542B;&#x6240;&#x9700;&#x6570;&#x636E;&#x7684;&#x6D88;&#x606F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#x3002;&#x6211;&#x5C06;&#x5728;&#x672C;&#x8282;&#x4E2D;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x9A8C;&#x8BC1;&#x5B83;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;&#x4F46;&#x6211;&#x9F13;&#x52B1;&#x60A8;&#x7A0D;&#x540E;&#x82B1;&#x65F6;&#x95F4;&#x6DFB;&#x52A0;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x9A8C;&#x8BC1;&#x6D88;&#x606F;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x5E76;&#x4E3A;&#x4EE3;&#x7801;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x5F02;&#x5E38;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x89E3;&#x6790;&#x548C;&#x751F;&#x6210;&#x6D88;&#x606F;&#x7684;&#x4EE3;&#x7801;&#x6613;&#x4E8E;&#x6D4B;&#x8BD5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x8FD8;&#x5C06;&#x5728;&#x672C;&#x8282;&#x4E2D;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x4E00;&#x4E9B;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x534F;&#x8BAE;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x5B83;&#x5C06;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x95F4;&#x4F20;&#x8F93;&#x7684;&#x4FE1;&#x606F;&#x4EC5;&#x5305;&#x542B;&#x7528;&#x6237;&#x51B3;&#x5B9A;&#x53D1;&#x9001;&#x7ED9;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6D88;&#x606F;&#x548C;&#x7528;&#x6237;&#x540D;&#x3002;</p>
<p>&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x4F46;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;&#x5C06;&#x5176;&#x7F16;&#x7801;&#x4E3A; JSON &#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x64CD;&#x4F5C;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="341-&#x6A21;&#x5757;">3.4.1 &#x6A21;&#x5757;</h2>
<p>&#x60A8;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x8BB8;&#x591A;&#x6A21;&#x5757;&#x793A;&#x4F8B;&#x3002;&#x60A8;&#x7F16;&#x5199;&#x7684; <code>client.nim</code> &#x6587;&#x4EF6;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x8FD8;&#x4F7F;&#x7528; <code>import</code> &#x5173;&#x952E;&#x5B57;&#x5C06; Nim &#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x7684;&#x6A21;&#x5757;&#x5BFC;&#x5165;&#x5230;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x3002;</p>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x786E;&#x5207;&#x5730;&#x89E3;&#x91CA;&#x6A21;&#x5757;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x5982;&#x4ECA;&#xFF0C;&#x8BB8;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x3002;Nim&#x7684;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF1A;&#x6BCF;&#x4E2A;Nim&#x6587;&#x4EF6;&#xFF0C;&#x5373;&#x4EE5;.nim&#x6269;&#x5C55;&#x540D;&#x7ED3;&#x5C3E;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x53EA;&#x8981;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x8BE5;&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x5BFC;&#x5165;&#x8BE5;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6211;&#x5728;&#x672C;&#x4E66;&#x7684;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x5411;&#x4F60;&#x89E3;&#x91CA;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x56E0;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5373;&#x5C06;&#x63A8;&#x51FA;&#x7684;&#x6D88;&#x606F;&#x89E3;&#x6790;&#x5668;&#x5E94;&#x8BE5;&#x5199;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6A21;&#x5757;&#x4E2D;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x6700;&#x597D;&#x7528;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x4F8B;&#x5B50;&#x6765;&#x89E3;&#x91CA;&#x5B83;&#x3002;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x5141;&#x8BB8;&#x60A8;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x5206;&#x79BB;&#x5230;&#x72EC;&#x7ACB;&#x7684;&#x6A21;&#x5757;&#x4E2D;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#x6A21;&#x5757;&#x662F;&#x53EF;&#x4E92;&#x6362;&#x7684;&#x3002;&#x53EA;&#x8981;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x5B83;&#x5B9E;&#x73B0;&#x7684;&#x5E95;&#x5C42;&#x534F;&#x8BAE;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7A0D;&#x540E;&#x60A8;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x4F7F;&#x7528; JSON &#x4EE5;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x5185;&#x5BB9;&#x5BF9;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x6765;&#x5BB9;&#x7EB3;&#x60A8;&#x7684;&#x65B0;&#x6D88;&#x606F;&#x89E3;&#x6790;&#x5668;&#xFF0C;&#x53EA;&#x9700;&#x5728; <code>client</code> &#x6587;&#x4EF6;&#x65C1;&#x8FB9;&#x7684; <code>src</code> &#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>protocol.nim</code> &#x7684;&#x65B0;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x4E4B;&#x540E;&#xFF0C;&#x60A8;&#x7684; <code>src</code> &#x6E90;&#x76EE;&#x5F55;&#x5C06;&#x540C;&#x65F6;&#x5305;&#x542B; <code>client</code>  &#x548C;  <code>protocol</code> &#x6A21;&#x5757;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x5728;&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x53EA;&#x80FD;&#x5728;&#x8BE5;&#x6A21;&#x5757;&#x5185;&#x90E8;&#x8BBF;&#x95EE;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x6A21;&#x5757;&#x5916;&#x90E8;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x79C1;&#x6709;&#x7684;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x60A8;&#x9690;&#x85CF;&#x6A21;&#x5757;&#x7684;&#x67D0;&#x4E9B;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x5E76;&#x7CBE;&#x786E;&#x5730;&#x51B3;&#x5B9A;&#x54EA;&#x4E9B;&#x5E94;&#x8BE5;&#x5411;&#x5BFC;&#x5165;&#x5B83;&#x7684;&#x6A21;&#x5757;&#x516C;&#x5F00;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C; <code>public</code> &#x548C; <code>private</code> &#x5173;&#x952E;&#x5B57;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x5B9A;&#x4E49;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF0C;[12]&#x5728; Nim &#x4E2D;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x6BCF;&#x4E2A;&#x5B9A;&#x4E49;&#x90FD;&#x662F;&#x79C1;&#x6709;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x5176;&#x516C;&#x5F00;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>*</code> &#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x653E; <code>*</code> &#x5728;&#x8FC7;&#x7A0B;&#x540D;&#x79F0;&#x3001;&#x53D8;&#x91CF;&#x540D;&#x79F0;&#x3001;&#x65B9;&#x6CD5;&#x540D;&#x79F0;&#x548C;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x7684;&#x672B;&#x5C3E;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.6.&#x6D88;&#x606F;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x548C;&#x8FC7;&#x7A0B;&#x5B9A;&#x4E49;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Message</span>* = <span class="hljs-keyword">object</span>       <span class="hljs-comment"># &lt;1&gt;</span>
    username*: <span class="hljs-built_in">string</span>     <span class="hljs-comment"># &lt;2&gt;</span>
    message*: <span class="hljs-built_in">string</span>

<span class="hljs-keyword">proc</span> parseMessage*(data: <span class="hljs-built_in">string</span>): <span class="hljs-type">Message</span> =     <span class="hljs-comment"># &lt;3&gt;</span>
  <span class="hljs-keyword">discard</span>     <span class="hljs-comment"># &lt;4&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x6B64;&#x884C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7C7B;&#x578B; <code>Message</code> &#x3002;&#x5BFC;&#x51FA;&#x6807;&#x8BB0; <code>*</code> &#x653E;&#x7F6E;&#x5728;&#x7C7B;&#x578B;&#x540D;&#x79F0;&#x4E4B;&#x540E;&#x3002;</1></p>
<p><2>    &#x4E24;&#x4E2A;&#x5B57;&#x6BB5;&#x5B9A;&#x4E49;&#x9075;&#x5FAA;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#xFF0C;&#x5E76;&#x4EE5;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x5BFC;&#x51FA;&#x3002;</2></p>
<p><3>    &#x6B64;&#x884C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x8FC7;&#x7A0B; <code>parseMessage</code> &#x3002;&#x5BFC;&#x51FA;&#x6807;&#x8BB0;&#x4E5F;&#x7528;&#x4E8E;&#x540D;&#x79F0;&#x540E;&#x4EE5;&#x5BFC;&#x51FA;&#x5B83;&#x3002;</3></p>
<p><4>    &#x8FD9; <code>discard</code> &#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FC7;&#x7A0B;&#x7684;&#x4E3B;&#x4F53;&#x4E0D;&#x80FD;&#x4E3A;&#x7A7A;&#x3002;</4></p>
</blockquote>
<p><em>&#x6E05;&#x5355;3.6</em>&#x663E;&#x793A;&#x4E86; <code>Message</code> &#x7C7B;&#x578B;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5B83;&#x5C06;&#x5B58;&#x50A8;&#x6765;&#x81EA;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6D88;&#x606F;&#x5305;&#x542B;&#x7684;&#x4E24;&#x6761;&#x4FE1;&#x606F;&#xFF0C;&#x5373;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7528;&#x6237;&#x540D;&#x548C;&#x5B9E;&#x9645;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x4F7F;&#x7528; <code>*</code> &#x6807;&#x8BB0;&#x5BFC;&#x51FA;&#x3002;&#x6700;&#x540E;&#x5B9A;&#x4E49;&#x4E86; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x3002;&#x5B83;&#x63A5;&#x6536;&#x5B57;&#x7B26;&#x4E32;&#x7C7B;&#x578B;&#x7684; <code>data</code> &#xFF0C;&#x8FD9;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x7684;&#x539F;&#x59CB;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6216;&#x8005;&#x7531;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x539F;&#x59CB;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x53D6;&#x51B3;&#x4E8E;&#x60A8;&#x5982;&#x4F55;&#x770B;&#x5F85;&#x5B83;&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A; <code>Message</code> &#x7684;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x5DF2;&#x89E3;&#x6790;&#x7684;&#x6D88;&#x606F;&#x3002;&#x8BE5;&#x8FC7;&#x7A0B;&#x4E5F;&#x88AB;&#x5BFC;&#x51FA;&#xFF0C;&#x5B83;&#x4E0E;&#x6D88;&#x606F;&#x7C7B;&#x578B;&#x4E00;&#x8D77;&#x6784;&#x6210;&#x534F;&#x8BAE;&#x6A21;&#x5757;&#x7684;&#x516C;&#x5171;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5C06;<em>&#x6E05;&#x5355;3.6</em>&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x5230;&#x524D;&#x9762;&#x521B;&#x5EFA;&#x7684; <code>protocol</code> &#x6A21;&#x5757;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x786E;&#x4FDD;&#x5B83;&#x4F7F;&#x7528; <code>nim c src/protocol</code> &#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x3002;</p>
<p>&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x5E94;&#x8BE5;&#x5F88;&#x5BB9;&#x6613;&#x638C;&#x63E1;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4F46;&#x8FD9;&#x8DB3;&#x4EE5;&#x8BA9;&#x60A8;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x5757;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x5B9E;&#x73B0; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x3002;</p>
<h2 id="342-&#x89E3;&#x6790;-json">3.4.2 &#x89E3;&#x6790; JSON</h2>
<p>JSON &#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x3002;&#x5B83;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;Nim&#x5728;&#x5176;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x652F;&#x6301;&#x89E3;&#x6790;&#x548C;&#x751F;&#x6210;JSON&#x3002;&#x8FD9;&#x4F7F;&#x5F97; JSON &#x6210;&#x4E3A;&#x5B58;&#x50A8;&#x4E24;&#x4E2A;&#x6D88;&#x606F;&#x5B57;&#x6BB5;&#x7684;&#x5B8C;&#x7F8E;&#x5019;&#x9009;&#x8005;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;JSON&#x7247;&#x6BB5;&#x7531;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#xFF0C;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x662F;&#x7B80;&#x5355;&#x5E26;&#x5F15;&#x53F7;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x503C;&#x53EF;&#x4EE5;&#x662F;&#x6574;&#x6570;&#xFF0C;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6570;&#x7EC4;&#x6216;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x6211;&#x5728;&#x672C;&#x7AE0;&#x5F00;&#x5934;&#x5B9A;&#x4E49;&#x7684;&#x5173;&#x4E8E;&#x300A;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x300B;&#x7684;&#x5BF9;&#x8BDD;&#x3002;&#x6211;&#x5C06;&#x53D1;&#x9001;&#x7684;&#x7B2C;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x5C06;&#x662F;&#x4F60;&#x4EEC;&#x5BF9;&#x6700;&#x65B0;&#x7684;&#x300A;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x300B;&#x5267;&#x96C6;&#x6709;&#x4EC0;&#x4E48;&#x770B;&#x6CD5;&#xFF1F;&#x8FD9;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x4F7F;&#x7528; JSON &#x8868;&#x793A;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.7.JSON &#x4E2D;&#x6D88;&#x606F;&#x7684;&#x8868;&#x793A;&#x5F62;&#x5F0F;</p>
<pre><code class="lang-nim">{     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-string">&quot;username&quot;</span>: <span class="hljs-string">&quot;Dominik&quot;</span>,     <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-string">&quot;message&quot;</span>: <span class="hljs-string">&quot;What did you guys think about the latest Game of Thrones episode?&quot;</span>     <span class="hljs-comment"># &lt;3&gt;</span>
}
</code></pre>
<blockquote>
<p><1>    &#x5927;&#x62EC;&#x53F7;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x3002;</1></p>
<p><2>    &#x5177;&#x6709;&#x76F8;&#x5E94;&#x503C;&#x7684; <code>username</code> &#x5B57;&#x6BB5;&#x3002;</2></p>
<p><3>    &#x5177;&#x6709;&#x76F8;&#x5E94;&#x503C;&#x7684; <code>message</code> &#x5B57;&#x6BB5;&#x3002;</3></p>
</blockquote>
<p>&#x5728;Nim&#x4E2D;&#x89E3;&#x6790;JSON&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x6587;&#x4EF6;&#x9876;&#x90E8;&#x6DFB;&#x52A0; <code>import json</code> &#x6765;&#x5BFC;&#x5165; <code>json</code> &#x6A21;&#x5757;&#x3002;&#x7136;&#x540E;&#x5C06; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x4E2D;&#x7684; <code>discard</code> &#x8BED;&#x53E5;&#x66FF;&#x6362;&#x4E3A; <code>let dataJson = parseJson(data)</code>  <em>&#x6E05;&#x5355;3.8</em>&#x4EE5;&#x7C97;&#x4F53;&#x663E;&#x793A;&#x4E86;&#x6DFB;&#x52A0;&#x5185;&#x5BB9;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x6E05;&#x5355;3.8.&#x89E3;&#x6790; <code>protocol.nim</code> &#x4E2D;&#x7684;JSON</p>
<pre><code class="lang-nim">**<span class="hljs-keyword">import</span> json**
<span class="hljs-keyword">type</span>
  <span class="hljs-type">Message</span>* = <span class="hljs-keyword">object</span>
    username*: <span class="hljs-built_in">string</span>
    message*: <span class="hljs-built_in">string</span>

<span class="hljs-keyword">proc</span> parseMessage*(data: <span class="hljs-built_in">string</span>): <span class="hljs-type">Message</span> =
  **<span class="hljs-keyword">let</span> dataJson = parseJson(data)**
</code></pre>
<p>&#x5728; <code>json</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>parseJson</code> &#x8FC7;&#x7A0B;&#x63A5;&#x53D7;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x8FD4;&#x56DE; <code>JsonNode</code> &#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;</p>
<p> <code>JsonNode</code> &#x7C7B;&#x578B;&#x662F;&#x4E00;&#x79CD;&#x53D8;&#x4F53;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x5B57;&#x6BB5;&#x7531;&#x603B;&#x662F;&#x5728;&#x8BE5;&#x7C7B;&#x578B;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x786E;&#x5B9A;&#x3002;&#x5728; <code>JsonNode</code> &#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; <code>kind</code> &#x5B57;&#x6BB5;&#x51B3;&#x5B9A;&#x4E86;&#x89E3;&#x6790;&#x7684;JSON&#x8282;&#x70B9;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<p><strong>&#x5173;&#x4E8E;&#x53D8;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;</strong></p>
<p>&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x662F;&#x4E00;&#x79CD;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x5B57;&#x6BB5;&#x6839;&#x636E;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x800C;&#x53D8;&#x5316;&#x3002;&#x8BA9;&#x6211;&#x76F4;&#x63A5;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x89E3;&#x91CA;&#x5B83;&#x4EEC;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x6E05;&#x5355;3.9.&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x5BF9;&#x76D2;&#x5B50;&#x5EFA;&#x6A21;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Box</span> = <span class="hljs-keyword">object</span>             <span class="hljs-comment"># &lt;1&gt;</span>
    <span class="hljs-keyword">case</span> empty: <span class="hljs-built_in">bool</span>       <span class="hljs-comment"># &lt;2&gt;</span>
    <span class="hljs-keyword">of</span> <span class="hljs-literal">false</span>:              <span class="hljs-comment"># &lt;3&gt;</span>
      contents: <span class="hljs-built_in">string</span>     <span class="hljs-comment"># &lt;4&gt;</span>
    <span class="hljs-keyword">else</span>:
      <span class="hljs-keyword">discard</span>              <span class="hljs-comment"># &lt;4&gt;</span>

<span class="hljs-keyword">var</span> obj = <span class="hljs-type">Box</span>(empty: <span class="hljs-literal">false</span>, contents: <span class="hljs-string">&quot;Hello&quot;</span>)     <span class="hljs-comment"># &lt;6&gt;</span>
assert obj.contents == <span class="hljs-string">&quot;Hello&quot;</span>                     <span class="hljs-comment"># &lt;7&gt;</span>

<span class="hljs-keyword">var</span> obj2 = <span class="hljs-type">Box</span>(empty: <span class="hljs-literal">true</span>)
echo(obj2.contents)        <span class="hljs-comment"># &lt;8&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x7684;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#x4E0E;&#x666E;&#x901A;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7C7B;&#x4F3C;&#x3002;</1></p>
<p><2> &#x533A;&#x522B;&#x5728;&#x4E8E;&#x5BF9;&#x8C61;&#x5B9A;&#x4E49;&#x4E0B;&#x7684; <code>case</code> &#x8BED;&#x53E5;&#x3002;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x5B9A;&#x4E49;&#x4E86;&#x6B64;&#x7C7B;&#x578B;&#x4E2D;&#x7684;  <code>empty</code> &#x5B57;&#x6BB5;</2></p>
<p><3> &#x5982;&#x679C;  <code>empty</code>  &#x5B57;&#x6BB5;&#x4E3A; <code>false</code> &#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6B64;&#x5206;&#x652F;&#x4E0B;&#x5B9A;&#x4E49;&#x7684;&#x5B57;&#x6BB5;</3></p>
<p><4> &#x5982;&#x679C;   <code>empty == false</code> &#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; <code>contents</code> &#x5B57;&#x6BB5;</4></p>
<p><5> &#x5982;&#x679C;  <code>empty == true</code> &#xFF0C;&#x5219;&#x4E0D;&#x5B9A;&#x4E49;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;</5></p>
<p><6> &#x5F53;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x7684;  <code>empty</code> &#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A; <code>false</code> &#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6307;&#x5B9A; <code>contents</code> &#x5B57;&#x6BB5;</6></p>
<p><7> &#x7531;&#x4E8E;  <code>obj.empty</code>  &#x4E3A; <code>false</code> &#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; <code>contents</code> &#x5B57;&#x6BB5;</7></p>
<p><8> &#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE; <code>contents</code> &#x5B57;&#x6BB5;&#x3002;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;  <code>empty</code> &#x662F; <code>true</code> </8></p>
</blockquote>
<p><em>&#x6E05;&#x5355;3.9</em>&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5BF9;&#x53EF;&#x80FD;&#x4E3A;&#x7A7A;&#x7684;&#x666E;&#x901A;&#x76D2;&#x5B50;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;&#x5728;<em>&#x6E05;&#x5355;3.9</em>&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x6211;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5176;&#x4E2D;&#x8BBF;&#x95EE;&#x4E86;&#x4E00;&#x4E2A;&#x7A7A;&#x76D2;&#x5B50;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x4E5F;&#x5C31;&#x4E0D;&#x8DB3;&#x4E3A;&#x5947;&#x4E86;&#x3002;</p>
<pre><code class="lang-bash">Traceback (most recent call last)
variant.nim(13)          variant
system.nim(2533)         sysFatal
Error: unhandled exception: contents is not accessible [FieldError]
</code></pre>
<p>&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x53D8;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x72B6;&#x6001;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#x7684; <code>case</code> &#x8BED;&#x53E5;&#x4E2D;&#x4F7F;&#x7528;&#x679A;&#x4E3E;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#xFF0C;&#x7528;&#x4E8E; <code>JsonNode</code> &#x7C7B;&#x578B;&#x3002;</p>
<p>&#x6709;7&#x79CD;&#x4E0D;&#x540C;&#x7684; <code>JsonNodeKind</code> &#x3002; <code>JsonNodeKind</code> &#x7C7B;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x679A;&#x4E3E;&#xFF0C;&#x6BCF;&#x79CD;JSON&#x503C;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x503C;<em>&#x6E05;&#x5355;3.10</em>&#x63D0;&#x4F9B;&#x4E86;&#x6240;&#x6709;7&#x4E2A;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x6620;&#x5C04;&#x5230;&#x7684; <code>JsonNodeKind</code> &#x7684;&#x5217;&#x8868;&#x3002;</p>
<p>&#x6E05;&#x5355;3.10.JSON&#x503C;&#x4E0E; <code>JsonNodeKind</code> &#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x6620;&#x5C04;</p>
<pre><code class="lang-nim">assert parseJson(<span class="hljs-string">&quot;null&quot;</span>).kind == <span class="hljs-type">JNull</span>
assert parseJson(<span class="hljs-string">&quot;true&quot;</span>).kind == <span class="hljs-type">JBool</span>
assert parseJson(<span class="hljs-string">&quot;42&quot;</span>).kind == <span class="hljs-type">JInt</span>
assert parseJson(<span class="hljs-string">&quot;3.14&quot;</span>).kind == <span class="hljs-type">JFloat</span>
assert parseJson(<span class="hljs-string">&quot;\&quot;Hi\&quot;&quot;</span>).kind == <span class="hljs-type">JString</span>
assert parseJson(<span class="hljs-string">&quot;&quot;&quot;{ &quot;key&quot;: &quot;value&quot; }&quot;&quot;&quot;</span>).kind == <span class="hljs-type">JObject</span>
assert parseJson(<span class="hljs-string">&quot;[1, 2, 3, 4]&quot;</span>).kind == <span class="hljs-type">JArray</span>
</code></pre>
<p>&#x5F53;&#x89E3;&#x6790;&#x4EFB;&#x610F;JSON&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x5668;&#x65E0;&#x6CD5;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x77E5;&#x9053;&#x751F;&#x6210;&#x7684;JSON&#x7C7B;&#x578B;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x53EA;&#x6709;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x77E5;&#x9053;&#x3002;&#x8FD9;&#x5C31;&#x662F; <code>parseJson</code> &#x8FC7;&#x7A0B;&#x8FD4;&#x56DE; <code>JsonNode</code> &#x7C7B;&#x578B;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x5185;&#x5BB9;&#x56E0;&#x4F20;&#x9012;&#x5230; <code>parseJson</code> &#x8FC7;&#x7A0B;&#x7684;JSON&#x503C;&#x7684;&#x7C7B;&#x578B;&#x800C;&#x5F02;&#x3002;</p>
<p><em>&#x6E05;&#x5355;3.10</em>&#x4E2D;&#x663E;&#x793A;&#x7684;&#x6700;&#x540E;&#x4E24;&#x4E2A;JSON&#x503C;&#x662F;&#x96C6;&#x5408;&#x3002; <code>JObject</code> &#x7C7B;&#x578B;&#x8868;&#x793A; <code>string</code> &#x548C; <code>JsonNode</code> &#x4E4B;&#x95F4;&#x7684;&#x6620;&#x5C04;&#x3002; <code>JArray</code> &#x7C7B;&#x5B58;&#x50A8; <code>JsonNode</code> &#x7684;&#x5217;&#x8868;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>[]</code>&#x8FD0;&#x7B97;&#x7B26;&#x8BBF;&#x95EE;<code>JObject</code>&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x5B83;&#x7C7B;&#x4F3C;&#x4E8E;&#x6570;&#x7EC4;&#x548C;&#x5E8F;&#x5217;<code>[]</code>&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4F46;&#x91C7;&#x7528;<code>string</code>&#x4F5C;&#x4E3A;&#x5176;&#x53C2;&#x6570;&#x3002;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x786E;&#x5B9A;&#x8981;&#x4ECE;<code>JObject</code>&#x4E2D;&#x68C0;&#x7D22;&#x503C;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;<code>[]</code>&#x8FD0;&#x7B97;&#x7B26;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>JsonNode</code>&#x503C;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> json
<span class="hljs-keyword">let</span> data = <span class="hljs-string">&quot;&quot;&quot;
  {&quot;username&quot;: &quot;Dominik&quot;}
&quot;&quot;&quot;</span>

<span class="hljs-keyword">let</span> obj = parseJson(data)      <span class="hljs-comment"># &lt;1&gt;</span>
assert obj.kind == <span class="hljs-type">JObject</span>     <span class="hljs-comment"># &lt;2&gt;</span>
assert obj[<span class="hljs-string">&quot;username&quot;</span>].kind == <span class="hljs-type">JString</span>      <span class="hljs-comment"># &lt;3&gt;</span>
assert obj[<span class="hljs-string">&quot;username&quot;</span>].str == <span class="hljs-string">&quot;Dominik&quot;</span>     <span class="hljs-comment"># &lt;4&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x53EA;&#x9700;&#x89E3;&#x6790;&#x5B57;&#x7B26;&#x4E32; <code>data</code> &#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; <code>JsonNode</code> &#x7C7B;&#x578B;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x5206;&#x914D;&#x7ED9; <code>obj</code> &#x53D8;&#x91CF;&#x3002;</1></p>
<p><2>    &#x8FD4;&#x56DE;&#x7684; <code>JsonNode</code> &#x5177;&#x6709;&#x4E00;&#x79CD; <code>JObject</code> &#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x5305;&#x542B;&#x5728; <code>data</code> &#x4E2D;&#x7684;JSON&#x7C7B;&#x578B;&#x3002;</2></p>
<p><3>    &#x4F7F;&#x7528; <code>[]</code> &#x8FD0;&#x7B97;&#x7B26;&#x8BBF;&#x95EE;&#x5B57;&#x6BB5;&#x3002;&#x5B83;&#x8FD4;&#x56DE;&#x53E6;&#x4E00;&#x4E2A; <code>JsonNode</code> &#xFF0C; <code>kind</code> &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x662F;&#x4E00;&#x4E2A; <code>JString</code> &#x3002;</3></p>
<p><4>    &#x56E0;&#x4E3A; <code>[]</code> &#x8FD0;&#x7B97;&#x7B26;&#x8FD4;&#x56DE; <code>JsonNode</code> &#xFF0C;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5305;&#x542B;&#x5B83;&#x7684;&#x5B57;&#x6BB5;&#x663E;&#x5F0F;&#x8BBF;&#x95EE;&#x5B83;&#x6240;&#x5305;&#x542B;&#x7684;&#x503C;&#x3002;&#x5728; <code>JString</code> &#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x662F; <code>str</code> &#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x597D;&#x4F7F;&#x7528; <code>getStr</code> &#x8FC7;&#x7A0B;&#x3002;</4></p>
<p>[&#x6CE8;&#x610F;]  <code>kind</code> &#x5F88;&#x91CD;&#x8981;
&#x5728; <code>JsonNode</code> &#x7684; <code>kind</code> &#x5B57;&#x6BB5;&#x4E0D;&#x662F; <code>JObject</code> &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E0A;&#x8C03;&#x7528; <code>[]</code> &#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x5BFC;&#x81F4;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x3002;</p>
</blockquote>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x4ECE;&#x89E3;&#x6790;&#x7684;<code>JsonNode</code>&#x4E2D;&#x68C0;&#x7D22;<code>username</code>&#x5B57;&#x6BB5;&#xFF1F;&#x4F7F;&#x7528;<code>dataJson[&quot;username&quot;]</code>&#x5C06;&#x8FD4;&#x56DE;&#x53E6;&#x4E00;&#x4E2A;<code>JsonNode</code>&#x3002;&#x9664;&#x975E;&#x5DF2;&#x89E3;&#x6790;&#x7684;<code>JObject</code>&#x4E2D;&#x4E0D;&#x5B58;&#x5728;<code>username</code>&#x5B57;&#x6BB5;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x5F15;&#x53D1;<code>KeyError</code>&#x5F02;&#x5E38;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x5217;&#x8868;&#x4E2D;&#xFF0C;<code>dataJson[&quot;username&quot;]</code>&#x5C06;&#x8FD4;&#x56DE;&#x7684;<code>JsonNode</code>&#x7C7B;&#x578B;&#x5C06;&#x662F;<code>JString</code>&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x5B57;&#x6BB5;&#x5305;&#x542B;&#x4E00;&#x4E2A;<code>string</code>&#x503C;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>getStr</code>&#x8FC7;&#x7A0B;&#x68C0;&#x7D22;<code>string</code>&#x503C;&#x3002;&#x6BCF;&#x4E2A;<code>JsonNode</code>&#x7C7B;&#x578B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;<code>get</code>&#x8FC7;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x4E0E;<code>JsonNode</code>&#x7C7B;&#x578B;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;<code>get</code>&#x7A0B;&#x5E8F;&#x5C06;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A;  <code>get</code> &#x9ED8;&#x8BA4;&#x503C;|
&#x53EF;&#x4EE5;&#x91CD;&#x5199; <code>get</code> &#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x3002;&#x8981;&#x91CD;&#x5199;&#xFF0C;&#x8BF7;&#x4F20;&#x9012;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x8981;&#x4F5C;&#x4E3A;&#x8FC7;&#x7A0B;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#xFF0C;&#x4F8B;&#x5982; <code>node.getStr(&quot;Bad kind&quot;)</code> &#x3002;</p>
</blockquote>
<p>&#x73B0;&#x5728;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x6B64;&#x7528;&#x6237;&#x540D;&#x5206;&#x914D;&#x7ED9; <code>Message</code> &#x7C7B;&#x578B;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#x3002;&#x8BF7;&#x53C2;&#x89C1;&#x4EE3;&#x7801;<em>&#x6E05;&#x5355;3.11</em>&#xFF0C;&#x5B83;&#x663E;&#x793A;&#x4E86;&#x5B8C;&#x6574;&#x7684; <code>protocol</code> &#x6A21;&#x5757;&#xFF0C;&#x6DFB;&#x52A0;&#x7684;&#x65B0;&#x5206;&#x914D;&#x4EE5;&#x7C97;&#x4F53;&#x663E;&#x793A;&#x3002;</p>
<p>&#x6E05;&#x5355;3.11&#x5C06;&#x89E3;&#x6790;&#x7684;&#x6570;&#x636E;&#x5206;&#x914D;&#x7ED9;&#x7ED3;&#x679C;&#x53D8;&#x91CF;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> json
<span class="hljs-keyword">type</span>
  <span class="hljs-type">Message</span>* = <span class="hljs-keyword">object</span>
    username*: <span class="hljs-built_in">string</span>
    message*: <span class="hljs-built_in">string</span>

<span class="hljs-keyword">proc</span> parseMessage*(data: <span class="hljs-built_in">string</span>): <span class="hljs-type">Message</span> =
  <span class="hljs-keyword">let</span> dataJson = parseJson(data)
  **<span class="hljs-literal">result</span>.username = dataJson[<span class="hljs-string">&quot;username&quot;</span>].getStr()**     <span class="hljs-comment"># &lt;1&gt;</span>
  **<span class="hljs-literal">result</span>.message = dataJson[<span class="hljs-string">&quot;message&quot;</span>].getStr()**       <span class="hljs-comment"># &lt;2&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x83B7;&#x53D6;&quot;username&quot;&#x952E;&#x4E0B;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x5206;&#x914D;&#x7ED9;&#x7ED3;&#x679C; <code>Message</code> &#x7684; <code>username</code> &#x5B57;&#x6BB5;&#x3002;</1></p>
<p><2>    &#x5728;&#x6B64;&#x5904;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x6539;&#x4E3A;&#x83B7;&#x53D6;&quot;message&quot;&#x952E;&#x4E0B;&#x7684;&#x503C;&#x3002;</2></p>
</blockquote>
<p>&#x53EA;&#x9700;&#x7B80;&#x5355;&#x5730;&#x6DFB;&#x52A0;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x5373;&#x53EF;&#x5B8C;&#x6210;&#x3002;</p>
<p><strong>&#x795E;&#x5947;&#x7684;&#x53D8;&#x91CF; <code>result</code>  `</strong>` </p>
<p>&#x60A8;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053; 3.11 &#x4E2D;&#x7684; <code>result</code> &#x53D8;&#x91CF;&#x6765;&#x81EA;&#x54EA;&#x91CC;&#x3002;&#x7B54;&#x6848;&#x662F;&#xFF0C;Nim&#x9690;&#x5F0F;&#x5730;&#x4E3A;&#x4F60;&#x5B9A;&#x4E49;&#x4E86;&#x5B83;&#x3002;&#x6B64;&#xB7;&#x53D8;&#x91CF;&#x5728;&#x4F7F;&#x7528;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B9A;&#x4E49;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> count10(): <span class="hljs-built_in">int</span> =
  <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> <span class="hljs-number">0</span> .. <span class="hljs-number">10</span>:
    <span class="hljs-literal">result</span>.inc
assert count10() == <span class="hljs-number">10</span>
</code></pre>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x590D;&#x5B9A;&#x4E49; <code>result</code> &#x53D8;&#x91CF;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x5B83;&#x3002; <code>result</code> &#x53D8;&#x91CF;&#x5C06;&#x81EA;&#x52A8;&#x4E3A;&#x60A8;&#x8FD4;&#x56DE;&#x3002;&#x56DE;&#x987E;&#x7B2C;2&#x7AE0;&#x4E2D;&#x7684;&#x8FC7;&#x7A0B;&#x5B9A;&#x4E49;&#x4E00;&#x8282;&#xFF0C;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x60A8;&#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x901F;&#x548C;&#x9891;&#x7E41;&#x5730;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x3002;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F00;&#x59CB;&#x5C06;&#x65B0;&#x6A21;&#x5757;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x6A21;&#x5757;&#x96C6;&#x6210;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x6700;&#x597D;&#x5C06;&#x4EE3;&#x7801;&#x4F5C;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x5355;&#x5143;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x534F;&#x8BAE;&#x6A21;&#x5757;&#x662F;&#x9694;&#x79BB;&#x6D4B;&#x8BD5;&#x7684;&#x826F;&#x597D;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x3002;&#x6D4B;&#x8BD5;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x6D4B;&#x8BD5;&#x6BCF;&#x4E2A;&#x5BFC;&#x51FA;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x6309;&#x9884;&#x671F;&#x5DE5;&#x4F5C;&#x3002;&#x534F;&#x8BAE;&#x6A21;&#x5757;&#x5F53;&#x524D;&#x53EA;&#x5BFC;&#x51FA;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5373; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x4E3A;&#x5176;&#x7F16;&#x5199;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x5728;Nim&#x4E2D;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x6709;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528; <code>doAssert</code> &#x8FC7;&#x7A0B;&#x3002; <code>doAssert</code> &#x8FC7;&#x7A0B;&#x5728; <code>system</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x3002;&#x5B83;&#x7C7B;&#x4F3C;&#x4E8E; <code>assert</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x4E00;&#x4E2A; <code>boolean</code> &#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x8BE5; <code>boolean</code> &#x7684;&#x503C;&#x4E3A; <code>false</code> &#xFF0C;&#x5219;&#x5F15;&#x53D1; <code>AssertionFailed</code> &#x5F02;&#x5E38;&#x3002;&#x5B83;&#x4E0E; <code>assert</code> &#x6709;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x5373;&#x5728;&#x53D1;&#x5E03;&#x6A21;&#x5F0F;&#x4E0B;&#x7F16;&#x8BD1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF08;&#x901A;&#x8FC7; <code>-d:release</code> &#x6807;&#x5FD7;&#xFF09;&#xFF0C; <code>assert</code> &#x8BED;&#x53E5;&#x4F1A;&#x88AB;&#x4F18;&#x5316;&#x53BB;&#x6389;&#xFF0C;&#x800C; <code>doAssert</code> &#x8BED;&#x53E5;&#x5219;&#x4E0D;&#x4F1A;&#x3002;</p>
<blockquote>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x53D1;&#x5E03;&#x6A21;&#x5F0F;
&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Nim &#x7F16;&#x8BD1;&#x5668;&#x5728;Debug&#x8C03;&#x8BD5;&#x6A21;&#x5F0F;&#x4E0B;&#x7F16;&#x8BD1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x8C03;&#x8BD5;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x7A0D;&#x6162;&#xFF0C;&#x4F46;&#x4F1A;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x68C0;&#x67E5;&#xFF0C;&#x8FD9;&#x4E9B;&#x68C0;&#x67E5;&#x4F1A;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x53EF;&#x80FD;&#x610F;&#x5916;&#x5F15;&#x5165;&#x7A0B;&#x5E8F;&#x7684;&#x67D0;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x6027;&#x80FD;&#xFF0C;&#x5E94;&#x4F7F;&#x7528; <code>-d:release</code> &#x5C06;&#x5176;&#x7F6E;&#x4E8E;&#x53D1;&#x5E03;&#x6A21;&#x5F0F;&#x7684;&#x6807;&#x5FD7;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x3002;</p>
</blockquote>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x7528; <code>doAssert</code> &#x6D4B;&#x8BD5; <code>parseMessage</code> &#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.12.&#x6D4B;&#x8BD5;&#x65B0;&#x529F;&#x80FD;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">when</span> isMainModule:     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">block</span>:               <span class="hljs-comment"># &lt;2&gt;</span>
    <span class="hljs-keyword">let</span> data = <span class="hljs-string">&quot;&quot;&quot;{&quot;username&quot;: &quot;John&quot;, &quot;message&quot;: &quot;Hi!&quot;}&quot;&quot;&quot;</span>     <span class="hljs-comment"># &lt;3&gt;</span>
    <span class="hljs-keyword">let</span> parsed = parseMessage(data)        <span class="hljs-comment"># &lt;4&gt;</span>
    doAssert parsed.username == <span class="hljs-string">&quot;John&quot;</span>     <span class="hljs-comment"># &lt;4&gt;</span>
    doAssert parsed.message == <span class="hljs-string">&quot;Hi!&quot;</span>       <span class="hljs-comment"># &lt;6&gt;</span>
</code></pre>
<blockquote>
<p><1>  <code>when</code> &#x8BED;&#x53E5;&#x662F;&#x4E00;&#x4E2A;&#x7F16;&#x8BD1;&#x65F6;&#x7684; <code>if</code> &#x8BED;&#x53E5;&#xFF0C;&#x5B83;&#x4EC5;&#x5728;&#x5176;&#x6761;&#x4EF6;&#x4E3A; <code>true</code> &#x65F6;&#x5305;&#x542B;&#x5176;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5F53;&#x5C1A;&#x672A;&#x5BFC;&#x5165;&#x5F53;&#x524D;&#x6A21;&#x5757;&#x65F6;&#xFF0C; <code>isMainModule</code> &#x5E38;&#x91CF;&#x4E3A; <code>true</code> &#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x5BFC;&#x5165;&#x6B64;&#x6A21;&#x5757;&#xFF0C;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x5C06;&#x88AB;&#x9690;&#x85CF;&#x3002;</1></p>
<p><2>    &#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x7528;&#x4E8E;&#x9694;&#x79BB;&#x6D4B;&#x8BD5;&#x3002;</2></p>
<p><3>    &#x8FD9;&#x91CC;&#x6211;&#x4F7F;&#x7528;&#x4E09;&#x5F15;&#x53F7;&#x5B57;&#x7B26;&#x4E32;&#x6587;&#x5B57;&#x8BED;&#x6CD5;&#x6765;&#x5B9A;&#x4E49;&#x8981;&#x89E3;&#x6790;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E09;&#x5F15;&#x53F7;&#x5B57;&#x7B26;&#x4E32;&#x6587;&#x5B57;&#x610F;&#x5473;&#x7740; JSON &#x4E2D;&#x7684;&#x5355;&#x5F15;&#x53F7;&#x4E0D;&#x9700;&#x8981;&#x8F6C;&#x4E49;&#x3002;</3></p>
<p><4>    &#x5BF9;&#x4E0A;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x6570;&#x636E;&#x8C03;&#x7528; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x3002;</4></p>
<p><5>    &#x68C0;&#x67E5; <code>parseMessage</code> &#x89E3;&#x6790;&#x7684;&#x7528;&#x6237;&#x540D;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</5></p>
<p><6>    &#x68C0;&#x67E5; <code>parseMessage</code> &#x89E3;&#x6790;&#x7684;&#x6D88;&#x606F;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</6></p>
</blockquote>
<p>&#x5C06;&#x6E05;&#x5355; 3.12 &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x5230;&#x6587;&#x4EF6;&#x5E95;&#x90E8;&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x7A0B;&#x5E8F;&#x5E94;&#x6210;&#x529F;&#x6267;&#x884C;&#xFF0C;&#x6CA1;&#x6709;&#x8F93;&#x51FA;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x81F3;&#x5C11;&#x6536;&#x5230;&#x67D0;&#x79CD;&#x6D88;&#x606F;&#x8BA9;&#x60A8;&#x77E5;&#x9053;&#x6D4B;&#x8BD5;&#x6210;&#x529F;&#x4F1A;&#x5F88;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x9700;&#x6DFB;&#x52A0; <code>echo(&quot;All tests passed!&quot;)</code> &#x5230;&#x6587;&#x4EF6;&#x5E95;&#x90E8;&#x5373;&#x53EF;&#x3002;&#x53EA;&#x8981;&#x6240;&#x6709;&#x6D4B;&#x8BD5;&#x90FD;&#x901A;&#x8FC7;&#xFF0C;&#x60A8;&#x7684;&#x7A0B;&#x5E8F;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x8F93;&#x51FA;&#x8BE5;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x5C1D;&#x8BD5;&#x66F4;&#x6539;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x65AD;&#x8A00;&#x4EE5;&#x68C0;&#x67E5;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x51FA;&#x5E76;&#x89C2;&#x5BDF;&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4ECE;&#x8BED;&#x53E5;doAssert parsed.message == &quot;Hi!&quot;&#x4E2D;&#x5220;&#x9664;&#x611F;&#x53F9;&#x53F7;&#x5C06;&#x5BFC;&#x81F4;&#x4EE5;&#x4E0B;&#x9519;&#x8BEF;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-type">Traceback</span> (most recent call last)
protocol.nim(<span class="hljs-number">17</span>) protocol
system.nim(<span class="hljs-number">3335</span>) raiseAssert
system.nim(<span class="hljs-number">2531</span>) sysFatal
<span class="hljs-type">Error</span>: unhandled exception: parsed.message == <span class="hljs-string">&quot;Hi&quot;</span>  [<span class="hljs-type">AssertionError</span>]
</code></pre>
<p>&#x5982;&#x679C;&#x4F60;&#x4FEE;&#x6539;&#x534F;&#x8BAE;&#x6A21;&#x5757;&#x5E76;&#x7834;&#x574F;&#x4F60;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x7A81;&#x7136;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x60A8;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x8F93;&#x5165;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x8F93;&#x5165;&#x5462;&#xFF1F;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x4EE5;&#x67E5;&#x770B;&#x8F93;&#x5165;&#x4E0D;&#x6B63;&#x786E;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">block</span>:
  <span class="hljs-keyword">let</span> data = <span class="hljs-string">&quot;&quot;&quot;foobar&quot;&quot;&quot;</span>
  <span class="hljs-keyword">let</span> parsed = parseMessage(data)
</code></pre>
<p>&#x73B0;&#x5728;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C; <code>protocol.nim</code> &#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5F97;&#x5230;&#x4EE5;&#x4E0B;&#x8F93;&#x51FA;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-type">Traceback</span> (most recent call last)
protocol.nim(<span class="hljs-number">21</span>) protocol_progress
protocol.nim(<span class="hljs-number">8</span>)  parseMessage
json.nim(<span class="hljs-number">1086</span>)   parseJson
json.nim(<span class="hljs-number">1082</span>)   parseJson
json.nim(<span class="hljs-number">1072</span>)   parseJson
json.nim(<span class="hljs-number">561</span>)    raiseParseErr
<span class="hljs-type">Error</span>: unhandled exception: input(<span class="hljs-number">1</span>, <span class="hljs-number">5</span>) <span class="hljs-type">Error</span>: { expected [<span class="hljs-type">JsonParsingError</span>]
</code></pre>
<p>&#x7531;&#x4E8E;&#x6307;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x662F;&#x6709;&#x6548;&#x7684; JSON&#xFF0C;&#x56E0;&#x6B64;&#x5F15;&#x53D1;&#x4E86;&#x5F02;&#x5E38;&#x3002;&#x4F46;&#x8FD9;&#x662F;&#x5E94;&#x8BE5;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6D4B;&#x8BD5;&#x4E2D;&#x901A;&#x8FC7;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#x5E76;&#x786E;&#x4FDD; <code>parseJson</code> &#x5DF2;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x6765;&#x5B9A;&#x4E49;&#x5B83;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">block</span>:
  <span class="hljs-keyword">let</span> data = <span class="hljs-string">&quot;&quot;&quot;foobar&quot;&quot;&quot;</span>
  <span class="hljs-keyword">try</span>:
    <span class="hljs-keyword">let</span> parsed = parseMessage(data)
    doAssert <span class="hljs-literal">false</span>     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">except</span> <span class="hljs-type">JsonParsingError</span>:     <span class="hljs-comment"># &lt;2&gt;</span>
    doAssert <span class="hljs-literal">true</span>
  <span class="hljs-keyword">except</span>:
    doAssert <span class="hljs-literal">false</span>
</code></pre>
<blockquote>
<p><1>    &#x6B64;&#x884C;&#x6C38;&#x8FDC;&#x4E0D;&#x5E94;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x4E3A; <code>parseMessage</code> &#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x3002;</1></p>
<p><2>    &#x786E;&#x4FDD;&#x5F15;&#x53D1;&#x7684;&#x5F02;&#x5E38;&#x662F;&#x9884;&#x671F;&#x7684;&#x5F02;&#x5E38;&#x3002;</2></p>
</blockquote>
<p> <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x62A5;&#x544A;&#x9519;&#x8BEF;&#x7684;&#x7406;&#x60F3;&#x65B9;&#x6CD5;&#x662F;&#x5F15;&#x53D1;&#x81EA;&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#x3002;&#x4F46;&#x8FD9;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x7AE0;&#x7684;&#x8303;&#x56F4;&#x3002;&#x6211;&#x9F13;&#x52B1;&#x60A8;&#x5728;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#x4E4B;&#x540E;&#x518D;&#x56DE;&#x6765;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x751F;&#x6210;JSON&#x3002;</p>
<h2 id="343-&#x751F;&#x6210;-json">3.4.3 &#x751F;&#x6210; JSON</h2>
<p>&#x60A8;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x89E3;&#x6790;&#x4E86;JSON&#xFF0C;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x751F;&#x6210;JSON&#x3002;&#x534F;&#x8BAE;&#x6A21;&#x5757;&#x9700;&#x8981;&#x80FD;&#x591F;&#x89E3;&#x6790;&#x548C;&#x751F;&#x6210;&#x6D88;&#x606F;&#x3002;&#x503C;&#x5F97;&#x5E86;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x751F;&#x6210;JSON&#x751A;&#x81F3;&#x6BD4;&#x89E3;&#x6790;&#x5B83;&#x66F4;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x5728;Nim&#x4E2D;&#xFF0C;JSON&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x751F;&#x6210;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x7B80;&#x5355;&#x5730;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E0E;&#x503C;&#x8FDE;&#x63A5;&#x7684;&#x6B63;&#x786E;JSON&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x6D4B;&#x8BD5;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#x3002;&#x8FD9;&#x4F1A;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x5BB9;&#x6613;&#x6F0F;&#x6389;JSON&#x7684;&#x67D0;&#x4E9B;&#x8BED;&#x6CD5;&#x5143;&#x7D20;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x6784;&#x9020;&#x65B0;&#x7684; <code>JsonNode</code> &#xFF0C;&#x5E76;&#x4F7F;&#x7528;  <code>$</code>  &#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C31;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x65B0;&#x7684; <code>createMessage</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;  %  &#x8FD0;&#x7B97;&#x7B26;&#x521B;&#x5EFA;&#x65B0;&#x7684; <code>JsonNode</code> &#x5BF9;&#x8C61; <em>&#x6E05;&#x5355;3.13</em> &#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5B9A;&#x4E49; <code>createMessage</code> &#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.13.&#x521B;&#x5EFA;&#x65B0;&#x6D88;&#x606F;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> createMessage*(username, message: <span class="hljs-built_in">string</span>): <span class="hljs-built_in">string</span> =
  <span class="hljs-literal">result</span> = $(%{     <span class="hljs-comment"># &lt;1&gt;</span>
    <span class="hljs-string">&quot;username&quot;</span>: %username,     <span class="hljs-comment"># &lt;2&gt;</span>
    <span class="hljs-string">&quot;message&quot;</span>: %message
  }) &amp; <span class="hljs-string">&quot;\c\l&quot;</span>     <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1>     <code>$</code>  &#x5C06; <code>%</code> &#x8FD0;&#x7B97;&#x7B26;&#x8FD4;&#x56DE;&#x7684; <code>JsonNode</code> &#x8F6C;&#x6362;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;</1></p>
<p><2>  <code>%</code> &#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6574;&#x6570;&#x3001;&#x6D6E;&#x70B9;&#x7B49;&#x8F6C;&#x6362;&#x4E3A;&#x9002;&#x5F53;&#x7684; <code>JsonNode</code> &#x3002;</2></p>
<p><3>    &#x56DE;&#x8F66;&#x7B26;&#x548C;&#x6362;&#x884C;&#x7B26;&#x5C06;&#x6DFB;&#x52A0;&#x5230;&#x6D88;&#x606F;&#x672B;&#x5C3E;&#x3002;&#x5B83;&#x4EEC;&#x5145;&#x5F53;&#x6D88;&#x606F;&#x7684;&#x5206;&#x9694;&#x7B26;&#x3002;</3></p>
<p>&#x6CE8;&#x610F; &#x8868;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8BED;&#x6CD5;
&#x60A8;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6E05;&#x5355;&#x4E2D;&#x770B;&#x5230;&#x7684;{:}&#x8BED;&#x6CD5;&#x79F0;&#x4E3A;&#x8868;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x5B83;&#x53EA;&#x662F;&#x6570;&#x7EC4;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x8BED;&#x6CD5;&#x7CD6;&#xFF0C;&#x5373; {&quot;key1&quot;: &quot;value1&quot;, &quot;key2&quot;: &quot;value2&quot;}&#x4E0E;[(&quot;key1&quot;, &quot;value1&quot;), (&quot;key2, &quot;value2&quot;)]&#x76F8;&#x540C;&#x3002;</p>
</blockquote>
<p> <code>%</code> &#x8FD0;&#x7B97;&#x7B26;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x8F6C;&#x6362;&#x4E3A;&#x9002;&#x5F53;&#x7684; <code>JsonNode</code> &#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x975E;&#x5E38;&#x76F4;&#x89C2;&#x7684;&#x8BED;&#x6CD5;&#x521B;&#x5EFA;JSON&#x3002;</p>
<p>&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C; <code>$</code> &#x662F;&#x7528;&#x4E8E;&#x5C06;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x4E3A; <code>string</code> &#x503C;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x3002;&#x5728; <code>JsonNode</code> &#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E3A;&#x5176;&#x5B9A;&#x4E49;&#x7684; <code>$</code> &#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x751F;&#x6210;&#x751F;&#x6210;&#x7684; <code>JsonNode</code> &#x5BF9;&#x8C61;&#x7684;&#x6709;&#x6548;JSON&#x5B57;&#x7B26;&#x4E32;&#x6587;&#x5B57;&#x8868;&#x793A;&#x3002;</p>
<p>&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7EC4;&#x4EF6;&#x9700;&#x8981;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x6DFB;&#x52A0;&#x56DE;&#x8F66;&#x7B26;&#x548C;&#x6362;&#x884C;&#x7B26;&#xFF08;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x6362;&#x884C;&#x7B26;&#x8868;&#x793A;&#x6362;&#x884C;&#x7B26;&#xFF09;&#x5C06;&#x5F88;&#x6709;&#x7528;&#x3002;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x786E;&#x5B9A;&#x4E00;&#x6761;&#x65B0;&#x6D88;&#x606F;&#x4F55;&#x65F6;&#x505C;&#x6B62;&#xFF0C;&#x53E6;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x4F55;&#x65F6;&#x5F00;&#x59CB;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x5C06;&#x662F;&#x6D88;&#x606F;&#x5206;&#x9694;&#x7B26;&#x3002;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x4F46;\c\l&#x5E8F;&#x5217;&#x5DF2;&#x5728;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x534F;&#x8BAE;&#x4E2D;&#x666E;&#x904D;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x7531;Nim&#x7684;&#x7F51;&#x7EDC;&#x6A21;&#x5757;&#x652F;&#x6301;&#x3002;</p>
<p>&#x4E0E; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x4E5F;&#x5E94;&#x8BE5;&#x4E3A; <code>createMessage</code> &#x8FC7;&#x7A0B;&#x6DFB;&#x52A0;&#x6D4B;&#x8BD5;&#x3002;&#x53EA;&#x9700;&#x518D;&#x6B21;&#x4F7F;&#x7528; <code>doAssert</code> &#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8F93;&#x51FA;&#x7B26;&#x5408;&#x9884;&#x671F;&#x3002;&#x8BB0;&#x4F4F;&#x5728;&#x9884;&#x671F;&#x8F93;&#x51FA;&#x4E2D;&#x5305;&#x542B;\c\l&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230; <code>protocol.nim</code> &#x7684;&#x5E95;&#x90E8;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">block</span>:
  <span class="hljs-keyword">let</span> expected = <span class="hljs-string">&quot;&quot;&quot;{&quot;username&quot;:&quot;dom&quot;,&quot;message&quot;:&quot;hello&quot;}&quot;&quot;&quot;</span> &amp; <span class="hljs-string">&quot;\c\l&quot;</span>     <span class="hljs-comment"># &lt;1&gt;</span>
  doAssert createMessage(<span class="hljs-string">&quot;dom&quot;</span>, <span class="hljs-string">&quot;hello&quot;</span>) == expected
</code></pre>
<blockquote>
<p><1>    &#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x4EF6;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x4E09;&#x5F15;&#x53F7;&#x5B57;&#x7B26;&#x4E32;&#x6587;&#x5B57;&#x6839;&#x672C;&#x4E0D;&#x652F;&#x6301;&#x4EFB;&#x4F55;&#x5B57;&#x7B26;&#x8F6C;&#x4E49;&#x5E8F;&#x5217;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;</1></p>
</blockquote>
<p>&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x6A21;&#x5757;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#x4EE5;&#x786E;&#x4FDD;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x3002;&#xFF08;&#x53EF;&#x9009;&#xFF09;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x6269;&#x5C55;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F8B;&#x5982;&#x5305;&#x542B; JSON &#x4E2D;&#x5177;&#x6709;&#x7279;&#x6B8A;&#x542B;&#x4E49;&#x7684;&#x5B57;&#x7B26;&#xFF08;&#x5982;&#x5B57;&#x7B26;&#xFF09;&#x7684;&#x8F93;&#x5165;&#x3002;&quot;</p>
<p>&#x5047;&#x8BBE;&#x6240;&#x6709;&#x6D4B;&#x8BD5;&#x90FD;&#x901A;&#x8FC7;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x4E86;&#x6A21;&#x5757; <code>protocol</code> &#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x51C6;&#x5907;&#x597D;&#x8FDB;&#x5165;&#x6B64;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x7684;&#x6700;&#x540E;&#x9636;&#x6BB5;&#xFF01;</p>
<p>[12]&#x7279;&#x522B;&#x662F;C++&#x548C;Java&#x4F7F;&#x7528;  <code>public</code>  &#x548C;  <code>private</code>  &#x5173;&#x952E;&#x5B57;&#x6765;&#x8868;&#x793A;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>
<h2 id="35-&#x4F7F;&#x7528;&#x5957;&#x63A5;&#x5B57;-socket-&#x4F20;&#x8F93;&#x6570;&#x636E;">3.5 &#x4F7F;&#x7528;&#x5957;&#x63A5;&#x5B57; <code>socket</code> &#x4F20;&#x8F93;&#x6570;&#x636E;</h2>
<p>&#x6B64;&#x65F6;&#xFF0C;&#x60A8;&#x6B63;&#x5728;&#x5B8C;&#x6210;&#x6B64;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x534F;&#x8BAE;&#x6A21;&#x5757;&#x5DF2;&#x5B8C;&#x6210;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x6A21;&#x5757;&#x5927;&#x90E8;&#x5206;&#x5DF2;&#x5B8C;&#x6210;&#x3002;&#x5728;&#x5B8C;&#x6210;&#x5BA2;&#x6237;&#x7AEF;&#x6A21;&#x5757;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x5B8C;&#x5168;&#x88AB;&#x5FFD;&#x7565;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x5668;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6A21;&#x5757;&#x4E4B;&#x4E00;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x5355;&#x72EC;&#x7F16;&#x8BD1;&#x4EE5;&#x751F;&#x6210; <code>server</code> &#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C; <code>server</code> &#x5C06;&#x5145;&#x5F53;&#x6240;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x5C06;&#x8FDE;&#x63A5;&#x5230;&#x7684;&#x4E2D;&#x5FC3;&#x96C6;&#x7EBF;&#x5668;&#x3002;&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x6267;&#x884C;&#x4E24;&#x9879;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#xFF1A;</p>
<ul>
<li>&#x503E;&#x542C;&#x6F5C;&#x5728;&#x5BA2;&#x6237;&#x7684;&#x65B0;&#x8054;&#x7CFB;&#xFF1B;</li>
<li>&#x4FA6;&#x542C;&#x6765;&#x81EA;&#x5DF2;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x65B0;&#x6D88;&#x606F;</li>
</ul>
<p>&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x90FD;&#x9700;&#x8981;&#x53D1;&#x9001;&#x5230;&#x5F53;&#x524D;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x7684;&#x6BCF;&#x4E2A;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x56FE;3.12.&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x64CD;&#x4F5C;</p>
<p><img src="Images/ch03_chat_server.png" alt="ch03 chat server"></p>
<p>&#x60A8;&#x5728;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x56FE; 3.16 &#x663E;&#x793A;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7684;&#x56FE;&#x8868;&#xFF0C;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x534F;&#x8BAE;&#x7EC6;&#x8282;&#x3002;&#x73B0;&#x5728;&#x60A8;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x4E86;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x4F7F;&#x7528;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5C06;&#x5728;&#x56FE; 3.16 &#x4E2D;&#x53D1;&#x9001;&#x7684;&#x786E;&#x5207;&#x6D88;&#x606F;&#x3002;&#x9996;&#x5148;&#x5047;&#x8BBE;&#x670D;&#x52A1;&#x5668;&#x5DF2;&#x6210;&#x529F;&#x63A5;&#x53D7;&#x6765;&#x81EA; Dom&#x3001;John &#x548C; Grace &#x7684;&#x8FDE;&#x63A5;&#x3002;&#x4EE5;&#x4E0B;&#x4E8B;&#x4EF6;&#x6309;&#x663E;&#x793A;&#x987A;&#x5E8F;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.14.&#x9996;&#x5148;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF; Dom &#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x6D88;&#x606F;</p>
<pre><code class="lang-json">{&quot;username&quot;: &quot;Dom&quot;, &quot;message&quot;: &quot;Hello&quot;}     # &lt;1&gt;
</code></pre>
<blockquote>
<p><1>    &#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x6B64;&#x6D88;&#x606F;&#x540E;&#x8DDF; \c\l</1></p>
</blockquote>
<p>&#x6E05;&#x5355; 3.15.&#x7136;&#x540E;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF; John &#x548C; Grace</p>
<pre><code class="lang-json">{&quot;username&quot;: &quot;Dom&quot;, &quot;message&quot;: &quot;Hello&quot;}     # &lt;1&gt;
</code></pre>
<blockquote>
<p><1>    &#x6B64;&#x6D88;&#x606F;&#x540E;&#x8FD8;&#x8DDF;&#x7740; \c\l</1></p>
</blockquote>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x670D;&#x52A1;&#x5668;&#x53EA;&#x662F;&#x5C06;&#x5B83;&#x6536;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x4E3A;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x68C0;&#x67E5;&#x4EFB;&#x4F55;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x5C06;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x6765;&#x6539;&#x8FDB;&#x6B64;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x4E14;&#x5B89;&#x5168;&#x6027;&#x5C06;&#x662F;&#x9F13;&#x52B1;&#x60A8;&#x52A0;&#x5F3A;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x3002;</p>
<p>&#x6682;&#x65F6;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x521B;&#x5EFA;&#x670D;&#x52A1;&#x5668;&#x6A21;&#x5757;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x5B9A;&#x4E49;&#x5B83;&#x5C06;&#x4F7F;&#x7528;&#x7684;&#x7C7B;&#x578B;&#x5F00;&#x59CB;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5728; <code>src</code> &#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6587;&#x4EF6; <code>server.nim</code> &#x3002;&#x7136;&#x540E;&#x521B;&#x5EFA;&#x6E05;&#x5355; 3.16 &#x4E2D;&#x6240;&#x793A;&#x7684;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.16.&#x6807;&#x51C6;&#x5E93;&#x5BFC;&#x5165;&#x548C;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> asyncdispatch, asyncnet     <span class="hljs-comment"># &lt;1&gt;</span>

<span class="hljs-keyword">type</span>     <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-type">Client</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>        <span class="hljs-comment"># &lt;3&gt;</span>
    socket: <span class="hljs-type">AsyncSocket</span>      <span class="hljs-comment"># &lt;4&gt;</span>
    netAddr: <span class="hljs-built_in">string</span>          <span class="hljs-comment"># &lt;4&gt;</span>
    id: <span class="hljs-built_in">int</span>                  <span class="hljs-comment"># &lt;6&gt;</span>
    connected: <span class="hljs-built_in">bool</span>          <span class="hljs-comment"># &lt;7&gt;</span>

  <span class="hljs-type">Server</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>        <span class="hljs-comment"># &lt;8&gt;</span>
    socket: <span class="hljs-type">AsyncSocket</span>      <span class="hljs-comment"># &lt;9&gt;</span>
    clients: <span class="hljs-built_in">seq</span>[<span class="hljs-type">Client</span>]     <span class="hljs-comment"># &lt;10&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x5BFC;&#x5165;&#x5305;&#x542B;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x5957;&#x63A5;&#x5B57;&#x6240;&#x9700;&#x7684;&#x8FC7;&#x7A0B;&#x548C;&#x7C7B;&#x578B;&#x7684;  <code>asyncdispatch</code> &#x548C; <code>asyncnet</code>  &#x6A21;&#x5757;&#x3002;</1></p>
<p><2>    &#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7C7B;&#x578B;&#x90E8;&#x5206;&#x3002;</2></p>
<p><3>    &#x5C06; <code>Client</code> &#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E3A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x3002;</3></p>
<p><4>    &#x5C5E;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5957;&#x63A5;&#x5B57;&#xFF0C; <code>AsyncSocket</code> &#x7C7B;&#x578B;&#x4E3A;&#x5F02;&#x6B65;&#x5957;&#x63A5;&#x5B57;&#x3002;</4></p>
<p><5>    &#x5B58;&#x50A8;&#x6B64;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x5730;&#x5740;&#x7684;&#x5B57;&#x6BB5;&#x3002;</5></p>
<p><6>    &#x6B64;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6807;&#x8BC6;&#x53F7;&#x3002;</6></p>
<p><7>    &#x786E;&#x5B9A;&#x6B64;&#x5BA2;&#x6237;&#x7AEF;&#x662F;&#x5426;&#x4ECD;&#x5904;&#x4E8E;&#x8FDE;&#x63A5;&#x72B6;&#x6001;&#x7684;&#x6807;&#x5FD7;&#x3002;</7></p>
<p><8>    &#x5C06;&#x7C7B;&#x578B; <code>Server</code> &#x5B9A;&#x4E49;&#x4E3A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x3002;</8></p>
<p><9>    &#x7528;&#x4E8E;&#x63A5;&#x53D7;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x3002;</9></p>
<p><10>    &#x5DF2;&#x8FDE;&#x63A5; <code>Client</code> &#x5BF9;&#x8C61;&#x7684;&#x5217;&#x8868;&#x3002;</10></p>
</blockquote>
<p> <code>Server</code> &#x548C; <code>Client</code> &#x7C7B;&#x578B;&#x90FD;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x8BB0;&#x5F97;&#x7B2C;2&#x7AE0;&#x4E2D;&#x7684;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x5C06;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x7684;&#x8FC7;&#x7A0B;&#x6765;&#x4FEE;&#x6539;&#x5B83;&#x4EEC;&#x3002;&#x8FD9;&#x5C06;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x65B0;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x5230; <code>clients</code> &#x5B57;&#x6BB5;&#x4E2D;&#x3002;</p>
<p> <code>Server</code> &#x7C7B;&#x578B;&#x4FDD;&#x5B58;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x76F4;&#x63A5;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x548C;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C; <code>Client</code> &#x7C7B;&#x578B;&#x8868;&#x793A;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5355;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5B83;&#x5305;&#x62EC;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x4F8B;&#x5982;&#xFF0C; <code>netAddr</code> &#x5B57;&#x6BB5;&#x5C06;&#x5305;&#x542B;&#x5BA2;&#x6237;&#x7AEF;&#x7684;IP&#x5730;&#x5740;&#xFF0C; <code>id</code> &#x5B57;&#x6BB5;&#x5C06;&#x4FDD;&#x5B58;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x751F;&#x6210;&#x7684;&#x6807;&#x8BC6;&#xFF0C;&#x4EE5;&#x4FBF;&#x60A8;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#x3002; <code>connected</code> &#x5DF2;&#x8FDE;&#x63A5;&#x6807;&#x5FD7;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x6807;&#x5FD7;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8DDF;&#x8E2A;&#x5BA2;&#x6237;&#x7AEF;&#x662F;&#x5426;&#x4ECD;&#x5904;&#x4E8E;&#x8FDE;&#x63A5;&#x72B6;&#x6001;&#x3002;&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x5C1D;&#x8BD5;&#x5411;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x65B0;&#x5B9A;&#x4E49;&#x7684; <code>Server</code> &#x7C7B;&#x578B;&#x521B;&#x5EFA;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;</p>
<p><strong>Nim&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;</strong></p>
<p>Nim &#x4E2D;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53EA;&#x662F;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x547D;&#x540D;&#x7EA6;&#x5B9A;&#x7684;&#x8FC7;&#x7A0B;&#x3002;Nim &#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x6B64;&#x7C7B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x7279;&#x6B8A;&#x8BED;&#x6CD5;&#xFF0C;&#x4F46;&#x5B83;&#x786E;&#x5B9E;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x7528;&#x4E8E;&#x6784;&#x9020;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x7684;&#x7B80;&#x5355;&#x8BED;&#x6CD5;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x8FD8;&#x8BB0;&#x5F97;&#x7B2C; 2 &#x7AE0;&#x3002;&#x793A;&#x4F8B;&#x5982;&#x4E0B;&#x3002;</p>
<p>&#x5143;&#x7EC4;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x503C;&#x653E;&#x5728;&#x62EC;&#x53F7;&#x4E2D;&#x6765;&#x6784;&#x9020;&#xFF1A;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Point</span> = <span class="hljs-keyword">tuple</span>[x, y: <span class="hljs-built_in">int</span>]

<span class="hljs-keyword">var</span> point = (<span class="hljs-number">5</span>, <span class="hljs-number">10</span>)
<span class="hljs-keyword">var</span> point2 = (x: <span class="hljs-number">5</span>, y: <span class="hljs-number">10</span>)
</code></pre>
<p>&#x5BF9;&#x8C61;&#xFF08;&#x5305;&#x62EC; <code>ref</code> &#x5BF9;&#x8C61;&#xFF09;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x7C7B;&#x578B;&#xFF08;&#x5C31;&#x50CF;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E00;&#x6837;&#xFF09;&#x6765;&#x6784;&#x9020;&#xFF0C;&#x7136;&#x540E;&#x6307;&#x5B9A;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x548C;&#x503C;&#xFF0C;&#x7528;&#x5192;&#x53F7;&#x5206;&#x9694;&#xFF1A;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Human</span> = <span class="hljs-keyword">object</span>
    name: <span class="hljs-built_in">string</span>
    age: <span class="hljs-built_in">int</span>

<span class="hljs-keyword">var</span> jeff = <span class="hljs-type">Human</span>(name: <span class="hljs-string">&quot;Jeff&quot;</span>, age: <span class="hljs-number">23</span>)
<span class="hljs-keyword">var</span> amy = <span class="hljs-type">Human</span>(name: <span class="hljs-string">&quot;Amy&quot;</span>, age: <span class="hljs-number">20</span>)
</code></pre>
<p>&#x65E0;&#x6CD5;&#x91CD;&#x5199;&#x8FD9;&#x4E9B;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x60A8;&#x9700;&#x8981;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;Nim&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x547D;&#x540D;&#x8FD9;&#x4E9B;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8FC7;&#x7A0B;&#x7684;&#x7EA6;&#x5B9A;&#xFF0C;&#x4E0B;&#x8868;&#x663E;&#x793A;&#x4E86;&#x8FD9;&#x4E9B;&#x7EA6;&#x5B9A;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x3002;</p>
<table>
<thead>
<tr>
<th>&#x7C7B;&#x578B;&#x5B9A;&#x4E49;</th>
<th>&#x540D;&#x79F0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>MyType = object</code></td>
<td><code>initMyType</code></td>
</tr>
<tr>
<td><code>MyTypeRef = ref object</code></td>
<td><code>newMyTypeRef</code></td>
</tr>
<tr>
<td><code>MyTuple = tuple[x, y: int]</code></td>
<td><code>initMyTuple</code></td>
</tr>
</tbody>
</table>
<p>&#x5BF9;&#x4E8E;<code>ref</code>&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;<code>Server</code>&#x7C7B;&#x578B;&#xFF0C;&#x8FC7;&#x7A0B;&#x5E94;&#x547D;&#x540D;&#x4E3A;<code>newServer</code>&#xFF1A;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> newServer(): <span class="hljs-type">Server</span> = <span class="hljs-type">Server</span>(socket: newAsyncSocket(), clients: @[])
</code></pre>
<p>&#x8FD9;&#x5C06;&#x521B;&#x5EFA; <code>Server</code> &#x7C7B;&#x578B;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x521D;&#x59CB;&#x5316;&#x5176;&#x5957;&#x63A5;&#x5B57;&#x548C; <code>clients</code> &#x5E8F;&#x5217;&#x3002;&#x73B0;&#x5728;&#x8C03;&#x7528;&#x6B64;&#x8FC7;&#x7A0B;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x914D;&#x7ED9;&#x65B0;&#x7684; <code>Server</code> &#x53D8;&#x91CF;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">var</span> server = newServer()
</code></pre>
<p>&#x5728;&#x6E05;&#x5355; 3.16 &#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x7C7B;&#x578B;&#x4E0B;&#x9762;&#x6DFB;&#x52A0;&#x4E0A;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x4E3A;&#x5F00;&#x59CB;&#x6DFB;&#x52A0;&#x7F51;&#x7EDC;&#x4EE3;&#x7801;&#x5960;&#x5B9A;&#x4E86;&#x826F;&#x597D;&#x7684;&#x57FA;&#x7840;&#x3002;&#x4F46;&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x7F51;&#x7EDC;&#x5982;&#x4F55;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F02;&#x6B65;&#x7F51;&#x7EDC;&#x5728; Nim &#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x6211;&#x5C06;&#x9996;&#x5148;&#x67E5;&#x770B;&#x7528;&#x4E8E;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x57FA;&#x672C;&#x5DE5;&#x5177;&#xFF0C;&#x8BE5;&#x5DE5;&#x5177;&#x79F0;&#x4E3A;&#x5957;&#x63A5;&#x5B57;&#x3002;</p>
<h2 id="351-&#x4EC0;&#x4E48;&#x662F;&#x5957;&#x63A5;&#x5B57;&#xFF1F;">3.5.1 &#x4EC0;&#x4E48;&#x662F;&#x5957;&#x63A5;&#x5B57;&#xFF1F;</h2>
<p>&#x5728;&#x51E0;&#x4E4E;&#x6BCF;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x5957;&#x63A5;&#x5B57;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x5C3C;&#x59C6;&#x4E2D;&#x7684;&#x7F51;&#x7EDC;&#x5957;&#x63A5;&#x5B57;&#x4F7F;&#x7528; <code>Socket</code> &#x5957;&#x63A5;&#x5B57;&#x7C7B;&#x578B;&#x8868;&#x793A;&#x3002;&#x6B64;&#x7C7B;&#x578B;&#x5728; <code>net</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>newSocket</code> &#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x5176;&#x65B0;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x5957;&#x63A5;&#x5B57;&#x4E0E;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x6709;&#x4E00;&#x4E9B;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x652F;&#x6301;  <code>write</code> ,  <code>read</code> ,  <code>open</code>  &#x548C;  <code>close</code> ,&#x5373;&#x5199;&#x3001;&#x8BFB;&#x3001;&#x6253;&#x5F00;&#x548C;&#x5173;&#x95ED;&#x7B49;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x5957;&#x63A5;&#x5B57;&#x7684;&#x5DEE;&#x5F02;&#x8DB3;&#x4EE5;&#x66B4;&#x9732;&#x4E0D;&#x540C;&#x7684;&#x63A5;&#x53E3;<em>&#x4E0B;&#x9762;&#x7684;&#x8868;3.1</em>&#x663E;&#x793A;&#x4E86;&#x4E3A;&#x5957;&#x63A5;&#x5B57;&#x53CA;&#x5176;&#x7B49;&#x6548;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x8868; 3.1.&#x5E38;&#x89C1;&#x5957;&#x63A5;&#x5B57;&#x8FC7;&#x7A0B;</p>
<table>
<thead>
<tr>
<th>&#x8FC7;&#x7A0B;</th>
<th>&#x7B49;&#x6548;&#x6587;&#x4EF6;&#x8FC7;&#x7A0B;</th>
<th>&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>recv</code></td>
<td><code>read</code></td>
<td>&#x5141;&#x8BB8;&#x4ECE;&#x8FDC;&#x7A0B;&#x8BFB;&#x53D6;&#x4F20;&#x5165;&#x6570;&#x636E;&#x3002;&#x5BF9;&#x4E8E;TCP&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x4F7F;&#x7528; <code>recv</code> &#xFF0C;&#x800C;&#x5BF9;&#x4E8E;UDP&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x5219;&#x4F7F;&#x7528; <code>recvFrom</code> &#x3002;</td>
</tr>
<tr>
<td><code>send</code></td>
<td><code>write</code></td>
<td>&#x5C06;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x8FDC;&#x7A0B;&#x7AEF;&#x3002;&#x5BF9;&#x4E8E;TCP&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x4F7F;&#x7528; <code>send</code> &#xFF0C;&#x800C;&#x5BF9;&#x4E8E;UDP&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x5219;&#x4F7F;&#x7528; <code>sendTo</code> &#x3002;</td>
</tr>
<tr>
<td><code>connect</code></td>
<td><code>open</code></td>
<td>&#x5C06;&#x5957;&#x63A5;&#x5B57;&#x8FDE;&#x63A5;&#x5230;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x4EC5;&#x7528;&#x4E8E;TCP&#x5957;&#x63A5;&#x5B57;&#x3002;</td>
</tr>
<tr>
<td><code>bindAddr</code></td>
<td>&#x65E0;</td>
<td>&#x5C06;&#x5957;&#x63A5;&#x5B57;&#x7ED1;&#x5B9A;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x3002;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x5957;&#x63A5;&#x5B57;&#x5C06;&#x6210;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x5176;&#x4ED6;&#x5957;&#x63A5;&#x5B57;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x5230;&#x8BE5;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x4EC5;&#x7528;&#x4E8E;TCP&#x5957;&#x63A5;&#x5B57;&#x3002;</td>
</tr>
</tbody>
</table>
<p>&#x901A;&#x8FC7;&#x5728;<code>newSocket</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x6307;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x5957;&#x63A5;&#x5B57;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x81EA;&#x5B9A;&#x4E49;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;<code>newSocket</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x5C06;&#x521B;&#x5EFA;TCP&#x5957;&#x63A5;&#x5B57;&#x3002;&#x8FD9;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x56E0;&#x4E3A;TCP&#x6070;&#x597D;&#x662F;&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x534F;&#x8BAE;&#x3002;</p>
<p>TCP&#x534F;&#x8BAE;&#x662F;&#x4E00;&#x79CD;&#x8FDE;&#x63A5;&#x534F;&#x8BAE;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5957;&#x63A5;&#x5B57;&#x7528;&#x4F5C;&#x670D;&#x52A1;&#x5668;&#x6216;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x5728;&#x8C03;&#x7528; <code>bindAddr</code> &#x6216; <code>connect</code> &#x8FC7;&#x7A0B;&#x4E4B;&#x524D;&#xFF0C;&#x65B0;&#x521B;&#x5EFA;&#x7684;TCP&#x5957;&#x63A5;&#x5B57;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x3002;&#x524D;&#x8005;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x540E;&#x8005;&#x8F6C;&#x6362;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7EC4;&#x4EF6;&#x6240;&#x9700;&#x8981;&#x7684;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x4FA6;&#x542C;&#x65B0;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x5EF6;&#x8FDF;&#x5730;&#x63A5;&#x53D7;&#x5B83;&#x4EEC;&#x3002;&#x4F46;&#x5728;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x5C06;&#x5957;&#x63A5;&#x5B57;&#x7ED1;&#x5B9A;&#x5230;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x3002;<em>&#x56FE;3.17</em>&#x663E;&#x793A;&#x4E86;&#x6210;&#x529F;&#x521B;&#x5EFA;&#x548C;&#x7ED1;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x6240;&#x9700;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x56FE; 3.13.&#x5F00;&#x59CB;&#x5728;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x4E0A;&#x63A5;&#x53D7;&#x65B0;&#x8FDE;&#x63A5;&#x6240;&#x9700;&#x7684;&#x6B65;&#x9AA4;</p>
<p><img src="Images/ch03_server_socket.png" alt="ch03 server socket"></p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x90FD;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x7ED1;&#x5B9A;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x7AEF;&#x53E3;&#x548C;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5C06;&#x7AEF;&#x53E3;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x548C;&#x5730;&#x5740;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7684; <code>bindAddr</code> &#x8FC7;&#x7A0B;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5730;&#x5740;&#x53EA;&#x662F; <code>localhost</code> &#x672C;&#x5730;&#x4E3B;&#x673A;&#xFF0C;&#x4F46;&#x5FC5;&#x987B;&#x59CB;&#x7EC8;&#x6307;&#x5B9A;&#x7AEF;&#x53E3;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x7AEF;&#x53E3;&#x6307;&#x5B9A;&#x4E3A;&#x6240;&#x9700;&#x7684;&#x4EFB;&#x4F55;&#x7AEF;&#x53E3;&#xFF0C;&#x4F46;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x7AEF;&#x53E3;&#x3002;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F; HTTP &#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528;&#x7684;&#x7AEF;&#x53E3; 80&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x53E6;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x7ED1;&#x5B9A;&#x5230; 1024 &#x6216;&#x66F4;&#x5C0F;&#x7684;&#x7AEF;&#x53E3;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x5458;&#x6743;&#x9650;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x5728;&#x5957;&#x63A5;&#x5B57;&#x5F00;&#x59CB;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x8C03;&#x7528;&#x5176;&#x4E0A;&#x7684; <code>listen</code> &#x8FC7;&#x7A0B;&#x3002; <code>listen</code> &#x7A0B;&#x5E8F;&#x544A;&#x8BC9;&#x5957;&#x63A5;&#x5B57;&#x5F00;&#x59CB;&#x4FA6;&#x542C;&#x4F20;&#x5165;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>accept</code>&#x63A5;&#x53D7;&#x8FC7;&#x7A0B;&#x63A5;&#x53D7;&#x65B0;&#x8FDE;&#x63A5;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x8BE5;&#x5957;&#x63A5;&#x5B57;&#x5BF9;&#x5E94;&#x4E8E;&#x521A;&#x521A;&#x8FDE;&#x63A5;&#x5230;<code>bindAddr</code>&#x8C03;&#x7528;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x3002;</p>
<blockquote>
<p>&#x63D0;&#x793A; &#x6709;&#x5173;&#x5957;&#x63A5;&#x5B57;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F; 
&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#x8BB0;&#x4F4F;&#x672C;&#x8282;&#x4E2D;&#x5199;&#x7684;&#x6240;&#x6709;&#x7EC6;&#x8282;&#xFF0C;&#x5C06;&#x5176;&#x7528;&#x4F5C;&#x53C2;&#x8003;&#xFF0C;&#x4E0E;&#x4E0B;&#x4E00;&#x8282;&#x4E00;&#x8D77;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x4ED8;&#x8BF8;&#x5B9E;&#x8DF5;&#x3002;</p>
</blockquote>
<p>&#x4E0E;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7C7B;&#x4F3C;&#xFF0C;&#x8BE5; <code>accept</code> &#x8FC7;&#x7A0B;&#x4F1A;&#x963B;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x76F4;&#x5230;&#x5EFA;&#x7ACB;&#x65B0;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x7531;&#x4E8E; Nim &#x5BF9;&#x5F02;&#x6B65;&#x5957;&#x63A5;&#x5B57;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F88;&#x5BB9;&#x6613;&#x89E3;&#x51B3;&#x3002;&#x5F02;&#x6B65;&#x5957;&#x63A5;&#x5B57;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x540C;&#x6B65;&#x963B;&#x585E;&#x5957;&#x63A5;&#x5B57;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5927;&#x9EBB;&#x70E6;&#x3002;&#x5F02;&#x6B65;&#x5957;&#x63A5;&#x5B57;&#x5728; <code>asyncnet</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x6211;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#x89E3;&#x91CA;&#x5B83;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;</p>
<h2 id="352-&#x5F02;&#x6B65;&#x8F93;&#x5165;&#x8F93;&#x51FA;">3.5.2 &#x5F02;&#x6B65;&#x8F93;&#x5165;/&#x8F93;&#x51FA;</h2>
<p>Nim&#x652F;&#x6301;&#x8BB8;&#x591A;&#x4F7F;&#x5F02;&#x6B65;I/O&#x5DE5;&#x4F5C;&#x7B80;&#x5355;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x5F02;&#x6B65;I/O&#x4E0E;&#x540C;&#x6B65;I/O&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x6BD4;&#x5B9E;&#x9645;&#x66F4;&#x590D;&#x6742;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x770B;&#x4E00;&#x4E0B;<code>accept</code>&#x8FC7;&#x7A0B;&#x3002;<code>accept</code>&#x8FC7;&#x7A0B;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x68C0;&#x7D22;&#x5DF2;&#x8FDE;&#x63A5;&#x5230;&#x6307;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x7684;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p> <code>accept</code> &#x8FC7;&#x7A0B;&#x7684;&#x540C;&#x6B65;&#x7248;&#x672C;&#x548C;&#x5F02;&#x6B65;&#x7248;&#x672C;&#x4E4B;&#x95F4;&#x6700;&#x57FA;&#x672C;&#x7684;&#x533A;&#x522B;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x540C;&#x6B65; <code>accept</code> &#x8FC7;&#x7A0B;&#x4F1A;&#x963B;&#x585E;&#x8C03;&#x7528;&#x5B83;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x76F4;&#x5230;&#x65B0;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#xFF1B;</li>
<li>&#x5F02;&#x6B65; <code>accept</code> &#x8FC7;&#x7A0B;&#x5728;&#x8C03;&#x7528;&#x540E;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x3002;</li>
</ul>
<p>&#x4F46;&#x662F;&#x5F02;&#x6B65;&#x7248;&#x672C;&#x8FD4;&#x56DE;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x5F53;&#x7136;&#x4E0D;&#x80FD;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x63A5;&#x53D7;&#x7684;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x80FD;&#x8FD8;&#x6CA1;&#x6709;&#x8FDE;&#x63A5;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x5F02;&#x6B65; <code>accept</code> &#x8FD4;&#x56DE;&#x4E00;&#x4E2A; <code>Future[AsyncSocket]</code> &#x5BF9;&#x8C61;&#x3002;&#x4E86;&#x89E3;&#x5F02;&#x6B65;I/O&#x7684;&#x57FA;&#x7840;&#x662F;&#x4E86;&#x89E3;&#x672A;&#x6765;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x56E0;&#x6B64;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x4E86;&#x89E3;&#x5B83;&#x3002;</p>
<p><strong>&#x672A;&#x6765;&#x578B; <code>Future</code>  `</strong>` </p>
<p> <code>Future</code> &#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x8BB8;&#x591A;&#x540D;&#x79F0;&#xFF0C;&#x5305;&#x62EC;<em>promise</em>, <em>delay</em> &#x548C; <em>deferred</em> &#x5373; &#x627F;&#x8BFA;&#x3001;&#x5EF6;&#x8FDF;&#x548C;&#x8FDF;&#x7684;&#x3002;&#x6B64;&#x7C7B;&#x578B;&#x5145;&#x5F53;&#x521D;&#x59CB;&#x672A;&#x77E5;&#x7ED3;&#x679C;&#x7684;&#x4EE3;&#x7406;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x56E0;&#x4E3A;&#x5176;&#x503C;&#x7684;&#x8BA1;&#x7B97;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x672A;&#x6765;&#x60F3;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#xFF0C;&#x6700;&#x521D;&#x5B83;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x5F53;&#x5B83;&#x4FDD;&#x6301;&#x4E3A;&#x7A7A;&#x65F6;&#xFF0C;&#x60A8;&#x65E0;&#x6CD5;&#x68C0;&#x7D22;&#x5176;&#x503C;&#x3002;&#x5728;&#x67D0;&#x4E2A;&#x672A;&#x77E5;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E0D;&#x518D;&#x662F;&#x7A7A;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x662F; <code>Future</code> &#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x7684;&#x7531;&#x6765;&#x3002;</p>
<p>Nim&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x90FD;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; <code>Future[T]</code> &#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x4E2D; <code>T</code> &#x5BF9;&#x5E94;&#x4E8E; <code>Future</code> &#x627F;&#x8BFA;&#x5728;&#x672A;&#x6765;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x7C7B;&#x578B;&#x3002;</p>
<p> <code>Future[T]</code> &#x7C7B;&#x578B;&#x662F;&#x5728; <code>asyncdispatch</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5904;&#x7406;&#x4EFB;&#x4F55;&#x5F02;&#x6B65;I/O&#x64CD;&#x4F5C;<em>&#x4E0B;&#x9762;&#x7684;&#x6E05;&#x5355;3.17</em>&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684; <code>Future[int]</code> &#x5BF9;&#x8C61;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x6E05;&#x5355;3.17.&#x7B80;&#x5355;&#x7684; <code>Future[int]</code> &#x793A;&#x4F8B;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> asyncdispatch     <span class="hljs-comment"># &lt;1&gt;</span>

<span class="hljs-keyword">var</span> answer = newFuture[<span class="hljs-built_in">int</span>]()      <span class="hljs-comment"># &lt;2&gt;</span>
doAssert(<span class="hljs-keyword">not</span> answer.finished)      <span class="hljs-comment"># &lt;3&gt;</span>

answer.callback =        <span class="hljs-comment"># &lt;4&gt;</span>
  <span class="hljs-keyword">proc</span> (future: <span class="hljs-type">Future</span>[<span class="hljs-built_in">int</span>]) =     <span class="hljs-comment"># &lt;4&gt;</span>
    echo(<span class="hljs-string">&quot;Future is no longer empty, &quot;</span>, future.read)     <span class="hljs-comment"># &lt;6&gt;</span>

answer.complete(<span class="hljs-number">42</span>)      <span class="hljs-comment"># &lt;7&gt;</span>
</code></pre>
<blockquote>
<p><1>     <code>asyncdispatch</code> &#x6A21;&#x5757;&#x5728;&#x5B9A;&#x4E49; <code>Future[T]</code> &#x7C7B;&#x578B;&#x65F6;&#x9700;&#x8981;&#x5BFC;&#x5165;&#x3002;</1></p>
<p><2>    &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570; <code>newFuture</code> &#x521D;&#x59CB;&#x5316;&#x65B0;&#x7684; <code>Future</code> &#x3002;</2></p>
<p><3>     <code>Future</code> &#x5F00;&#x59CB;&#x65F6;&#x4E3A;&#x7A7A;&#xFF0C;&#x5F53; <code>Future</code> &#x4E0D;&#x4E3A;&#x7A7A;&#x65F6;&#xFF0C; <code>finished</code> &#x8FC7;&#x7A0B;&#x5C06;&#x8FD4;&#x56DE; <code>true</code> &#x3002;</3></p>
<p><4>    &#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#xFF0C;&#x5F53;&#x8BBE;&#x7F6E;&#x672A;&#x6765;&#x7684;&#x503C;&#x65F6;&#x5C06;&#x8C03;&#x7528;&#x8BE5;&#x56DE;&#x8C03;&#x3002;</4></p>
<p><5>    &#x56DE;&#x8C03;&#x88AB;&#x8D4B;&#x4E88;&#x5176;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A;&#x53C2;&#x6570;&#x7684;&#x672A;&#x6765;&#x3002;</5></p>
<p><6>    &#x8BE5; <code>read</code> &#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x68C0;&#x7D22;&#x672A;&#x6765;&#x7684;&#x503C;&#x3002;</6></p>
<p><7>    &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x8FC7;&#x7A0B; <code>complete</code> &#x6765;&#x8BBE;&#x7F6E;&#x672A;&#x6765;&#x7684;&#x503C;&#x3002;</7></p>
</blockquote>
<p>&#x5982;&#x679C;&#x503C;&#x8BA1;&#x7B97;&#x5931;&#x8D25;&#xFF0C; <code>Future</code> &#x4E5F;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x5F02;&#x5E38;&#x3002;&#x5BF9;&#x5305;&#x542B;&#x5F02;&#x5E38;&#x7684; <code>Future</code> &#x8C03;&#x7528; <code>read</code> &#x5C06;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x8BF7;&#x5C06;&#x4E0A;&#x9762;<em>&#x6E05;&#x5355;3.17</em>&#x7684;&#x6700;&#x540E;&#x4E00;&#x884C;&#x4FEE;&#x6539;&#x4E3A; <code>answer.fail(newException(ValueError, &quot;The future failed&quot;))</code> &#x3002;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x5D29;&#x6E83;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x4EE5;&#x4E0B;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-bash">Traceback (most recent call last)
system.nim(2510)         ch3_futures
asyncdispatch.nim(242)   fail
asyncdispatch.nim(267)   :anonymous
ch3_futures.nim(8)       :anonymous
asyncdispatch.nim(289)   <span class="hljs-built_in">read</span>
Error: unhandled exception: The future failed
  unspecified<span class="hljs-string">&apos;s lead up to read of failed Future:     # &lt;1&gt;
    Traceback (most recent call last)
    system.nim(2510)         ch3_futures
    asyncdispatch.nim(240)   fail [Exception]
</span></code></pre>
<blockquote>
<p><1>     <code>unspecified</code>&#x662F;&#x672A;&#x6765;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;<code>unspecified</code>&#x672A;&#x6307;&#x5B9A;&#xFF0C;&#x56E0;&#x4E3A;&#x672A;&#x6765;&#x662F;&#x7528;&#x6CA1;&#x6709;&#x540D;&#x79F0;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x5728;<code>newFuture</code>&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E2D;&#x6307;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x53EF;&#x4EE5;&#x547D;&#x540D;<code>future</code>&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x8C03;&#x8BD5;&#x4FE1;&#x606F;&#x3002;</1></p>
</blockquote>
<p>&#x5982;&#x60A8;&#x6240;&#x89C1;&#xFF0C;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x8BD5;&#x56FE;&#x5C06;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x6253;&#x5305;&#x5230;&#x81EA;&#x8EAB;&#x4E2D;&#x3002;&#x5B83;&#x786E;&#x5B9E;&#x9020;&#x6210;&#x4E86;&#x4E00;&#x4E9B;&#x6DF7;&#x4E71;&#xFF0C;&#x5E76;&#x4E14;&#x7F3A;&#x5C11;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x3002;&#x671F;&#x8D27;&#x4EA7;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x4ECD;&#x5728;&#x5904;&#x7406;&#x4E2D;&#xFF0C;&#x5E94;&#x8BE5;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x6539;&#x8FDB;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6700;&#x597D;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x5F53;&#x524D;&#x7684;&#x5916;&#x89C2;&#xFF0C;&#x56E0;&#x4E3A;&#x5728; Nim &#x4E2D;&#x7F16;&#x5199;&#x5F02;&#x6B65;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x60A8;&#x65E0;&#x7591;&#x4F1A;&#x770B;&#x5230;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x5F02;&#x5E38;&#x662F;&#x7531;&#x8C03;&#x7528;&#x5185;&#x90E8;&#x5B58;&#x50A8;&#x4E86;&#x5F02;&#x5E38;&#x7684;&#x672A;&#x6765;&#x5F15;&#x8D77;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>readfailed</code> &#x8FC7;&#x7A0B;&#x68C0;&#x67E5;&#x5C06;&#x6765;&#x662F;&#x5426;&#x5B8C;&#x6210;&#x5E76;&#x51FA;&#x73B0;&#x5F02;&#x5E38;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x8BE5;&#x5E03;&#x5C14;&#x503C;&#x786E;&#x5B9A;&#x672A;&#x6765;&#x662F;&#x5426;&#x5B8C;&#x6210;&#x5E76;&#x51FA;&#x73B0;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x4F7F;&#x7528; <code>Future</code> &#x65F6;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x4E00;&#x4EF6;&#x91CD;&#x8981;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;&#x9664;&#x975E;&#x660E;&#x786E;&#x8BFB;&#x53D6;&#x5B83;&#x4EEC;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x4EEC;&#x5B58;&#x50A8;&#x7684;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x90FD;&#x53EF;&#x80FD;&#x5728; <code>Future</code> &#x88AB;&#x89E3;&#x9664;&#x5206;&#x914D;&#x65F6;&#x6084;&#x65E0;&#x58F0;&#x606F;&#x5730;&#x6D88;&#x5931;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F; <code>discard</code> &#x672A;&#x6765;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;  <code>asyncCheck</code> &#x8FC7;&#x7A0B;&#x6765;&#x786E;&#x4FDD;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x91CD;&#x65B0;&#x5F15;&#x53D1;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x3002;</p>
<p><strong>&#x540C;&#x6B65;&#x6267;&#x884C;&#x548C;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#x533A;&#x522B;</strong></p>
<p>&#x5E0C;&#x671B;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x60A8;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86; <code>Future</code> &#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x5E76;&#x51C6;&#x5907;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x5B66;&#x4E60;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x8FC7;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x56FE; 3.18 &#x663E;&#x793A;&#x4E86;&#x8C03;&#x7528;&#x540C;&#x6B65;&#x7248;&#x672C; <code>accept</code> &#x4E0E;&#x8C03;&#x7528;&#x5F02;&#x6B65;&#x7248;&#x672C; <code>accept</code> &#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p>&#x56FE; 3.14. <code>accept</code> &#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;&#x7684;&#x533A;&#x522B;&#x3002;</p>
<p><img src="Images/ch03_server_socket_async.png" alt="ch03 server socket async"></p>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5F02;&#x6B65; <code>accept</code> &#x7ACB;&#x5373;&#x8FD4;&#x56DE; <code>Future</code> &#x5BF9;&#x8C61;&#x3002;&#x800C;&#x540C;&#x6B65; <code>accept</code> &#x5C06;&#x963B;&#x6B62;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x3002;&#x5F53;&#x7EBF;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#x65F6;&#xFF0C;&#x5B83;&#x662F;&#x7A7A;&#x95F2;&#x7684;&#xFF0C;&#x4E0D;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x6709;&#x7528;&#x7684;&#x8BA1;&#x7B97;&#x5DE5;&#x4F5C;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5F02;&#x6B65;&#x7248;&#x672C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#x5DE5;&#x4F5C;&#xFF0C;&#x53EA;&#x8981;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x4E0D;&#x9700;&#x8981;&#x5BA2;&#x6237;&#x7AEF;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x5B83;&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x4EE5;&#x524D;&#x8FDE;&#x63A5;&#x8FC7;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x53EA;&#x6D89;&#x53CA;&#x8BA1;&#x7B97;&#x3C0;&#x7684;&#x7B2C;1025&#x4F4D;&#x5C0F;&#x6570;&#x3002;&#x5728;<em>&#x56FE;3.18</em>&#x4E2D;&#xFF0C;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x88AB;&#x9690;&#x85CF;&#x5728;&#x4E00;&#x4E2A; <code>doWork</code>  &#x8FC7;&#x7A0B;&#x4E4B;&#x4E0B;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x5E55;&#x540E;&#x6267;&#x884C;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x5F02;&#x6B65;&#x7248;&#x672C;&#x5BF9; <code>doWork</code> &#x7684;&#x8C03;&#x7528;&#x6BD4;&#x540C;&#x6B65;&#x7248;&#x672C;&#x591A;&#x5F97;&#x591A;&#x3002;&#x5B83;&#x8FD8;&#x4FDD;&#x7559;&#x4E86;&#x5BF9;  <code>doWork(socket)</code> &#x7684;&#x8C03;&#x7528;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#xFF0C;&#x4F46;&#x6027;&#x80FD;&#x7279;&#x6027;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x4F46;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;<em>&#x56FE;3.18</em>&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x5F02;&#x6B65;&#x6267;&#x884C;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x5C55;&#x793A;&#x4E86;&#x6240;&#x8C13;&#x7684;&#x5FD9;&#x788C;&#x7B49;&#x5F85;&#xFF0C;&#x5373;&#x53CD;&#x590D;&#x68C0;&#x67E5;&#x672A;&#x6765;&#x662F;&#x5426;&#x4E3A;&#x7A7A;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x975E;&#x5E38;&#x4F4E;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;CPU&#x65F6;&#x95F4;&#x88AB;&#x6D6A;&#x8D39;&#x5728;&#x65E0;&#x7528;&#x7684;&#x6D3B;&#x52A8;&#x4E0A;&#x3002;&#x6B63;&#x5982;&#x60A8;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C; <code>Future</code> &#x652F;&#x6301;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#xFF0C;&#x8BE5;&#x56DE;&#x8C03;&#x53EF;&#x4EE5;&#x88AB;&#x81EA;&#x5B9A;&#x4E49;&#x8FC7;&#x7A0B;&#x8986;&#x76D6;&#x3002;&#x6BCF;&#x5F53; <code>Future</code> &#x7528;&#x4E00;&#x4E2A;&#x503C;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x8C03;&#x7528;&#x56DE;&#x8C03;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x8BE5;&#x503C;&#x5B58;&#x50A8;&#x5728;&#x8BE5;&#x672A;&#x6765;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x4EE5;&#x5F02;&#x5E38;&#x5B8C;&#x6210;&#x3002;&#x5728;&#x8BE5;&#x5B9E;&#x4F8B;&#x4E2D;&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x5C06;&#x9632;&#x6B62;&#x5FD9;&#x7B49;&#x5F85;&#x3002;</p>
<p><strong>&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x7684;&#x5F02;&#x6B65; I/O &#x793A;&#x4F8B;</strong></p>
<p>&#x5728;&#x4F60;&#x4EEC;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x4EBA;&#x4E2D;&#xFF0C;&#x56DE;&#x8C03;&#x8FD9;&#x4E2A;&#x8BCD;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x53D1;&#x4E00;&#x79CD;&#x6050;&#x6016;&#x7684;&#x611F;&#x89C9;&#x3002;&#x4F46;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#xFF0C;&#x60A8;&#x7EDD;&#x4E0D;&#x4F1A;&#x88AB;&#x8FEB;&#x5728; Nim &#x4E2D;&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x3002;&#x867D;&#x7136; Future &#x516C;&#x5F00;&#x7684;&#x6700;&#x57FA;&#x672C;&#x7684;&#x901A;&#x77E5;&#x673A;&#x5236;&#x662F;&#x56DE;&#x8C03;&#xFF0C;&#x4F46; Nim &#x63D0;&#x4F9B;&#x4E86;&#x6240;&#x8C13;&#x7684;&#x5F02;&#x6B65;&#x7B49;&#x5F85;&#xFF0C;&#x5B83;&#x5411;&#x4F60;&#x9690;&#x85CF;&#x4E86;&#x8FD9;&#x4E9B;&#x56DE;&#x8C03;&#x3002;&#x7A0D;&#x540E;&#x60A8;&#x5C06;&#x4E86;&#x89E3;&#x6709;&#x5173;&#x5F02;&#x6B65;&#x7B49;&#x5F85;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x786E;&#x5B9E;&#x8BF4;&#x8FC7;&#x4F60;&#x4E0D;&#x4F1A;&#x88AB;&#x8FEB;&#x5728; Nim &#x4E2D;&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#xFF0C;&#x4F46;&#x6211;&#x5C06;&#x9996;&#x5148;&#x901A;&#x8FC7;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5B83;&#x5982;&#x4F55;&#x4E0E;&#x56DE;&#x8C03;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x6765;&#x89E3;&#x91CA;&#x5F02;&#x6B65; I/O&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6211;&#x76F8;&#x4FE1;&#x60A8;&#x719F;&#x6089;&#x56DE;&#x8C03;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x6BD4;&#x5F02;&#x6B65;&#x7B49;&#x5F85;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x66F4;&#x9AD8;&#x3002;&#x6211;&#x5C06;&#x9996;&#x5148;&#x5728; Node.js &#x548C; Nim &#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x8FD9;&#x79CD;&#x6BD4;&#x8F83;&#x4E0D;&#x6D89;&#x53CA;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x800C;&#x662F;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF1A;&#x5F02;&#x6B65;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.18.&#x5728;&#x8282;&#x70B9;&#x4E2D;&#x5F02;&#x6B65;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">var</span> fs = require(&apos;fs&apos;);
fs.readFile(&apos;/etc/passwd&apos;, function (err, data) {
  <span class="hljs-keyword">if</span> (err) throw err;
  console.log(data);
});
</code></pre>
<p><em>&#x6E05;&#x5355;3.18</em>&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x76F4;&#x63A5;&#x53D6;&#x81EA;Node&#x7684;&#x6587;&#x6863;[13]&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x5F02;&#x6B65;&#x8BFB;&#x53D6;/etc/passwd&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x6267;&#x884C;&#x6B64;&#x811A;&#x672C;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C; <code>readFile</code> &#x51FD;&#x6570;&#x544A;&#x8BC9;&#x8282;&#x70B9;&#x8FD0;&#x884C;&#x65F6;&#x8BFB;&#x53D6;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E2D;&#x8DEF;&#x5F84;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5728;&#x8BFB;&#x53D6;&#x5B8C;&#x6210;&#x540E;&#x8C03;&#x7528;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#x3002; <code>readFile</code> &#x51FD;&#x6570;&#x672C;&#x8EAB;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#xFF0C;&#x63A7;&#x5236;&#x6743;&#x9690;&#x5F0F;&#x8FD4;&#x56DE;&#x7ED9;Node&#x8FD0;&#x884C;&#x65F6;&#x3002;&#x73B0;&#x5728;&#x5C06;&#x5176;&#x4E0E;&#x5C3C;&#x59C6;&#x7248;&#x672C;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</p>
<p>&#x6E05;&#x5355;3.19.&#x5728;Nim&#x4E2D;&#x5F02;&#x6B65;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> asyncdispatch, asyncfile

<span class="hljs-keyword">var</span> file = openAsync(<span class="hljs-string">&quot;/etc/passwd&quot;</span>)     <span class="hljs-comment"># &lt;1&gt;</span>
<span class="hljs-keyword">let</span> dataFut = file.readAll()   <span class="hljs-comment"># &lt;2&gt;</span>
dataFut.callback =             <span class="hljs-comment"># &lt;3&gt;</span>
  <span class="hljs-keyword">proc</span> (future: <span class="hljs-type">Future</span>[<span class="hljs-built_in">string</span>]) =
    echo(future.read())        <span class="hljs-comment"># &lt;4&gt;</span>

asyncdispatch.runForever()     <span class="hljs-comment"># &lt;4&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x5F02;&#x6B65;&#x6253;&#x5F00;/etc/passwd&#x6587;&#x4EF6;&#x5E76;&#x5C06;&#x5176;&#x7ED1;&#x5B9A;&#x5230; <code>file</code> &#x53D8;&#x91CF;&#x3002;</1></p>
<p><2>    &#x8981;&#x6C42;&#x8BFB;&#x53D6; <code>file</code> &#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x5C06;&#x751F;&#x6210;&#x7684; <code>Future[string]</code> &#x7C7B;&#x578B;&#x5206;&#x914D;&#x7ED9; <code>dataFut</code> &#x53D8;&#x91CF;&#x3002;</2></p>
<p><3>    &#x5206;&#x914D;&#x8981;&#x5728;&#x5C06;&#x6765;&#x5B8C;&#x6210;&#x65F6;&#x8C03;&#x7528;&#x7684;&#x65B0;&#x56DE;&#x8C03;&#x3002;</3></p>
<p><4>    &#x5728;&#x56DE;&#x8C03;&#x4E2D;&#xFF0C;&#x8BFB;&#x53D6;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5B58;&#x5728;&#x7684;&#x672A;&#x6765;&#x5185;&#x5BB9;&#x3002;</4></p>
<p><5>    &#x663E;&#x5F0F;&#x8FD0;&#x884C; <code>asyncdispatch</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002;</5></p>
</blockquote>
<p>Nim&#x7248;&#x672C;&#x4E00;&#x5F00;&#x59CB;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;Nim&#x7684;&#x6807;&#x51C6;&#x5E93;&#x4E0D;&#x50CF;Node&#x7684;&#x6807;&#x51C6;&#x5E93;&#x90A3;&#x6837;&#x5B9A;&#x4E49;&#x5355;&#x4E2A; <code>readFile</code> &#x8FC7;&#x7A0B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x4F7F;&#x7528; <code>openAsync</code> &#x8FC7;&#x7A0B;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x4EE5;&#x83B7;&#x53D6; <code>AsyncFile</code> &#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x4ECE;&#x8BE5;&#x5BF9;&#x8C61;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;[14]</p>
<p>&#x9664;&#x4E86;&#x6807;&#x51C6;&#x5E93;API&#x7684;&#x5DEE;&#x5F02;&#x4E4B;&#x5916;&#xFF0C;Nim&#x7248;&#x672C;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x9762;&#x4E5F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1A; <code>readAll</code> &#x8FC7;&#x7A0B;&#x4E0D;&#x63A5;&#x53D7;&#x56DE;&#x8C03;&#xFF0C;&#x800C;&#x662F;&#x8FD4;&#x56DE; <code>Future</code> &#x7C7B;&#x578B;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#x3002;&#x7136;&#x540E;&#x5C06;&#x56DE;&#x8C03;&#x5B58;&#x50A8;&#x5728; <code>Future</code> &#x4E2D;&#xFF0C;&#x5E76;&#x5728;&#x672A;&#x6765;&#x5B8C;&#x6210;&#x540E;&#x8C03;&#x7528;&#x3002;</p>
<p><strong>&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;</strong></p>
<p>&#x5728;Node&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x662F;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x7684;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;API&#x6765;&#x68C0;&#x67E5;&#x5404;&#x79CD;&#x4E8B;&#x4EF6;&#x3002;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x5728;&#x6210;&#x529F;&#x8BFB;&#x53D6;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4ECE;&#x8FDE;&#x63A5;&#x5230;&#x7684;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x6570;&#x636E;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x8FD0;&#x884C;&#x65F6;&#x4F1A;&#x5C06;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x5206;&#x6D3E;&#x7ED9;&#x76F8;&#x5E94;&#x7684;&#x56DE;&#x8C03;&#x3002;Nim&#x7684;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x662F;&#x5728; <code>asyncdispatch</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5B83;&#x5728;&#x8BB8;&#x591A;&#x65B9;&#x9762;&#x4E0E;Node&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x76F8;&#x4F3C;&#xFF0C;&#x53EA;&#x662F;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x6267;&#x884C;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x8C03;&#x7528; <code>runForever</code> &#x8FC7;&#x7A0B;<em>&#x4E0B;&#x56FE;3.19</em>&#x663E;&#x793A;&#x4E86; <code>runForever</code> &#x8FC7;&#x7A0B;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x56FE;3.15.Nim&#x7684; <code>asyncdispatch</code> &#x5F02;&#x6B65;&#x8C03;&#x5EA6;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;</p>
<p><img src="Images/ch03_event_loop.png" alt="ch03 event loop"></p>
<p>Nim&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x4F7F;&#x60A8;&#x5904;&#x4E8E;&#x63A7;&#x5236;&#x72B6;&#x6001;&#x3002; <code>runForever</code> &#x8FC7;&#x7A0B;&#x53EA;&#x662F; <code>poll</code> &#x8FC7;&#x7A0B;&#x7684;&#x5305;&#x88C5;&#xFF0C; <code>runForever</code> &#x8FC7;&#x7A0B;&#x5728;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x4E2D;&#x8C03;&#x7528;&#x8BE5;&#x8FC7;&#x7A0B;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x8C03;&#x7528; <code>poll</code> &#x8F6E;&#x8BE2;&#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x63A7;&#x5236;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002; <code>poll</code> &#x8F6E;&#x8BE2;&#x8FC7;&#x7A0B;&#x7B49;&#x5F85;&#x4E8B;&#x4EF6;&#x6307;&#x5B9A;&#x7684;&#x6BEB;&#x79D2;&#x6570;&#xFF08;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;500ms&#xFF09;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x9700;&#x8981;500ms&#x624D;&#x80FD;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x4E3A;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x80FD;&#x65E9;&#x4E8E;&#x6B64;&#x3002;&#x4E00;&#x65E6;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C; <code>poll</code> &#x8F6E;&#x8BE2;&#x8FC7;&#x7A0B;&#x5C31;&#x4F1A;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002; <code>poll</code> &#x8F6E;&#x8BE2;&#x7A0B;&#x5E8F;&#x968F;&#x540E;&#x4F1A;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x5F53;&#x524D;&#x6302;&#x8D77;&#x7684;  <code>Future</code> &#x5BF9;&#x8C61;&#xFF0C;&#x4EE5;&#x67E5;&#x770B;  <code>Future</code> &#x662F;&#x5426;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x8BE5;&#x4E8B;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x662F;&#xFF0C;&#x5219;&#x8C03;&#x7528; <code>Future</code> &#x7684;&#x56DE;&#x8C03;&#xFF0C;&#x5E76;&#x586B;&#x5145;&#x5B58;&#x50A8;&#x5728;Future&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x9002;&#x5F53;&#x503C;&#x3002;</p>
<p>&#x4E0E;&#x540C;&#x6B65;I/O&#x53EF;&#x4EE5;&#x963B;&#x585E;&#x65E0;&#x9650;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x540C;&#xFF0C; <code>poll</code> &#x8F6E;&#x8BE2;&#x8FC7;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x963B;&#x585E;&#xFF0C;&#x4F46;&#x4EC5;&#x9650;&#x4E8E;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x6307;&#x5B9A;&#x7684;&#x6709;&#x9650;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x60A8;&#x5C06;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x7528;&#x4E8E;I/O&#x5904;&#x7406;&#xFF0C;&#x5176;&#x4F59;&#x65F6;&#x95F4;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#xFF0C;&#x5982;&#x7ED8;&#x5236;GUI&#x6216;&#x6267;&#x884C;CPU&#x5BC6;&#x96C6;&#x578B;&#x8BA1;&#x7B97;&#x3002;&#x7A0D;&#x540E;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5728; <code>client</code> &#x5BA2;&#x6237;&#x7AEF;&#x6A21;&#x5757;&#x4E2D;&#x4F7F;&#x7528;&#x6B64;&#x8FC7;&#x7A0B;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C06;&#x5F02;&#x6B65;&#x5957;&#x63A5;&#x5B57;&#x4E0E;&#x8BFB;&#x53D6;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x7684; <code>readLine</code> &#x8FC7;&#x7A0B;&#x6DF7;&#x5408;&#x4F7F;&#x7528;&#x3002;</p>
<p><strong>&#x5F02;&#x6B65;&#x7B49;&#x5F85;</strong></p>
<p>&#x5BF9;&#x5F02;&#x6B65;I/O&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x95EE;&#x9898;&#x3002;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;&#xFF0C;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x7075;&#x6D3B;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x4E2A;&#x6070;&#x5F53;&#x7684;&#x540D;&#x79F0;&#x2014;&#x2014;<em>&#x56DE;&#x8C03;&#x5730;&#x72F1;</em>&#x3002;&#x8BA9;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x7528;&#x4F8B;&#x6765;&#x8BF4;&#x660E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5047;&#x8BBE;&#x60A8;&#x60F3;&#x5728;&#x8BFB;&#x53D6;&#x7B2C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E4B;&#x540E;&#x8BFB;&#x53D6;&#x53E6;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x5D4C;&#x5957;&#x56DE;&#x8C03;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x4E11;&#x964B;&#x4E14;&#x65E0;&#x6CD5;&#x7EF4;&#x62A4;&#x3002;</p>
<p>Nim&#x6709;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x5C31;&#x662F; <code>await</code> &#x5173;&#x952E;&#x5B57;&#x3002; <code>await</code> &#x5173;&#x952E;&#x5B57;&#x53EA;&#x80FD;&#x5728;&#x6807;&#x8BB0;&#x4E3A;{.async.}&#x7F16;&#x8BD1;&#x6807;&#x5FD7;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x4E86;&#x56DE;&#x8C03;&#x5730;&#x72F1;&#xFF0C;&#x4F7F;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#x51E0;&#x4E4E;&#x4E0E;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x76F8;&#x540C;<em>&#x4E0B;&#x9762;&#x7684;&#x6E05;&#x5355;3.20</em>&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4F7F;&#x7528; <code>async</code> &#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6E05;&#x5355;3.20.&#x4F7F;&#x7528;await&#x4F9D;&#x6B21;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x548C;&#x5199;&#x5165;&#x6587;&#x4EF6;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> asyncdispatch, asyncfile

<span class="hljs-keyword">proc</span> readFiles() <span class="hljs-meta">{.async.}</span> =          <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">var</span> file = openAsync(<span class="hljs-string">&quot;~/test.txt&quot;</span>, fmReadWrite)     <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-keyword">let</span> data = await file.readAll()     <span class="hljs-comment"># &lt;3&gt;</span>
  echo(data)            <span class="hljs-comment"># &lt;4&gt;</span>
  await file.write(<span class="hljs-string">&quot;Hello!\n&quot;</span>)        <span class="hljs-comment"># &lt;4&gt;</span>

waitFor readFiles()     <span class="hljs-comment"># &lt;6&gt;</span>
</code></pre>
<blockquote>
<p><1>    {.async.}&#x7528;&#x4E8E;&#x6307;&#x5B9A; <code>readFile</code> &#x8FC7;&#x7A0B;&#x662F;&#x5F02;&#x6B65;&#x7684;&#x3002;</1></p>
<p><2>    &#x4EE5; <code>fmReadWrite</code> &#x6A21;&#x5F0F;&#x5F02;&#x6B65;&#x6253;&#x5F00;~/test.txt&#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;</2></p>
<p><3>    &#x6587;&#x4EF6;&#x5DF2;&#x5B8C;&#x5168;&#x8BFB;&#x53D6;&#xFF0C;&#x6B64;&#x5904;&#x4F7F;&#x7528;&#x7684; <code>await</code> &#x5173;&#x952E;&#x5B57;&#x8868;&#x793A;&#x5E94;&#x6682;&#x505C; <code>readFiles</code> &#xFF0C;&#x76F4;&#x5230;&#x6587;&#x4EF6;&#x5B8C;&#x5168;&#x8BFB;&#x53D6;&#x3002;</3></p>
<p><4>    &#x663E;&#x793A;&#x6587;&#x4EF6;&#x7684;&#x5185;&#x5BB9;&#x3002;</4></p>
<p><5>    &#x4E5F;&#x5411;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x3002;&#x8BE5;&#x8FC7;&#x7A0B;&#x5C06;&#x6682;&#x505C;&#xFF0C;&#x76F4;&#x5230;&#x6570;&#x636E;&#x6210;&#x529F;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;</5></p>
<p><6>    &#x8FD0;&#x884C;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#xFF0C;&#x76F4;&#x5230; <code>readFile</code> &#x5B8C;&#x6210;&#x3002;</6></p>
</blockquote>
<p><em>&#x6E05;&#x5355;3.20</em>&#x6267;&#x884C;&#x4E86;&#x4E0E;&#x6E05;&#x5355;3.19*&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x548C;&#x66F4;&#x591A;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x6BCF;&#x6B21;&#x4F7F;&#x7528; <code>await</code> &#x5173;&#x952E;&#x5B57;&#x65F6;&#xFF0C; <code>readFiles</code> &#x8FC7;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x90FD;&#x4F1A;&#x6682;&#x505C;&#xFF0C;&#x76F4;&#x5230;&#x7B49;&#x5F85;&#x7684; <code>Future</code> &#x5B8C;&#x6210;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x8FC7;&#x7A0B;&#x6062;&#x590D;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x81EA;&#x52A8;&#x8BFB;&#x53D6;&#x672A;&#x6765;&#x7684;&#x503C;&#x3002;&#x5F53;&#x8FC7;&#x7A0B;&#x6682;&#x505C;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x7EBF;&#x7A0B;&#x4E0D;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#x3002;&#x8FD9;&#x90FD;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#x591A;&#x4E2A;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#xFF0C;&#x7B49;&#x5F85;&#x4E8B;&#x4EF6;&#x6062;&#x590D;&#x5B83;&#x4EEC;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x540E;&#x53F0;&#x4F7F;&#x7528;&#x56DE;&#x8C03;&#x6765;&#x6062;&#x590D;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x6807;&#x8BB0;&#x4E3A;{.async.} &#x7F16;&#x8BD1;&#x6307;&#x793A;&#x7684;&#x6BCF;&#x4E2A;&#x8FC7;&#x7A0B;&#x90FD;&#x5FC5;&#x987B;&#x8FD4;&#x56DE; <code>Future[T]</code> &#x5BF9;&#x8C61;&#x3002;&#x5728;<em>&#x6E05;&#x5355;3.20</em>&#x4E2D;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x8FD4;&#x56DE;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x8FD4;&#x56DE;&#x4E86;&#x4E00;&#x4E2A; <code>Future[void]</code> &#xFF0C;&#x8FD9;&#x662F;&#x9690;&#x5F0F;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x4E00;&#x76F4;&#x5199; <code>Future[void]</code> &#x7684;&#x75DB;&#x82E6;&#x3002;&#x53EF;&#x4EE5;&#x7B49;&#x5F85;&#x8FD4;&#x56DE; <code>Future[T]</code> &#x7684;&#x4EFB;&#x4F55;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><em>&#x4E0B;&#x9762;&#x7684;&#x56FE;3.20</em>&#x663E;&#x793A;&#x4E86;<em>&#x6E05;&#x5355;3.20</em>&#x7684;&#x6267;&#x884C;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x56FE;3.16.<em>&#x6E05;&#x5355;3.20&#x7684;&#x6267;&#x884C;</em></p>
<p><img src="Images/ch03_async_await_execution.png" alt="ch03 async await execution"></p>
<p>&#x4F7F;&#x7528; <code>waitFor</code> &#x8FC7;&#x7A0B;&#x800C;&#x4E0D;&#x662F; <code>runForever</code> &#x8FD0;&#x884C;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#xFF0C;&#x76F4;&#x5230; <code>readFiles</code> &#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x6267;&#x884C;<em>&#x4E0B;&#x9762;&#x7684;&#x8868;3.2</em>&#x663E;&#x793A;&#x4E86;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x60A8;&#x770B;&#x5230;&#x7684;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x5F02;&#x6B65;&#x5173;&#x952E;&#x5B57;&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x8F83;&#x3002;</p>
<p>&#x8868; 3.2.&#x5E38;&#x89C1;&#x5F02;&#x6B65;&#x5173;&#x952E;&#x5B57;&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x8F83;</p>
<table>
<thead>
<tr>
<th>&#x7A0B;&#x5E8F;</th>
<th>&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;</th>
<th>&#x7528;&#x4F8B;</th>
<th>&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>runForever</code></td>
<td>Yes</td>
<td>&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x9700;&#x8981;&#x65E0;&#x9650;&#x671F;&#x4FDD;&#x6301;&#x6D3B;&#x52A8;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</td>
<td>&#x6C38;&#x4E45;&#x8FD0;&#x884C;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002;</td>
</tr>
<tr>
<td><code>waitFor</code></td>
<td>Yes</td>
<td>&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x5728;&#x7279;&#x5B9A;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x6267;&#x884C;&#x540E;&#x9700;&#x8981;&#x9000;&#x51FA;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;</td>
<td>&#x8FD0;&#x884C;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#xFF0C;&#x76F4;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x672A;&#x6765;&#x5B8C;&#x6210;&#x3002;</td>
</tr>
<tr>
<td><code>poll</code></td>
<td>Yes</td>
<td>&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x7CBE;&#x786E;&#x63A7;&#x5236;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002; <code>runForever</code> &#x548C; <code>waitFor</code> &#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x6B64;&#x8FC7;&#x7A0B;&#x3002;</td>
<td>&#x5728;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x4FA6;&#x542C;&#x4E8B;&#x4EF6;&#x3002;</td>
</tr>
<tr>
<td><code>asyncCheck</code></td>
<td>No</td>
<td>&#x5B89;&#x5168;&#x4E22;&#x5F03;&#x672A;&#x6765;&#x3002;&#x901A;&#x5E38;&#x6267;&#x884C;&#x5F02;&#x6B65;&#x8FDB;&#x7A0B;&#x800C;&#x4E0D;&#x5173;&#x5FC3;&#x5176;&#x7ED3;&#x679C;&#x3002;</td>
<td>&#x5C06;&#x6307;&#x5B9A;&#x672A;&#x6765;&#x7684;&#x56DE;&#x8C03;&#x5C5E;&#x6027;&#x8BBE;&#x7F6E;&#x4E3A;&#x5C06;&#x9002;&#x5F53;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</td>
</tr>
<tr>
<td><code>await</code></td>
<td>No</td>
<td>&#x7528;&#x4E8E;&#x6267;&#x884C;&#x53E6;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x8FDB;&#x7A0B;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x9700;&#x8981;&#x5728; <code>await</code> &#x4E4B;&#x540E;&#x7684;&#x4EE3;&#x7801;&#x884C;&#x4E2D;&#x3002;</td>
<td>&#x6682;&#x505C;&#x5F02;&#x6B65;&#x8FDB;&#x7A0B;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x672A;&#x6765;&#x5B8C;&#x6210;&#x3002;</td>
</tr>
</tbody>
</table>
<blockquote>
<p>[&#x8B66;&#x544A;]    &#x63A7;&#x5236;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x7684;&#x8FC7;&#x7A0B;
&#x901A;&#x5E38;&#xFF0C;&#x5728;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x5E94;&#x4F7F;&#x7528; <code>runForever</code> &#x3001; <code>waitFor</code> &#x548C; <code>poll</code> &#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x76F4;&#x63A5;&#x63A7;&#x5236;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002;</p>
</blockquote>
<h2 id="353-&#x5F02;&#x6B65;&#x4F20;&#x8F93;&#x6570;&#x636E;">3.5.3 &#x5F02;&#x6B65;&#x4F20;&#x8F93;&#x6570;&#x636E;</h2>
<p>&#x60A8;&#x5DF2;&#x7ECF;&#x521D;&#x59CB;&#x5316;&#x4E86;&#x5F02;&#x6B65;&#x5957;&#x63A5;&#x5B57;&#x5E76;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x5728; <code>server</code> &#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5C06;&#x5957;&#x63A5;&#x5B57;&#x7ED1;&#x5B9A;&#x5230;&#x7AEF;&#x53E3;&#xFF0C;&#x5982; <code>7687</code> &#x3002;[15]</li>
<li>&#x5728;&#x5957;&#x63A5;&#x5B57;&#x4E0A;&#x8C03;&#x7528; <code>listen</code> &#x4EE5;&#x5F00;&#x59CB;&#x4FA6;&#x542C;&#x65B0;&#x8FDE;&#x63A5;&#x3002;</li>
<li>&#x901A;&#x8FC7; <code>accept</code> &#x8FC7;&#x7A0B;&#x5F00;&#x59CB;&#x63A5;&#x53D7;&#x8FDE;&#x63A5;&#x3002;</li>
</ul>
<p>&#x60A8;&#x9700;&#x8981;&#x4F7F;&#x7528; <code>await</code> &#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x663E;&#x793A;&#x4E86;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x7684; <code>loop</code> &#x5FAA;&#x73AF;&#x8FC7;&#x7A0B;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> loop(server: <span class="hljs-type">Server</span>, port = <span class="hljs-number">7687</span>) <span class="hljs-meta">{.async.}</span> =
  server.socket.bindAddr(port.<span class="hljs-type">Port</span>)     <span class="hljs-comment"># &lt;1&gt;</span>
  server.socket.listen()

  <span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
    <span class="hljs-keyword">let</span> clientSocket = await server.socket.accept()     <span class="hljs-comment"># &lt;2&gt;</span>
    echo(<span class="hljs-string">&quot;Accepted connection!&quot;</span>)

waitFor loop(server)     <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x901A;&#x8FC7;&#x5C06;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x7ED1;&#x5B9A;&#x5230;&#x7AEF;&#x53E3;&#x5E76;&#x8C03;&#x7528; <code>listen</code> &#x6765;&#x8BBE;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x6574;&#x6570; <code>port</code> &#x53C2;&#x6570;&#x9700;&#x8981;&#x5F3A;&#x5236;&#x8F6C;&#x6362;&#x4E3A; <code>bindAddr</code> &#x8FC7;&#x7A0B;&#x6240;&#x9700;&#x7684; <code>port</code> &#x7C7B;&#x578B;&#x3002;</1></p>
<p><2> &#x5728;&#x670D;&#x52A1;&#x5668;&#x5957;&#x63A5;&#x5B57;&#x4E0A;&#x8C03;&#x7528; <code>accept</code> &#x4EE5;&#x63A5;&#x53D7;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x3002; <code>await</code> &#x5173;&#x952E;&#x5B57;&#x786E;&#x4FDD;&#x5728;&#x8FDE;&#x63A5;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x524D;&#x6682;&#x505C;&#x8FC7;&#x7A0B;&#x3002;</2></p>
<p><3> &#x6267;&#x884C; <code>loop</code>  &#x8FC7;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x884C;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#xFF0C;&#x76F4;&#x5230; <code>loop</code>  &#x7A0B;&#x5E8F;&#x8FD4;&#x56DE;&#x3002;</3></p>
</blockquote>
<p> <code>loop</code> &#x8FC7;&#x7A0B;&#x5C06;&#x6301;&#x7EED;&#x7B49;&#x5F85;&#x5EFA;&#x7ACB;&#x65B0;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x8FD9;&#x4E9B;&#x8FDE;&#x63A5;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x8BA9;&#x6211;&#x4EEC;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#x8FD9;&#x662F;&#x5426;&#x6709;&#x6548;&#x3002;&#x5C06;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x5230; <code>server.nim</code> &#x7684;&#x5E95;&#x90E8;&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x8FD0;&#x884C; <code>nim c -r src/server</code> &#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p><strong>&#x6D4B;&#x8BD5;&#x6CA1;&#x6709;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x670D;&#x52A1;&#x5668;</strong></p>
<p>&#x6D4B;&#x8BD5;&#x8FD9;&#x4E00;&#x70B9;&#x6709;&#x70B9;&#x68D8;&#x624B;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x540D;&#x4E3A; <code>telnet</code> &#x7684;&#x547D;&#x4EE4;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDE;&#x63A5;&#x5230;&#x65B0;&#x670D;&#x52A1;&#x5668;&#x76F8;&#x5F53;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x5728;Windows&#x4E0A;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;Windows&#x529F;&#x80FD;&#x83DC;&#x5355;&#x4E2D;&#x542F;&#x7528;&#x5B83;&#xFF0C;&#x6709;&#x5173;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE;&#x4EE5;&#x4E0B;&#x94FE;&#x63A5;&#xFF1A;<a href="http://windows.microsoft.com/en-gb/windows/telnet-faq" target="_blank">http://windows.microsoft.com/en-gb/windows/telnet-faq</a>. &#x5B89;&#x88C5;&#x540E;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x547D;&#x4EE4;&#x7A97;&#x53E3;&#xFF0C;&#x5728;&#x63D0;&#x793A;&#x7B26;&#x4E2D;&#x952E;&#x5165; <code>telnet</code> &#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x6267;&#x884C; <code>open localhost 7687</code> &#x547D;&#x4EE4;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;&#x7136;&#x540E;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x8F93;&#x51FA;Accepted connection&#xFF01;&#x3002;</p>
<p>&#x5728;&#x7C7B;Unix&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;Linux&#x548C;Mac OS X&#xFF09;&#x4E0A;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B; <code>telnet</code> &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x53EF;&#x7528;&#x3002;&#x60A8;&#x53EA;&#x9700;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x5E76;&#x6267;&#x884C; <code>telnet localhost 7687</code> &#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x4F1A;&#x8F93;&#x51FA;Accepted connection&#xFF01;&#x3002;</p>
<p><strong>&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5B9E;&#x4F8B;&#x4EE5;&#x4FDD;&#x5B58;&#x6709;&#x5173;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6570;&#x636E;</strong></p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6269;&#x5C55; <code>loop</code> &#x8FC7;&#x7A0B;&#x4EE5;&#x521B;&#x5EFA;&#x65B0;&#x7684;  <code>Client</code>  &#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230; <code>clients</code> &#x5B57;&#x6BB5;&#x4E2D;&#x3002;&#x7528;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x66FF;&#x6362; <code>while</code> &#x5FAA;&#x73AF;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
  <span class="hljs-keyword">let</span> (netAddr, clientSocket) = await server.socket.acceptAddr()     <span class="hljs-comment"># &lt;1&gt;</span>
  echo(<span class="hljs-string">&quot;Accepted connection from &quot;</span>, netAddr)     <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-keyword">let</span> client = <span class="hljs-type">Client</span>(     <span class="hljs-comment"># &lt;3&gt;</span>
    socket: clientSocket,
    netAddr: netAddr,
    id: server.clients.len,
    connected: <span class="hljs-literal">true</span>
  )
  server.clients.add(client)     <span class="hljs-comment"># &lt;4&gt;</span>
</code></pre>
<blockquote>
<p><1>     <code>acceptAddr</code>  &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7C7B;&#x578B; <code>tuple[string, AsyncSocket]</code>  &#xFF0C;&#x5143;&#x7EC4;&#x89E3;&#x6784;&#x4E3A;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x3002;</1></p>
<p><2>    &#x5C06;&#x663E;&#x793A;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x6307;&#x51FA;&#x5BA2;&#x6237;&#x7AEF;&#x5DF2;&#x8FDE;&#x63A5;&#x53CA;&#x5176;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#x3002;</2></p>
<p><3>    &#x521D;&#x59CB;&#x5316; <code>Client</code> &#x5BF9;&#x8C61;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#x5E76;&#x76F8;&#x5E94;&#x5730;&#x8BBE;&#x7F6E;&#x5176;&#x5B57;&#x6BB5;&#x3002;</3></p>
<p><4>    &#x6700;&#x540E;&#xFF0C;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#x6DFB;&#x52A0;&#x5230; <code>clients</code> &#x5E8F;&#x5217;&#x4E2D;&#x3002;</4></p>
</blockquote>
<p> <code>accept</code> &#x8FC7;&#x7A0B;&#x7684;&#x53D8;&#x4F53;&#x5DF2;&#x66F4;&#x6539;&#x4E3A;&#x8FD8;&#x8FD4;&#x56DE;&#x5DF2;&#x8FDE;&#x63A5;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7684;IP&#x5730;&#x5740;&#x7684;&#x53D8;&#x4F53;&#x3002; <code>acceptAddr</code> &#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5143;&#x7EC4;&#xFF0C;&#x5176;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x7684;IP&#x5730;&#x5740;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x503C;&#x662F;&#x5BA2;&#x6237;&#x673A;&#x5957;&#x63A5;&#x5B57;&#x3002;&#x4E0A;&#x9762;&#x7684;&#x5217;&#x8868;&#x4F7F;&#x7528;&#x4E86;<em>&#x5143;&#x7EC4;&#x89E3;&#x5305;</em>&#xFF0C;&#x8FD9;&#x5141;&#x8BB8;&#x5C06;&#x8FD9;&#x4E24;&#x4E2A;&#x503C;&#x7ACB;&#x5373;&#x5206;&#x914D;&#x7ED9;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x6210;&#x529F;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x4E0B;&#x4E00;&#x884C;&#x5C06;&#x5411;&#x7EC8;&#x7AEF;&#x5199;&#x5165;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x521A;&#x521A;&#x8FDE;&#x63A5;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7684;IP&#x5730;&#x5740;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x4E4B;&#x540E;&#xFF0C;&#x5C06;&#x521B;&#x5EFA;  <code>Client</code> &#x5BF9;&#x8C61;&#x7684;&#x65B0;&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E3A;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x9010;&#x4E00;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5C06;&#x65B0;&#x5B9E;&#x4F8B;&#x6DFB;&#x52A0;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684; <code>clients</code> &#x5E8F;&#x5217;&#x4E2D;&#x3002;</p>
<p>&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x6B64;&#x4EE3;&#x7801;&#x5E76;&#x91CD;&#x590D;&#x4E0A;&#x9762;&#x7684;&#x6B65;&#x9AA4;&#x5E94;&#x8BE5;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x663E;&#x793A; &quot;Accepted connection from 127.0.0.1&quot;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F46;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x5F53;&#x7136;&#x8FD8;&#x4E0D;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><strong>&#x5904;&#x7406;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6D88;&#x606F;</strong></p>
<p>&#x4F7F;&#x7528; telnet &#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x4E0D;&#x4F1A;&#x6536;&#x5230;&#x5728;&#x63D0;&#x793A;&#x4E2D;&#x952E;&#x5165;&#x7684;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4ECD;&#x672A;&#x4ECE;&#x5DF2;&#x8FDE;&#x63A5;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x8BFB;&#x53D6;&#x6D88;&#x606F;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x6765;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> processMessages(server: <span class="hljs-type">Server</span>, client: <span class="hljs-type">Client</span>) <span class="hljs-meta">{.async.}</span> =
  <span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
    <span class="hljs-keyword">let</span> line = await client.socket.recvLine()     <span class="hljs-comment"># &lt;1&gt;</span>
    <span class="hljs-keyword">if</span> line.len == <span class="hljs-number">0</span>:           <span class="hljs-comment"># &lt;2&gt;</span>
      echo(client, <span class="hljs-string">&quot; disconnected!&quot;</span>)
      client.connected = <span class="hljs-literal">false</span>
      client.socket.close()     <span class="hljs-comment"># &lt;3&gt;</span>
      <span class="hljs-keyword">return</span>     <span class="hljs-comment"># &lt;4&gt;</span>

    echo(client, <span class="hljs-string">&quot; sent: &quot;</span>, line)
</code></pre>
<blockquote>
<p><1>    &#x7B49;&#x5F85;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x8BFB;&#x53D6;&#x4E00;&#x884C;&#x3002;</1></p>
<p><2>    &#x5927;&#x591A;&#x6570;&#x4ECE;&#x5957;&#x63A5;&#x5B57;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x8FD4;&#x56DE;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x8868;&#x793A;&#x5957;&#x63A5;&#x5B57;&#x5DF2;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x3002;</2></p>
<p><3>    &#x5173;&#x95ED;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5DF2;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x3002;</3></p>
<p><4>    &#x505C;&#x6B62;&#x5BF9;&#x6D88;&#x606F;&#x7684;&#x4EFB;&#x4F55;&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x3002;</4></p>
</blockquote>
<p>&#x786E;&#x4FDD;&#x5C06; <code>processMessage</code> &#x8FC7;&#x7A0B;&#x7F6E;&#x4E8E; <code>loop</code> &#x8FC7;&#x7A0B;&#x4E4B;&#x4E0A;&#x3002;&#x7A0D;&#x540E;&#xFF0C;&#x60A8;&#x5C06;&#x9700;&#x8981;&#x5728; <code>loop</code> &#x8FC7;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x6B64;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x5176;&#x5DE5;&#x4F5C;&#xFF0C;&#x6B64;&#x8FC7;&#x7A0B;&#x5FC5;&#x987B;&#x4F4D;&#x4E8E;&#x8C03;&#x7528;&#x70B9;&#x4E4B;&#x4E0A;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x5728;&#x8FC7;&#x7A0B;&#x4E3B;&#x4F53;&#x7684;&#x9876;&#x90E8;&#x770B;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7531; <code>while true</code> &#x8BED;&#x53E5;&#x8868;&#x793A;&#x7684;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x5F88;&#x5947;&#x602A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E00;&#x65E6;&#x8C03;&#x7528;&#x6B64;&#x8FC7;&#x7A0B;&#xFF0C;&#x5176;&#x6267;&#x884C;&#x5C06;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x505C;&#x6B62;&#x3002;&#x8FD9;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x4F46;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;<em>&#x5F02;&#x6B65;</em>&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;<em>&#x505C;&#x6B62;</em>&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x5728;&#x8C03;&#x7528; <code>await client.socket.recvLine()</code>  &#x65F6;&#x4F1A;<em>&#x6682;&#x505C;</em>&#x6267;&#x884C;&#x3002;</p>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x8BE5;&#x8FC7;&#x7A0B;&#x7B49;&#x5F85; <code>client.socket.recvLine()</code> &#x7684;&#x7ED3;&#x679C;&#x65F6;&#xFF0C;&#x5C06;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x6BB5;&#x3002;&#x7ED3;&#x679C;&#x5C06;&#x5305;&#x542B;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x5355;&#x4E2A;&#x6D88;&#x606F;&#x3002;&#x7531;&#x4E8E;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x6D88;&#x606F;&#x534F;&#x8BAE;&#x4F7F;&#x7528;&#x6362;&#x884C;&#x7B26;&#x4F5C;&#x4E3A;&#x5206;&#x9694;&#x7B26;&#xFF0C;&#x56E0;&#x6B64;&#x4FDD;&#x8BC1;&#x4E86;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4F1A;&#x963B;&#x6B62;&#x63A5;&#x6536;&#x5B8C;&#x6574;&#x6D88;&#x606F;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; <code>recvLine</code> &#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E0B;&#x4E00;&#x884C;&#x68C0;&#x67E5;&#x7ED3;&#x679C;&#x5B57;&#x7B26;&#x4E32;&#x957F;&#x5EA6;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x5B57;&#x7B26;&#x4E32;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x5728;&#x7EC8;&#x7AEF;&#x4E0A;&#x663E;&#x793A;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x8BF4;&#x660E;&#x5BA2;&#x6237;&#x7AEF;&#x5DF2;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x7684; <code>connected</code> &#x6807;&#x5FD7;&#x8BBE;&#x7F6E;&#x4E3A; <code>false</code> &#xFF0C;&#x5E76;&#x5728;&#x5957;&#x63A5;&#x5B57;&#x4E0A;&#x8C03;&#x7528; <code>close</code> &#x8FC7;&#x7A0B;&#x4EE5;&#x91CA;&#x653E;&#x5176;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5047;&#x8BBE;&#x5BA2;&#x6237;&#x7AEF;&#x6CA1;&#x6709;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#xFF0C;&#x5219;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x5C06;&#x663E;&#x793A;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x3002;</p>
<p>&#x518D;&#x6B21;&#x5C1D;&#x8BD5;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#x3002;&#x60A8;&#x5C06;&#x53D1;&#x73B0;&#x5B83;&#x6CA1;&#x6709;&#x7F16;&#x8BD1;&#xFF0C;&#x9519;&#x8BEF;&#x5C06;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x3002;</p>
<pre><code>server.nim(16, 54) template/generic instantiation from here
server.nim(20, 12) Error: type mismatch: got (Client)
but expected one of:
system.$(x: int)
system.$(x: seq[T])
system.$(x: cstring)
system.$(x: bool)
...
</code></pre><p>&#x8FD9;&#x662F;&#x56E0;&#x4E3A; <code>echo(client, &quot; disconnected!&quot;)</code>  &#x884C;&#x8BD5;&#x56FE;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x663E;&#x793A; <code>client</code> &#x7C7B;&#x578B;&#x3002;&#x95EE;&#x9898;&#x662F; <code>echo</code> &#x8FC7;&#x7A0B;&#x8BD5;&#x56FE;&#x4F7F;&#x7528; <code>$</code> &#x8FD0;&#x7B97;&#x7B26;&#x6765;&#x663E;&#x793A;&#x5176;&#x6240;&#x6709;&#x53C2;&#x6570;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E3A;&#x4F20;&#x9012;&#x7ED9; <code>echo</code> &#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49; <code>$</code> &#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5219;&#x4F1A;&#x6536;&#x5230;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E0A;&#x9762;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5B9A;&#x4E49;&#x5B83;&#x3002;</p>
<p> <code>server.nim</code> &#x7684;&#x5B8C;&#x6574;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> asyncdispatch, asyncnet

<span class="hljs-keyword">type</span>
  <span class="hljs-type">Client</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>
    socket: <span class="hljs-type">AsyncSocket</span>
    netAddr: <span class="hljs-built_in">string</span>
    id: <span class="hljs-built_in">int</span>
    connected: <span class="hljs-built_in">bool</span>

  <span class="hljs-type">Server</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>
    socket: <span class="hljs-type">AsyncSocket</span>
    clients: <span class="hljs-built_in">seq</span>[<span class="hljs-type">Client</span>]

<span class="hljs-keyword">proc</span> newServer(): <span class="hljs-type">Server</span> = <span class="hljs-type">Server</span>(socket: newAsyncSocket(), clients: @[])

**<span class="hljs-keyword">proc</span> `$`(client: <span class="hljs-type">Client</span>): <span class="hljs-built_in">string</span> =**
  **$client.id &amp; <span class="hljs-string">&quot;(&quot;</span> &amp; client.netAddr &amp; <span class="hljs-string">&quot;)&quot;</span>**

<span class="hljs-keyword">proc</span> processMessages(server: <span class="hljs-type">Server</span>, client: <span class="hljs-type">Client</span>) <span class="hljs-meta">{.async.}</span> =
  <span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
    <span class="hljs-keyword">let</span> line = await client.socket.recvLine()
    <span class="hljs-keyword">if</span> line.len == <span class="hljs-number">0</span>:
      echo(client, <span class="hljs-string">&quot; disconnected!&quot;</span>)
      client.connected = <span class="hljs-literal">false</span>
      client.socket.close()
      <span class="hljs-keyword">return</span>

    echo(client, <span class="hljs-string">&quot; sent: &quot;</span>, line)

<span class="hljs-keyword">proc</span> loop(server: <span class="hljs-type">Server</span>, port = <span class="hljs-number">7687</span>) <span class="hljs-meta">{.async.}</span> =
  server.socket.bindAddr(port.<span class="hljs-type">Port</span>)
  server.socket.listen()

  <span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
    <span class="hljs-keyword">let</span> (netAddr, clientSocket) = await server.socket.acceptAddr()
    echo(<span class="hljs-string">&quot;Accepted connection from &quot;</span>, netAddr)
    <span class="hljs-keyword">let</span> client = <span class="hljs-type">Client</span>(
      socket: clientSocket,
      netAddr: netAddr,
      id: server.clients.len,
      connected: <span class="hljs-literal">true</span>
    )
    server.clients.add(client)
    **asyncCheck processMessages(server, client)**

<span class="hljs-keyword">var</span> server = newServer()
waitFor loop(server)
</code></pre>
<p>&#x8BE5;&#x4EE3;&#x7801;&#x73B0;&#x5728;&#x5305;&#x62EC; <code>Client</code> &#x7C7B;&#x578B;&#x7684; <code>$</code> &#x5B9A;&#x4E49;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C; <code>processMessages</code> &#x8FC7;&#x7A0B;&#x7684; <code>asyncCheck</code> &#x547D;&#x4EE4;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x7C97;&#x4F53;&#x3002; <code>asyncCheck</code> &#x547D;&#x4EE4;&#x53EF;&#x7528;&#x4E8E;&#x8FD0;&#x884C;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7B49;&#x5F85;&#x5176;&#x7ED3;&#x679C;&#x3002;&#x8BE5;&#x4EE3;&#x7801;&#x5C06;&#x4E3A;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528; <code>processMessages</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x9700;&#x8981;&#x505A;&#x7684;&#x3002;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x9700;&#x8981;&#x8FDE;&#x7EED;&#x8BFB;&#x53D6;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5176;&#x53D1;&#x9001;&#x7684;&#x4EFB;&#x4F55;&#x6D88;&#x606F;&#x90FD;&#x5F97;&#x5230;&#x5904;&#x7406;&#x3002;&#x7531;&#x4E8E;<em>async</em>&#x8FC7;&#x7A0B;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x5C06;&#x5728;&#x540E;&#x53F0;&#x5B8C;&#x6210;&#xFF0C; <code>loop</code> &#x7684;&#x6267;&#x884C;&#x5C06;&#x7EE7;&#x7EED;&#xFF0C;&#x4ECE;&#x800C;&#x51C6;&#x5907;&#x597D;&#x63A5;&#x53D7;&#x66F4;&#x591A;&#x7684;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x518D;&#x6B21;&#x91CD;&#x65B0;&#x7F16;&#x8BD1;&#x670D;&#x52A1;&#x5668;&#x6A21;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x884C;&#x5B83;&#x5E76;&#x518D;&#x6B21;&#x4F7F;&#x7528; <code>telnet</code> &#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x3002;&#x73B0;&#x5728;&#x5728;telnet&#x7A97;&#x53E3;&#x4E2D;&#x952E;&#x5165;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x6309;Enter&#x952E;&#xFF1B;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x670D;&#x52A1;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x5176;&#x4E2D;&#x663E;&#x793A;&#x4E86;&#x60A8;&#x8F93;&#x5165;&#x7684;&#x6587;&#x672C;&#x3002;</p>
<p><strong>&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;</strong></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x5C06;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x5F53;&#x524D;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x5728; <code>processMessages</code> &#x8FC7;&#x7A0B;&#x7684;&#x5E95;&#x90E8;&#x6DFB;&#x52A0;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF0C;&#x786E;&#x4FDD;&#x7F29;&#x8FDB;&#x6B64;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x5176;&#x4F4D;&#x4E8E;while&#x5FAA;&#x73AF;&#x4E2D;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">for</span> c <span class="hljs-keyword">in</span> server.clients:     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">if</span> c.id != client.id <span class="hljs-keyword">and</span> c.connected:     <span class="hljs-comment"># &lt;2&gt;</span>
    await c.socket.send(line &amp; <span class="hljs-string">&quot;\c\l&quot;</span>)      <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x5FAA;&#x73AF;&#x904D;&#x5386; <code>clients</code> &#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</1></p>
<p><2>    &#x68C0;&#x67E5;&#x5BA2;&#x6237;&#x7AEF;&#x662F;&#x5426;&#x4E0D;&#x662F;&#x53D1;&#x9001;&#x6B64;&#x6D88;&#x606F;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5E76;&#x4E14;&#x5BA2;&#x6237;&#x7AEF;&#x4ECD;&#x5904;&#x4E8E;&#x8FDE;&#x63A5;&#x72B6;&#x6001;&#x3002;</2></p>
<p><3>    &#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x540E;&#x8DDF;&#x6D88;&#x606F;&#x5206;&#x9694;&#x7B26;\c\l&#x3002;</3></p>
</blockquote>
<p>&#x4E3A;&#x5B8C;&#x6574;&#x8D77;&#x89C1;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6E05;&#x5355;&#x663E;&#x793A;&#x4E86;&#x60A8;&#x7684; <code>processMessages</code> &#x8FC7;&#x7A0B;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x3002;&#x6DFB;&#x52A0;&#x9879;&#x4EE5;&#x7C97;&#x4F53;&#x663E;&#x793A;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> processMessages(server: <span class="hljs-type">Server</span>, client: <span class="hljs-type">Client</span>) <span class="hljs-meta">{.async.}</span> =
  <span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
    <span class="hljs-keyword">let</span> line = await client.socket.recvLine()
    <span class="hljs-keyword">if</span> line.len == <span class="hljs-number">0</span>:
      echo(client, <span class="hljs-string">&quot; disconnected!&quot;</span>)
      client.connected = <span class="hljs-literal">false</span>
      client.socket.close()
      <span class="hljs-keyword">return</span>

    echo(client, <span class="hljs-string">&quot; sent: &quot;</span>, line)
    **<span class="hljs-keyword">for</span> c <span class="hljs-keyword">in</span> server.clients:**
      **<span class="hljs-keyword">if</span> c.id != client.id <span class="hljs-keyword">and</span> c.connected:**
        **await c.socket.send(line &amp; <span class="hljs-string">&quot;\c\l&quot;</span>)**
</code></pre>
<p>&#x8FD9;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#xFF01;&#x5B83;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x5E76;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x5230;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x73B0;&#x5728;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x4EE3;&#x7801;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x6216;&#x5411;&#x5176;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x6DFB;&#x52A0;&#x7F51;&#x7EDC;&#x529F;&#x80FD;</strong></p>
<p>&#x5E94;&#x8BE5;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x5B83;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5728;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x5BFC;&#x5165; <code>asyncdispatch</code> &#x548C; <code>asyncnet</code> &#x6A21;&#x5757;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x60A8;&#x8FD8;&#x9700;&#x8981;&#x5BFC;&#x5165;&#x4E4B;&#x524D;&#x521B;&#x5EFA;&#x7684; <code>protocol</code> &#x6A21;&#x5757;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>connect</code> &#x7684;&#x65B0;&#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> connect(socket: <span class="hljs-type">AsyncSocket</span>, serverAddr: <span class="hljs-built_in">string</span>) <span class="hljs-meta">{.async.}</span> =
  echo(<span class="hljs-string">&quot;Connecting to &quot;</span>, serverAddr)
  await socket.connect(serverAddr, <span class="hljs-number">7687</span>.<span class="hljs-type">Port</span>)           <span class="hljs-comment"># &lt;1&gt;</span>
  echo(<span class="hljs-string">&quot;Connected!&quot;</span>)

  <span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
    <span class="hljs-keyword">let</span> line = await socket.recvLine()     <span class="hljs-comment"># &lt;2&gt;</span>
    <span class="hljs-keyword">let</span> parsed = parseMessage(line)        <span class="hljs-comment"># &lt;3&gt;</span>
    echo(parsed.username, <span class="hljs-string">&quot; said &quot;</span>, parsed.message)     <span class="hljs-comment"># &lt;4&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x8FDE;&#x63A5;&#x5230;&#x9ED8;&#x8BA4;&#x7AEF;&#x53E3; <code>7687</code> &#x4E0A;&#x63D0;&#x4F9B;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x3002;</1></p>
<p><2>    &#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x8BFB;&#x53D6;&#x90AE;&#x4EF6;&#x3002;</2></p>
<p><3>    &#x4F7F;&#x7528; <code>protocol</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#x6765;&#x89E3;&#x6790;&#x6536;&#x5230;&#x7684;&#x6D88;&#x606F;&#x3002;</3></p>
<p><4>    &#x5C06;&#x90AE;&#x4EF6;&#x4E0E;&#x90AE;&#x4EF6;&#x53D1;&#x4EF6;&#x4EBA;&#x7684;&#x7528;&#x6237;&#x540D;&#x4E00;&#x8D77;&#x663E;&#x793A;&#x3002;</4></p>
</blockquote>
<p>&#x60A8;&#x5E94;&#x8BE5;&#x5C06;&#x6B64;&#x8FC7;&#x7A0B;&#x653E;&#x5728;&#x6587;&#x4EF6;&#x9876;&#x90E8; <code>import</code> &#x8BED;&#x53E5;&#x7684;&#x6B63;&#x4E0B;&#x65B9;&#x3002;&#x5B83;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF0C;&#x5B83;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x5F00;&#x59CB;&#x7B49;&#x5F85;&#x6765;&#x81EA;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6D88;&#x606F;&#x3002; <code>recvLine</code> &#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x4E00;&#x884C;&#x3002;&#x8FD9;&#x4E00;&#x884C;&#x968F;&#x540E;&#x88AB;&#x4F20;&#x9012;&#x7ED9; <code>parseMessage</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5141;&#x8BB8;&#x8BBF;&#x95EE;&#x6D88;&#x606F;&#x7684;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x540E;&#x5C06;&#x6D88;&#x606F;&#x4E0E;&#x4FE1;&#x4F7F;&#x7684;&#x7528;&#x6237;&#x540D;&#x4E00;&#x8D77;&#x663E;&#x793A;&#x3002;</p>
<p>&#x5728;&#x8C03;&#x7528; <code>connect</code> &#x8FC7;&#x7A0B;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>socket</code> &#x53D8;&#x91CF;&#x3002;&#x5E94;&#x4F7F;&#x7528; <code>newAsyncSocket</code> &#x8FC7;&#x7A0B;&#x521D;&#x59CB;&#x5316;&#x6B64;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x8BFB;&#x53D6; <code>serverAddr</code> &#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x4E4B;&#x540E;&#xFF0C;&#x5373;&#x5728; <code>let serverAddr = paramStr(1)</code> &#x884C;&#x4E4B;&#x540E;&#x5B9A;&#x4E49;&#x5B83;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x5B8C;&#x6210;&#x6280;&#x5DE7; <code>var socket = newAsyncSocket()</code> &#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x7528;&#x5BF9; <code>connect</code> ,&#x7684;&#x8C03;&#x7528;&#x66FF;&#x6362; <code>echo(&quot;Connecting to &quot;, serverAddr)</code> &#xFF0C;&#x4F7F;&#x7528; <code>asyncCheck</code>  &#x8FC7;&#x7A0B;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x5B83;&#xFF1A; <code>asyncCheck connect(socket, serverAddr)</code> &#x3002;</p>
<p>&#x73B0;&#x5728;&#x662F;&#x65F6;&#x5019;&#x5B8C;&#x6210;&#x5728; <code>client.nim</code> &#x4E2D;&#x8FDB;&#x884C;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8BFB;&#x53D6;&#x6240;&#x9700;&#x7684;&#x66F4;&#x6539;&#x4E86;&#x3002;&#x5F53;&#x524D;&#xFF0C;&#x8BFB;&#x53D6;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x7684;while&#x5FAA;&#x73AF;&#x4ECD;&#x7136;&#x963B;&#x585E;&#x3002;&#x4F46;&#x4E3A;&#x4E86;&#x4F7F; <code>connect</code> &#x5F02;&#x6B65;&#x8FC7;&#x7A0B;&#x5DE5;&#x4F5C;&#xFF0C;&#x9700;&#x8981;&#x6267;&#x884C;&#x5F02;&#x6B65;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002;&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9700;&#x8981;&#x4FEE;&#x6539;while&#x5FAA;&#x73AF;&#x4EE5;&#x5C06;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8BFB;&#x6570;&#x4E0E;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x96C6;&#x6210;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x7528;&#x5B83;&#x66FF;&#x6362; <code>client.nim</code> &#x4E2D;&#x7684;while&#x5FAA;&#x73AF;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">var</span> messageFlowVar = spawn <span class="hljs-literal">stdin</span>.readLine()     <span class="hljs-comment"># &lt;1&gt;</span>
<span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
  <span class="hljs-keyword">if</span> messageFlowVar.isReady():          <span class="hljs-comment"># &lt;2&gt;</span>
    <span class="hljs-keyword">let</span> message = createMessage(<span class="hljs-string">&quot;Anonymous&quot;</span>, ^messageFlowVar)     <span class="hljs-comment"># &lt;3&gt;</span>
    asyncCheck socket.send(message)     <span class="hljs-comment"># &lt;4&gt;</span>
    messageFlowVar = spawn <span class="hljs-literal">stdin</span>.readLine()     <span class="hljs-comment"># &lt;4&gt;</span>

  asyncdispatch.poll()     <span class="hljs-comment"># &lt;6&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x521D;&#x59CB; <code>readLine</code> &#x8C03;&#x7528;&#x5DF2;&#x79FB;&#x51FA; while &#x5FAA;&#x73AF;&#x3002;</1></p>
<p><2>     <code>isReady</code> &#x8FC7;&#x7A0B;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x4F1A;&#x963B;&#x6B62;&#x4ECE; <code>messageFlowVar</code> &#x8BFB;&#x53D6;&#x503C;&#x3002;</2></p>
<p><3>    &#x4F7F;&#x7528; <code>protocol</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>createMessage</code> &#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x65B0;&#x6D88;&#x606F;&#x3002;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x540D;&#x662F;&#x7559;&#x7ED9;&#x8BFB;&#x8005;&#x7684;&#x7EC3;&#x4E60;&#x3002;</3></p>
<p><4>    &#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BF7;&#x4E3A;&#x60A8; <code>createMessage</code> &#x6DFB;&#x52A0;&#x5206;&#x9694;&#x7B26;&#x3002;</4></p>
<p><5>    &#x518D;&#x6B21;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x751F;&#x6210; <code>readLine</code> &#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5DF2;&#x8FD4;&#x56DE;&#x6570;&#x636E;&#x3002;</5></p>
<p><6>    &#x4F7F;&#x7528;&#x8BE5;&#x8FC7;&#x7A0B;&#x624B;&#x52A8;&#x8C03;&#x7528; <code>poll</code> &#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x3002;</6></p>
</blockquote>
<p>&#x5DF2;&#x4FEE;&#x6539; <code>readLine</code> &#x6D3E;&#x751F;&#x8C03;&#x7528;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x5728;&#x6570;&#x767E;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x591A;&#x6B21;&#x6267;&#x884C; <code>readLine</code> &#x8FC7;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x6D3E;&#x751F;&#x8C03;&#x7528;&#x653E;&#x7F6E;&#x5728;while&#x8BED;&#x53E5;&#x4E2D;&#xFF0C;&#x5219;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x518D;&#x540C;&#x6B65;&#x8BFB;&#x53D6; <code>messageFlowVar</code> &#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4E00;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A; <code>readLine</code> &#x5728;&#x5355;&#x72EC;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x3002;while&#x5FAA;&#x73AF;&#x4F7F;&#x7528; <code>isReady</code> &#x8FC7;&#x7A0B;&#x68C0;&#x67E5; <code>readLine</code> &#x8FC7;&#x7A0B;&#x662F;&#x5426;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8FD4;&#x56DE;&#x4E86;&#x65B0;&#x8BFB;&#x53D6;&#x7684;&#x503C;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5219;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x518D;&#x6B21;&#x751F;&#x6210; <code>readLine</code> &#x8FC7;&#x7A0B;&#x3002;&#x53C2;&#x89C1;<em>&#x56FE;3.22</em>&#xFF0C;&#x5B83;&#x663E;&#x793A;&#x4E86;&#x4E3B;&#x7EBF;&#x7A0B;&#x548C; <code>readLine</code> &#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x3002;&#x5C06;&#x5176;&#x4E0E;&#x60A8;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;<em>&#x56FE;3.21</em>&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;</p>
<p>&#x56FE;3.17.&#x5728;&#x5F15;&#x5165;<code>isReady</code>&#x4E4B;&#x524D;&#x6267;&#x884C;`client.nim``</p>
<p><img src="Images/ch03_input_thread_2.png" alt="ch03 input thread 2"></p>
<p>&#x56FE; 3.18.&#x5F53;&#x524D;&#x6267;&#x884C;client.nim</p>
<p><img src="Images/ch03_input_thread_3.png" alt="ch03 input thread 3"></p>
<p>&#x7B49;&#x5F85;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x4E0D;&#x518D;&#x963B;&#x585E;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x65F6;&#x95F4;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x8FC7;&#x7A0B; <code>poll</code> &#x6765;&#x68C0;&#x67E5;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x4E3A;&#x5B8C;&#x6574;&#x8D77;&#x89C1;&#xFF0C;&#x4E0B;&#x9762;&#x662F; <code>client.nim</code> &#x7684;&#x5B8C;&#x6574;&#x4EE3;&#x7801;&#x6E05;&#x5355;&#x3002;&#x672C;&#x8282;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#x4EE5;&#x7C97;&#x4F53;&#x663E;&#x793A;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> os, threadpool, **asyncdispatch, asyncnet**
**<span class="hljs-keyword">import</span> protocol**

**<span class="hljs-keyword">proc</span> connect(socket: <span class="hljs-type">AsyncSocket</span>, serverAddr: <span class="hljs-built_in">string</span>) <span class="hljs-meta">{.async.}</span> =**
  **echo(<span class="hljs-string">&quot;Connecting to &quot;</span>, serverAddr)**
  **await socket.connect(serverAddr, <span class="hljs-number">7687</span>.<span class="hljs-type">Port</span>)**
  **echo(<span class="hljs-string">&quot;Connected!&quot;</span>)**

  **<span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:**
    **<span class="hljs-keyword">let</span> line = await socket.recvLine()**
    **<span class="hljs-keyword">let</span> parsed = parseMessage(line)**
    **echo(parsed.username, <span class="hljs-string">&quot; said &quot;</span>, parsed.message)**

echo(<span class="hljs-string">&quot;Chat application started&quot;</span>)
<span class="hljs-keyword">if</span> paramCount() == <span class="hljs-number">0</span>:
  quit(<span class="hljs-string">&quot;Please specify the server address, e.g. ./client localhost&quot;</span>)
<span class="hljs-keyword">let</span> serverAddr = paramStr(<span class="hljs-number">1</span>)
**<span class="hljs-keyword">var</span> socket = newAsyncSocket()**
**asyncCheck connect(socket, serverAddr)**
**<span class="hljs-keyword">var</span> messageFlowVar = spawn <span class="hljs-literal">stdin</span>.readLine()**
**<span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:**
  **<span class="hljs-keyword">if</span> messageFlowVar.isReady():**
    **<span class="hljs-keyword">let</span> message = createMessage(<span class="hljs-string">&quot;Anonymous&quot;</span>, ^messageFlowVar)**
    **asyncCheck socket.send(message)**
    **messageFlowVar = spawn <span class="hljs-literal">stdin</span>.readLine()**

  **asyncdispatch.poll()**
</code></pre>
<p><strong>&#x6700;&#x7EC8;&#x7ED3;&#x679C;</strong></p>
<p>&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#xFF01;&#x60A8;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#x5668;&#x548C;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x4ECE;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x5E94;&#x8BE5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7A97;&#x53E3;&#x4E2D;&#x663E;&#x793A;&#x5B83;&#xFF0C;&#x4F46;&#x4E5F;&#x5728;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x663E;&#x793A;&#xFF01;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x6211;&#x6700;&#x521D;&#x7684;&#x7528;&#x4F8B;&#xFF0C;&#x5411;&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#x8BE2;&#x95EE;&#x300A;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x300B;&#x3002;&#x8BA8;&#x8BBA;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#x3002;</p>
<p>&#x6E05;&#x5355; 3.21.&#x6211;&#x3001;&#x7EA6;&#x7FF0;&#x548C;&#x683C;&#x857E;&#x4E1D;&#x5173;&#x4E8E;&#x300A;&#x6743;&#x529B;&#x7684;&#x6E38;&#x620F;&#x300B;&#x7684;&#x5BF9;&#x8BDD;</p>
<pre><code>*Dominik said* What did you guys think about the latest Game of Thrones
episode?
*Grace said* I thought Tyrion was really great in it!
*John said* I agree with Grace. Tyrion deserves an Emmy for his performance.
</code></pre><p>&#x8BA8;&#x8BBA;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5C4F;&#x5E55;&#x5C06;&#x663E;&#x793A;&#x76F8;&#x540C;&#x7684;&#x6D88;&#x606F;&#x3002;&#x9664;&#x4E86;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x6D88;&#x606F;&#x4E0D;&#x4F1A;&#x4EE5;&#xFF1C;name&#xFF1E;said&#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#x4E4B;&#x5916;&#xFF0C;&#x5176;&#x4E2D;&#xFF1C;name&gt;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x540D;&#x5B57;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x771F;&#x6B63;&#x770B;&#x5230;&#x5B83;&#x7684;&#x5B9E;&#x9645;&#x6548;&#x679C;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4EB2;&#x81EA;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x4EA4;&#x6362;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x663E;&#x793A;&#x4EE5;&#x4E0B;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x56FE; 3.19.&#x670D;&#x52A1;&#x5668;&#x7684;&#x8F93;&#x51FA;</p>
<p><img src="Images/ch03_final_4.png" alt="ch03 final 4"></p>
<p>&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x9014;&#x4E2D;&#x8FF7;&#x8DEF;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x7531;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x65E0;&#x6CD5;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x4EE3;&#x7801;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x4ECE; <a href="https://github.com/dom96/nim-in-action-code" target="_blank">https://github.com/dom96/nim-in-action-code</a> &#x4E0B;&#x8F7D;&#x672C;&#x4E66;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x60A8;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x53D1;&#x9001;&#x7ED9;&#x60A8;&#x7684;&#x4E00;&#x4F4D;&#x670B;&#x53CB;&#xFF0C;&#x5E76;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E0E;&#x60A8;&#x804A;&#x5929;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x901A;&#x8FC7;LAN&#x6216;&#x8DEF;&#x7531;&#x5668;&#x4E0A;&#x7684;&#x8F6C;&#x53D1;&#x7AEF;&#x53E3;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x624D;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x5F88;&#x5927;&#x7684;&#x6539;&#x8FDB;&#x7A7A;&#x95F4;&#x3002;&#x6211;&#x6545;&#x610F;&#x5C06;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x7528;&#x6237;&#x540D;&#x8BBE;&#x7F6E;&#x4E3A;&#x533F;&#x540D;&#xFF0C;&#x5E0C;&#x671B;&#x9F13;&#x52B1;&#x60A8;&#x4E3A;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x66F4;&#x6539;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6B64;&#x529F;&#x80FD;&#x5B58;&#x5728;&#x4E8E;&#x672C;&#x7AE0;&#x4E2D;&#x663E;&#x793A;&#x7684;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x4E2D;&#x3002;&#x5176;&#x4ED6;&#x6539;&#x8FDB;&#x6D89;&#x53CA;&#x66F4;&#x591A;&#xFF0C;&#x4F8B;&#x5982;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x7279;&#x6B8A;&#x7684; <code>PING</code> &#x6D88;&#x606F;&#x6216;&#x6DFB;&#x52A0;&#x5C06;&#x7528;&#x6237;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x8E22;&#x51FA;&#x7684;&#x529F;&#x80FD;&#x6765;&#x786E;&#x4FDD;&#x5BA2;&#x6237;&#x7AEF;&#x4ECD;&#x7136;&#x8FDE;&#x63A5;&#x3002;&#x6211;&#x76F8;&#x4FE1;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#xFF0C;&#x6709;&#x521B;&#x9020;&#x529B;&#x7684;&#x8BFB;&#x8005;&#xFF0C;&#x4E5F;&#x4F1A;&#x60F3;&#x51FA;&#x3002;</p>
<p>[13] Node fs.readFile &#x6587;&#x6863;&#xFF0C;<a href="https://nodejs.org/api/fs.html#fs_fs_readfile_filename_options_callback" target="_blank">https://nodejs.org/api/fs.html#fs_fs_readfile_filename_options_callback</a></p>
<p>[14] &#x521B;&#x5EFA;&#x5355;&#x4E2A;&#x7A0B;&#x5E8F;&#x5C06;&#x662F;&#x4E00;&#x9879;&#x76F8;&#x5F53;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x628A;&#x521B;&#x5EFA;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;readFile&#x8FC7;&#x7A0B;&#x7684;&#x6311;&#x6218;&#x7559;&#x7ED9;&#x60A8;&#x3002;</p>
<p>[15] &#x5927;&#x591A;&#x6570;&#x6613;&#x4E8E;&#x8BB0;&#x5FC6;&#x7684;&#x7AEF;&#x53E3;&#x88AB;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#xFF0C;<a href="https://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers" target="_blank">https://en.wikipedia.org/wiki/List_of_TCP_and_UDP_port_numbers</a></p>
<h2 id="36-&#x603B;&#x7ED3;">3.6 &#x603B;&#x7ED3;</h2>
<ul>
<li>&#x804A;&#x5929;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x5305;&#x62EC;&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BF9;&#x7B49;&#x6A21;&#x578B;&#x4EE5;&#x53CA;&#x5E38;&#x89C1;&#x7684;Internet&#x534F;&#x8BAE;&#xFF08;&#x5982;TCP&#x548C;UDP&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x8F83;&#x3002;</li>
<li>&#x8BBE;&#x7F6E;&#x60A8;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;Nim&#x9879;&#x76EE;&#x5E76;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#xFF0C;&#x5305;&#x62EC;&#x7528;&#x4E8E;&#x81EA;&#x5B9A;&#x4E49;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x7684;&#x5176;&#x4ED6;&#x6807;&#x5FD7;&#x548C;&#x53EF;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#x7684;Nim&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</li>
<li>&#x4F7F;&#x7528; <code>paramStr</code> &#x8FC7;&#x7A0B;&#x68C0;&#x7D22;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x3002;</li>
<li>&#x4F7F;&#x7528; <code>readLine</code> &#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x4E2D;&#x8BFB;&#x53D6;&#x884C;&#x3002;</li>
<li>&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x6D3E;&#x751F;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6D41;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x89E3;&#x51B3;&#x540C;&#x6B65;I/O&#x7684;&#x963B;&#x585E;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x4F7F;&#x7528; <code>JSON</code> &#x6A21;&#x5757;&#x89E3;&#x6790;&#x548C;&#x751F;&#x6210;JSON&#x3002;</li>
<li>&#x4F7F;&#x7528; <code>doAssert</code> &#x7F16;&#x5199;&#x7B80;&#x5355;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;</li>
<li>&#x4F7F;&#x7528; <code>asyncnet</code> &#x5F02;&#x6B65;&#x7F51;&#x7EDC;&#x6A21;&#x5757;&#x548C;&#x5957;&#x63A5;&#x5B57;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x3002;</li>
<li>Nim&#x7684;&#x6A21;&#x5757;&#x7CFB;&#x7EDF;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="02.html" class="navigation navigation-prev " aria-label="Previous page: 第二章 开始使用Nim">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="04.html" class="navigation navigation-next " aria-label="Next page: 第四章 标准库畅游">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章 编写一个网络聊天程序","level":"4.1","depth":1,"next":{"title":"第四章 标准库畅游","level":"4.2","depth":1,"path":"04.md","ref":"./04.md","articles":[]},"previous":{"title":"第二章 开始使用Nim","level":"3.2","depth":1,"path":"02.md","ref":"./02.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"03.md","mtime":"2023-01-30T11:51:57.846Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-02-02T15:44:52.102Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

