
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第五章 包管理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="09a_cn.html" />
    
    
    <link rel="prev" href="04.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="nim2.0.html">
            
                <a href="nim2.0.html">
            
                    
                     Nim 2.0 的改进
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="nim_nogc_cn.html">
            
                <a href="nim_nogc_cn.html">
            
                    
                     没有 GC 的 Nim 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="destructors_cn.html">
            
                <a href="destructors_cn.html">
            
                    
                     Nim 析构和移动语义 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="own_ref_cn.html">
            
                <a href="own_ref_cn.html">
            
                    
                     Nim 的新运行时 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="2020-10-15-introduction-to-arc-orc-in-nim.html">
            
                <a href="2020-10-15-introduction-to-arc-orc-in-nim.html">
            
                    
                     Nim 的 ARC/ORC 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="2020-12-08-introducing-orc.html">
            
                <a href="2020-12-08-introducing-orc.html">
            
                    
                     ORC 卓越的 GC 算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="2022-11-11-a-cost-model-for-nim_cn.html">
            
                <a href="2022-11-11-a-cost-model-for-nim_cn.html">
            
                    
                     Nim2.0 的成本模型 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="nim-memory_cn.html">
            
                <a href="nim-memory_cn.html">
            
                    
                     Nim 内存模型 
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="2021-11-15-zen-of-nim_cn.html">
            
                <a href="2021-11-15-zen-of-nim_cn.html">
            
                    
                     Nim之禅 
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="nimspecial.html">
            
                <a href="nimspecial.html">
            
                    
                     Nim特色 
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="00a.html">
            
                <a href="00a.html">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.3" data-path="00w.html">
            
                <a href="00w.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    第一章 初识Nim
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    第二章 开始使用Nim
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    第三章 编写一个网络聊天程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    第四章 标准库畅游
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    第五章 包管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.4" data-path="09a_cn.html">
            
                <a href="09a_cn.html">
            
                    
                    第五加章 文档和调试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.5" data-path="06.html">
            
                <a href="06.html">
            
                    
                    第六章 并行编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="5.6" data-path="07.html">
            
                <a href="07.html">
            
                    
                    第七章 构建一个Twitter克隆
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="6.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    第八章 外部程序接口FFI
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="6.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    第九章 元编程
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第五章 包管理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E94;&#x7AE0;-&#x5305;&#x7BA1;&#x7406;">&#x7B2C;&#x4E94;&#x7AE0; &#x5305;&#x7BA1;&#x7406;</h1>
<p>&#x672C;&#x7AE0;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x4EC0;&#x4E48;&#x662F;Nimble&#xFF1F;&#x5B83;&#x5982;&#x4F55;&#x5E2E;&#x52A9;&#x6211;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#xFF1F;</li>
<li>&#x4F7F;&#x7528;Nimble&#x8F6F;&#x4EF6;&#x5305;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;</li>
<li>&#x521B;&#x5EFA;Nimble&#x5305;&#x5E76;&#x53D1;&#x5E03;&#x5B83;&#x4EEC;</li>
</ul>
<p>&#x5982;&#x4ECA;&#xFF0C;&#x8F6F;&#x4EF6;&#x5305;&#x7ECF;&#x7406;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x626E;&#x6F14;&#x7740;&#x6838;&#x5FC3;&#x89D2;&#x8272;&#x3002;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x603B;&#x662F;&#x5982;&#x6B64;&#xFF1B;&#x7EFC;&#x5408;Perl&#x5B58;&#x6863;&#x7F51;&#x7EDC;&#xFF08;&#x6216;CPAN&#xFF09;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x4EC5;&#x4E3A;&#x7279;&#x5B9A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x800C;&#x5B58;&#x5728;&#x7684;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x5B58;&#x50A8;&#x5E93;&#x4E4B;&#x4E00;&#x3002;&#x5B83;&#x7531;&#x8D85;&#x8FC7;150000&#x4E2A;Perl&#x4EE3;&#x7801;&#x6A21;&#x5757;&#x7EC4;&#x6210;&#xFF0C;&#x662F;&#x5355;&#x4E00;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x6700;&#x5927;&#x7684;&#x8F6F;&#x4EF6;&#x6A21;&#x5757;&#x5E93;&#x4E4B;&#x4E00;&#x3002;&#x5B83;&#x4E5F;&#x662F;&#x6B64;&#x7C7B;&#x8F6F;&#x4EF6;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x6700;&#x65E9;&#x793A;&#x4F8B;&#x4E4B;&#x4E00;&#xFF1B;&#x5B83;&#x7684;&#x6210;&#x529F;&#x5F71;&#x54CD;&#x4E86;&#x8BB8;&#x591A;&#x4EBA;&#x3002;&#x4ECA;&#x5929;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x6709;&#x8F6F;&#x4EF6;&#x5B58;&#x50A8;&#x5E93;&#x3002;</p>
<p>&#x5305;&#x662F;&#x5BF9;&#x6A21;&#x5757;&#x96C6;&#x5408;&#x7684;&#x62BD;&#x8C61;&#x672F;&#x8BED;&#xFF1B;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x5F62;&#x6210;&#x5E93;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x81EA;&#x52A8;&#x5316;&#x4E86;&#x4E0B;&#x8F7D;&#x3001;&#x5B89;&#x88C5;&#x3001;&#x66F4;&#x65B0;&#x548C;&#x5220;&#x9664;&#x5305;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x5E93;&#x5305;&#x542B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B9A;&#x4E49;&#x826F;&#x597D;&#x7684;&#x63A5;&#x53E3;&#x8C03;&#x7528;&#x7684;&#x4E0D;&#x540C;&#x884C;&#x4E3A;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x4E9B;&#x5B9E;&#x73B0;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#x5B58;&#x50A8;&#x548C;&#x516C;&#x5F00;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x5B58;&#x50A8;&#x5E93;&#x5206;&#x53D1;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5305;&#xFF0C;&#x5141;&#x8BB8;&#x8FD9;&#x4E9B;&#x5305;&#x81EA;&#x7531;&#x4E0B;&#x8F7D;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x4E0B;&#x8F7D;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x5F88;&#x4E4F;&#x5473;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x8F6F;&#x4EF6;&#x5305;&#x90FD;&#x6709;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF1A;&#x5176;&#x4ED6;&#x8F6F;&#x4EF6;&#x5305;&#x9700;&#x8981;&#x63D0;&#x524D;&#x5B89;&#x88C5;&#xFF0C;&#x624D;&#x80FD;&#x4F7F;&#x8F6F;&#x4EF6;&#x5305;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x786E;&#x4FDD;&#x81EA;&#x52A8;&#x6B63;&#x786E;&#x5B89;&#x88C5;&#x4F9D;&#x8D56;&#x9879;<em>&#x4E0B;&#x56FE;5.1</em>&#x663E;&#x793A;&#x4E86;&#x5305;&#x3001;&#x5E93;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x8F6F;&#x4EF6;&#x5B58;&#x50A8;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x56FE;5.1.&#x8F6F;&#x4EF6;&#x5305;&#x3001;&#x5E93;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x8F6F;&#x4EF6;&#x5B58;&#x50A8;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x6BD4;&#x8F83;</p>
<p><img src="Images/ch05_intro.png" alt="ch05 intro"></p>
<p>&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x6709;&#x4E9B;&#x751A;&#x81F3;&#x6709;&#x591A;&#x4E2A;&#x3002;Nim&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x60A8;&#x8BBF;&#x95EE;Nim&#x5305;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x6570;&#x767E;&#x4E2A;&#x5F00;&#x6E90;&#x5305;&#x3002;</p>
<h1 id="51-nim&#x5305;&#x7BA1;&#x7406;&#x5668;">5.1 Nim&#x5305;&#x7BA1;&#x7406;&#x5668;</h1>
<p>&#x73B0;&#x5728;&#x6709;&#x8BB8;&#x591A;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x4F46;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x90FD;&#x662F;&#x4E3A;&#x76F8;&#x540C;&#x7684;&#x76EE;&#x7684;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF0C;&#x7CFB;&#x7EDF;&#x7EA7;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x5305;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x7EA7;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x901A;&#x5E38;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6346;&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5B83;&#x4EEC;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5B89;&#x88C5;&#x7528;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x4E00;&#x7EC4;&#x6D41;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x5E93;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x522B;&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x66F4;&#x5177;&#x4F53;&#xFF0C;&#x5B83;&#x4EEC;&#x4E13;&#x6CE8;&#x4E8E;&#x7528;&#x5355;&#x4E00;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x5E93;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x6709;&#x4E00;&#x53F0;&#x5168;&#x65B0;&#x7684;&#x7535;&#x8111;&#xFF0C;&#x4F60;&#x60F3;&#x5728;&#x4E0A;&#x9762;&#x770B;&#x4E00;&#x4E9B;&#x7535;&#x5F71;&#x3002;&#x89C2;&#x770B;&#x89C6;&#x9891;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E4B;&#x4E00;&#x662F;VLC&#xFF0C;&#x4F46;&#x7535;&#x8111;&#x6CA1;&#x6709;&#x9884;&#x88C5;&#x5B83;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6307;&#x793A;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5B89;&#x88C5;VLC&#xFF0C;&#x4EE5;&#x53CA;VLC&#x9700;&#x8981;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x7F3A;&#x5931;&#x7684;&#x5E93;&#x3002;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7EA7;&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5C06;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x3002;</p>
<p>VLC&#x9644;&#x5E26;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>libvlc</code> &#x7684;&#x5E93;&#xFF0C;&#x8BE5;&#x5E93;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x4E0E;VLC&#x672C;&#x8EAB;&#x76F8;&#x540C;&#x7684;&#x7CBE;&#x5EA6;&#x64AD;&#x653E;&#x89C6;&#x9891;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x5728;Nim&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x6B64;&#x5E93;&#xFF0C;&#x4E3A;&#x6B64;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4E00;&#x4E2A;Nim&#x5305;&#xFF0C;&#x8BE5;&#x5305;&#x5B9E;&#x73B0;&#x8BE5;&#x5E93;&#x7684;Nim&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5305;&#x5C06;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5B89;&#x88C5;&#x3002;</p>
<p>&#x56FE;5.2.&#x7CFB;&#x7EDF;&#x7EA7;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x5305;&#x7BA1;&#x7406;&#x5668;
<img src="Images/ch05_system_vs_app_level.png" alt="ch05 system vs app level"></p>
<p>&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5728;&#x5206;&#x53D1;&#x5305;&#x7684;&#x65B9;&#x5F0F;&#x4E0A;&#x4E5F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x4E00;&#x4E9B;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x7684;&#x5F62;&#x5F0F;&#x5206;&#x53D1;&#x5305;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E9B;&#x5219;&#x5206;&#x53D1;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x540E;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x7528;&#x6237;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7F16;&#x8BD1;&#x5305;&#x3002;</p>
<p>Nim&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x53EB;&#x505A; <code>Nimble</code> &#x3002;Nimble&#x662F;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x5B83;&#x4EE5;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x5F62;&#x5F0F;&#x5206;&#x53D1;&#x5305;&#x3002;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x5982;Python&#x7684;pip&#x548C;NodeJS&#x7684;npm&#x3002;Nimble&#x5DF2;&#x7ECF;&#x88AB;&#x8BB8;&#x591A;Nim&#x7A0B;&#x5E8F;&#x5458;&#x4F7F;&#x7528;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x8FD8;&#x4E0D;&#x7A33;&#x5B9A;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x7F3A;&#x5C11;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#x3002;&#x672C;&#x8282;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5F53;&#x524D;&#x7248;&#x672C;&#x7684;Nimble&#xFF08;&#x622A;&#x81F3;&#x7F16;&#x5199;&#x65F6;&#x4E3A;0.7.2&#xFF09;&#x5982;&#x4F55;&#x7528;&#x4E8E;&#x7BA1;&#x7406;Nim&#x5E93;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;Nimble&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x53D1;&#x5C55;&#xFF0C;&#x672C;&#x8282;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x5C06;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<h1 id="52&#x5B89;&#x88C5;nimble&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;">5.2&#x5B89;&#x88C5;Nimble&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;</h1>
<p>&#x597D;&#x6D88;&#x606F;&#x662F;&#xFF0C;&#x60A8;&#x5F88;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5B89;&#x88C5;&#x4E86;Nimble&#x3002;Nim&#x5B89;&#x88C5;&#x5305;&#x4ECE;0.15.0&#x7248;&#x672C;&#x5F00;&#x59CB;&#x5305;&#x542B;Nimble&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x5B89;&#x88C5;&#x4E86;Nim&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x5B89;&#x88C5;Nimble&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x7EC8;&#x7AEF;&#x4E2D;&#x8FD0;&#x884C;  <code>nimble -v</code>  &#x6765;&#x8F7B;&#x677E;&#x68C0;&#x67E5;&#x60C5;&#x51B5;&#x662F;&#x5426;&#x5982;&#x6B64;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x4E3A;&#x4E86;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;Nimble&#x53EF;&#x80FD;&#x4F1A;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;Git&#x7684;&#x5916;&#x90E8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x60A8;&#x8FD8;&#x5FC5;&#x987B;&#x5728;PATH&#x4E2D;&#x5B89;&#x88C5;&#x5E76;&#x63D0;&#x4F9B;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x6709;&#x5173;Nimble&#x5B89;&#x88C5;&#x7684;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x672C;&#x6587;&#x6863;&#xFF1A;<a href="https://github.com/nim-lang/nimble#installation" target="_blank">https://github.com/nim-lang/nimble#installation</a></p>
<h1 id="53---nimble-&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;">5.3   <code>nimble</code> &#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;</h1>
<p>&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5728;&#x7CFB;&#x7EDF;&#x4E0A;&#x5B89;&#x88C5;&#x4E86;Nimble&#x3002;&#x5728;&#x65B0;&#x7684;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x8FD0;&#x884C; <code>nimble</code>  &#x5E94;&#x8BE5;&#x4F1A;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x7531;.Nimble&#x652F;&#x6301;&#x7684;&#x547D;&#x4EE4;&#x5217;&#x8868;<em>&#x56FE;5.4</em>&#x4EC5;&#x663E;&#x793A;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x56FE;5.3.Nimble&#x652F;&#x6301;&#x7684;&#x4E00;&#x4E9B;&#x547D;&#x4EE4;</p>
<p><img src="Images/ch05_nimble_help.png" alt="ch05 nimble help"></p>
<p>&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;<em>&#x56FE;5.4</em>&#x4E2D;&#x770B;&#x5230;&#x5C06;&#x547D;&#x4EE4;&#x4F20;&#x9012;&#x7ED9;Nimble&#x7684;&#x987A;&#x5E8F;&#x3002;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x5199;&#x5728; <code>nimble</code>  &#x4E4B;&#x540E;&#xFF0C;&#x7528;&#x7A7A;&#x683C;&#x9694;&#x5F00;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x4F20;&#x9012;&#x7ED9;&#x8BE5;&#x547D;&#x4EE4;&#x7684;&#x6807;&#x5FD7;&#x548C;&#x53C2;&#x6570;&#xFF0C;&#x6BCF;&#x4E2A;&#x6807;&#x5FD7;&#x548C;&#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x7528;&#x7A7A;&#x683C;&#x9694;&#x5F00;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8981;&#x641C;&#x7D22;&#x4E0E;Linux&#x76F8;&#x5173;&#x7684;&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C; <code>nimble search linux</code> &#x3002;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4E00;&#x4E2A; <code>--ver</code> &#x6807;&#x5FD7;&#xFF0C;&#x5B83;&#x5C06;&#x663E;&#x793A;&#x6BCF;&#x4E2A;&#x5305;&#x7684;&#x53EF;&#x7528;&#x7248;&#x672C;<em>&#x56FE;5.5</em>&#x663E;&#x793A;&#x4E86;&#x4F7F;&#x7528; <code>--ver</code> &#x6807;&#x5FD7;&#x641C;&#x7D22; <code>linux</code> &#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x56FE;5.4.&#x641C;&#x7D22;&#x5305;&#x542B;&#x7248;&#x672C;&#x4FE1;&#x606F;&#x7684; <code>linux</code> &#x5305;</p>
<p><img src="Images/ch05_nimble_search_ver.png" alt="ch05 nimble search ver"></p>
<p>&#x6CE8;&#x610F;<em>&#x56FE;5.5</em>&#x4E2D;&#x7684;&quot;versions:&quot; &#x540E;&#x9762;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x5217;&#x8868;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x7684; <code>daemonize</code>  &#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5305;&#x7684;&#x7248;&#x672C;&#x3002;</p>
<p>Nimble&#x7684;&#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;&#x662F;&#x5B89;&#x88C5;&#x3001;&#x641C;&#x7D22;&#x3001;&#x5347;&#x7EA7;&#x548C;&#x5220;&#x9664;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x6211;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x5B9E;&#x9645;&#x542B;&#x4E49;&#x3002;</p>
<h1 id="54-&#x4EC0;&#x4E48;&#x662F;nimble&#x5305;&#xFF1F;">5.4 &#x4EC0;&#x4E48;&#x662F;Nimble&#x5305;&#xFF1F;</h1>
<p>&#x8F6F;&#x4EF6;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x7531;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6587;&#x4EF6;&#x7EC4;&#x6210;&#xFF0C;&#x5305;&#x62EC;&#x6E90;&#x4EE3;&#x7801;&#x3001;&#x56FE;&#x50CF;&#x3001;&#x58F0;&#x97F3;&#x7B49;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x89C6;&#x9891;&#x6E38;&#x620F;&#x3002;&#x89C6;&#x9891;&#x6E38;&#x620F;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x8D44;&#x6E90;&#x624D;&#x80FD;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x9700;&#x8981;&#x4E0E;&#x6E38;&#x620F;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x6346;&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x8F6F;&#x4EF6;&#x5305;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5C06;&#x6B64;&#x7C7B;&#x6587;&#x4EF6;&#x4E0E;&#x8F6F;&#x4EF6;&#x6346;&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x4FBF;&#x6377;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x4ECE;&#x6700;&#x7B80;&#x5355;&#x7684;&#x610F;&#x4E49;&#x4E0A;&#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x7684;<em>Nimble&#x5305;</em>&#x662F;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E2A; .nimble&#x6587;&#x4EF6;&#x548C;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;Nim&#x6A21;&#x5757;&#x3002;</p>
<p> .nimble&#x6587;&#x4EF6;&#x5305;&#x542B;&#x6709;&#x5173;&#x5305;&#x7684;&#x5143;&#x6570;&#x636E;&#x3002;&#x5B83;&#x6307;&#x5B9A;&#x5305;&#x7684;&#x540D;&#x79F0;&#x3001;&#x7248;&#x672C;&#x3001;&#x4F5C;&#x8005;&#x3001;&#x4F9D;&#x8D56;&#x9879;&#x7B49;&#x3002; .nimble&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x6269;&#x5C55;&#x540D;&#xFF0C;&#x6BCF;&#x4E2A; .nimble&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x90FD;&#x4E0E;&#x5305;&#x7684;&#x540D;&#x79F0;&#x76F8;&#x540C;&#x3002;<em>&#x6E05;&#x5355;5.2</em>&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684; .nimble&#x6587;&#x4EF6;&#x6E05;&#x5355;&#x3002;</p>
<p>&#x6E05;&#x5355;5.1. <code>MyPkg.nimble</code> &#x6E05;&#x5355; .nimble&#x6587;&#x4EF6;&#x3002;</p>
<pre><code>[Package]
name          = &quot;MyPkg&quot;       # &lt;1&gt;
version       = &quot;0.1.0&quot;       # &lt;2&gt;
author        = &quot;Dominik Picheta&quot;
description   = &quot;Example .nimble file.&quot;
license       = &quot;MIT&quot;

[Deps]
Requires: &quot;nim &gt;= 0.12.0&quot;     # &lt;3&gt;
</code></pre><blockquote>
<p><1> &#x6B64;&#x5904;&#x6307;&#x5B9A;&#x7684;&#x540D;&#x79F0;&#x5FC5;&#x987B;&#x4E0E;&#x6587;&#x4EF6;&#x540D;&#x52A0;&#x4E0A; .nimble&#x6269;&#x5C55;&#x540D;&#x76F8;&#x540C;&#xFF0C;&#x5373;  <code>MyPkg.nimble</code> &#x3002;</1></p>
<p><2> &#x7248;&#x672C;&#x901A;&#x5E38;&#x7531;3&#x4E2A;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#xFF0C;&#x7531;&#x53E5;&#x70B9;&#x5206;&#x9694;&#xFF0C;&#x5176;&#x542B;&#x4E49;&#x9075;&#x5FAA;&#x8BED;&#x4E49;&#x7248;&#x672C;&#x63A7;&#x5236;[[18]]&#xFF08;#ftn.d5e5758&#xFF09;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4F46;&#x4E0D;&#x652F;&#x6301;&#x5176;&#x4ED6;&#x5B57;&#x7B26;&#xFF0C;</2></p>
<p><3> &#x8FD9;&#x6307;&#x5B9A;&#x5305;&#x81F3;&#x5C11;&#x9700;&#x8981;0.12.0&#x7248;&#x7684;Nim&#x7F16;&#x8BD1;&#x5668;&#x624D;&#x80FD;&#x6210;&#x529F;&#x7F16;&#x8BD1;&#x3002;</3></p>
</blockquote>
<p><code>.nimble</code>&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#x4E0E;<em>ini</em>&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x76F8;&#x4F3C;&#x3002;&#x8282;&#x7531;&#x65B9;&#x62EC;&#x53F7;&#x5206;&#x9694;&#xFF0C;&#x952E;&#x548C;&#x503C;&#x5BF9;&#x4F7F;&#x7528;<code>key=</code>value<code>`&#x8BED;&#x6CD5;&#x6216;</code>key: &quot;value&quot;`&#x8BED;&#x6CD5;&#x6307;&#x5B9A;<em>&#x4E0B;&#x56FE;5.6</em>&#x663E;&#x793A;&#x4E86;&#x5178;&#x578B;&#x7684;&#x72EC;&#x7ACB;Nimble&#x5305;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x56FE;5.5.&#x5178;&#x578B;&#x7684;Nimble&#x5305;</p>
<p><img src="Images/ch05_nimble_file.png" alt="ch05 nimble file"></p>
<p>&#x5728;<em>&#x6E05;&#x5355;5.2</em>&#x4E2D;&#x7684; <code>MyPkg.nimble</code> &#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;.nimble&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x9009;&#x9879;&#x3002;&#x6709;&#x592A;&#x591A;&#x7684;&#x9879;&#x76EE;&#x65E0;&#x6CD5;&#x5728;&#x8FD9;&#x91CC;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#xFF0C;&#x4F46;&#x60A8;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x90E8;&#x5206;&#x4E86;&#x89E3;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x3002;&#x6709;&#x5173;&#x5B8C;&#x6574;&#x5217;&#x8868;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;Github&#x4E0A;&#x7684;Nimble&#x6587;&#x6863;&#xFF1A;<a href="https://github.com/nim-lang/nimble#readme" target="_blank">https://github.com/nim-lang/nimble#readme</a></p>
<p><strong>&#x53E6;&#x4E00;&#x79CD;.nimble&#x683C;&#x5F0F;</strong></p>
<p>Nimble&#x6700;&#x8FD1;&#x83B7;&#x5F97;&#x4E86;&#x5BF9;&#x57FA;&#x4E8E;Nim&#x7684;&#x5168;&#x65B0;&#x914D;&#x7F6E;&#x683C;&#x5F0F;&#x7684;&#x652F;&#x6301;&#x3002;&#x5B83;&#x88AB;&#x79F0;&#x4E3A;Nimscript&#xFF0C;&#x662F;&#x5B8C;&#x6574;Nim&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#x3002;&#x8FD9;&#x79CD;&#x8BED;&#x6CD5;&#x4F7F;&#x5F97;&#x4F7F;&#x7528;Nim&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5305;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;</p>
<p>Nimscript&#x5141;&#x8BB8;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7528;&#x4F8B;&#x662F;&#x57FA;&#x4E8E;&#x8FD0;&#x884C;Nimble&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6307;&#x5B9A;&#x4F9D;&#x8D56;&#x9879;&#x3002;</p>
<p>&#x7C7B;&#x4F3C;&#x4E8E; <code>MyPkg.nimble</code> &#xFF0C;&#x800C;&#x4F7F;&#x7528;Nimscript&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code># Package information
version       = &quot;0.1.0&quot;
author        = &quot;Dominik Picheta&quot;
description   = &quot;Example .nimble file.&quot;
license       = &quot;MIT&quot;


# Dependencies
requires &quot;nim &gt;= 0.12.0&quot;
</code></pre><p>&#x5982;&#x60A8;&#x6240;&#x89C1;&#xFF0C;&#x8BED;&#x6CD5;&#x57FA;&#x672C;&#x76F8;&#x540C;&#x3002;&#x4E24;&#x4E2A;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x662F;&#x7F3A;&#x5C11; <code>name</code> &#x5B57;&#x6BB5;&#xFF08;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x90FD;&#x662F;&#x5197;&#x4F59;&#x7684;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x6307;&#x5B9A;&#x4F9D;&#x8D56;&#x9879;&#x7684;&#x8BED;&#x6CD5;&#x7565;&#x6709;&#x4E0D;&#x540C;&#x3002;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x5206;&#x9694;&#x7684;&#x90E8;&#x5206;&#x4E5F;&#x6D88;&#x5931;&#x4E86;&#xFF0C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x3002;</p>
<p>Nimscript&#x7684;&#x4EAE;&#x70B9;&#x5728;&#x4E8E;&#x80FD;&#x591F;&#x6307;&#x5B9A;&#x81EA;&#x5B9A;&#x4E49;&#x4EFB;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>task tests, &quot;Run the packages tests!&quot;:
  exec &quot;nim c -r tests/mytest.nim&quot;
</code></pre><p>&#x5C06;&#x8BE5;&#x4EE3;&#x7801;&#x6BB5;&#x653E;&#x5728; .nimble&#x6587;&#x4EF6;&#x7684;&#x5E95;&#x90E8;&#xFF0C;&#x5C06;&#x5141;&#x8BB8;&#x60A8;&#x6267;&#x884C;  <code>nimble tests</code> &#xFF0C;&#x8BE5;&#x6D4B;&#x8BD5;&#x5C06;&#x6267;&#x884C;&#x4E3A;&#x8BE5;&#x4EFB;&#x52A1;&#x6307;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE3;&#x7801;&#x5C06;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;  <code>mytest.nim</code> &#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x60A8;&#x5728;&#x672C;&#x5730;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#x6709;&#x4E00;&#x4E2A;Nimble&#x5305;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5728;&#x8BE5;&#x5305;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x6253;&#x5F00;&#x7EC8;&#x7AEF;&#x5E76;&#x6267;&#x884C;  <code>nimble install</code> &#x3002;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;Nimble&#x5C06;&#x5C1D;&#x8BD5;&#x5B89;&#x88C5;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5305;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x60A8;&#x53EF;&#x80FD;&#x81EA;&#x5DF1;&#x521B;&#x5EFA;&#x7684;&#x672C;&#x5730;&#x5305;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x521B;&#x5EFA;&#x7684;&#x5305;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x624B;&#x52A8;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x5305;&#x5417;&#xFF1F;</p>
<p>&#x8C22;&#x5929;&#x8C22;&#x5730;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x662F;&#x4E0D;&#x3002;&#x4F5C;&#x4E3A; <code>install</code> &#x547D;&#x4EE4;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x6307;&#x5411;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x5305;&#x7684;URL&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x8BE5;URL&#x5FC5;&#x987B;&#x6307;&#x5411;Git&#x6216;Mercurial&#x5B58;&#x50A8;&#x5E93;&#x3002;&#x8FD9;&#x5E26;&#x6765;&#x4E86;&#x5916;&#x90E8;&#x5305;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5373;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x8BBF;&#x95EE;&#x7684;&#x5305;&#x3002;&#x5916;&#x90E8;Nimble&#x5305;&#x662F;&#x4E00;&#x4E2A;Git&#x6216;Mercurial&#x5B58;&#x50A8;&#x5E93;&#xFF0C;&#x5305;&#x542B;&#x4E00;&#x4E2A; .nimble&#x6587;&#x4EF6;&#x548C;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;Nim&#x6A21;&#x5757;&#x3002;</p>
<p><strong>&#x4EC0;&#x4E48;&#x662F;Git&#x548C;Mercurial&#xFF1F;</strong></p>
<p>Git&#x548C;Mercurial&#x90FD;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF08;DVCS&#xFF09;&#x7684;&#x793A;&#x4F8B;&#x3002;DVCS&#x4F7F;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x80FD;&#x591F;&#x5728;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4E0A;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B83;&#x6709;&#x52A9;&#x4E8E;&#x5904;&#x7406;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x7EC8;&#x7F16;&#x8F91;&#x76F8;&#x540C;&#x6587;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x8DDF;&#x8E2A;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x5730;&#x8986;&#x76D6;&#x6587;&#x4EF6;&#x5E76;&#x5B58;&#x50A8;&#x6700;&#x65B0;&#x7248;&#x672C;&#x3002;</p>
<p>Git&#xFF08;&#x6216;Mercurial&#xFF09;<em>&#x5B58;&#x50A8;&#x5E93;</em>&#x662F;&#x5B58;&#x50A8;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x5386;&#x53F2;&#x7684;&#x5730;&#x65B9;&#x3002;&#x8FD9;&#x4E9B;&#x5B58;&#x50A8;&#x5E93;&#x53EF;&#x4EE5;&#x4E0A;&#x4F20;&#x5230;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x522B;&#x4F7F;&#x7528;git&#x548C;Mercurial&#x7684; <code>git</code> &#x548C; <code>hg</code> &#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#x4E0B;&#x8F7D;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5904;&#x7406;&#x9879;&#x76EE;&#x5E76;&#x4E0A;&#x4F20;&#x4ED6;&#x4EEC;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x7136;&#x540E;&#x60A8;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x3002;</p>
<p>&#x4E0B;&#x8F7D;&#x5B58;&#x50A8;&#x5E93;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x6587;&#x4EF6;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E00;&#x5468;&#x524D;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x6B21;&#x521B;&#x5EFA;&#x5B58;&#x50A8;&#x5E93;&#x65F6;&#x3002;</p>
<p>Git&#x548C;Mercurial&#x5B58;&#x50A8;&#x5E93;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5B83;&#x4EEC;&#x652F;&#x6301;&#x6807;&#x8BB0;&#x3002;&#x6807;&#x8BB0;&#x6807;&#x8BC6;&#x5B58;&#x50A8;&#x5E93;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x4FEE;&#x8BA2;&#x3002;&#x5305;&#x542B;Nimble&#x5305;&#x7684;&#x5B58;&#x50A8;&#x5E93;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x6807;&#x8BC6;&#x8BE5;&#x5305;&#x7684;&#x6BCF;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x6807;&#x8BB0;<em>&#x4E0B;&#x56FE;5.7</em>&#x663E;&#x793A;&#x4E86;&#x5916;&#x90E8;Nimble&#x5305;&#x7684;&#x5185;&#x5BB9;&#x5728;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x56FE;5.6&#x5916;&#x90E8;Nimble&#x5305;&#x7684;&#x6F14;&#x53D8;</p>
<p><img src="Images/ch05_nimble_repo.png" alt="ch05 nimble repo"></p>
<p>&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x4E86;  <code>search</code> &#x547D;&#x4EE4;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x4F7F;&#x7528;  <code>--ver</code>  &#x6807;&#x5FD7;&#xFF0C;  <code>search</code> &#x547D;&#x4EE4;&#x5C06;&#x5217;&#x51FA;&#x6BCF;&#x4E2A;&#x5305;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x6807;&#x8BB0;&#x3002;Nimble&#x5C06;&#x6BCF;&#x4E2A;&#x6807;&#x8BB0;&#x89E3;&#x91CA;&#x4E3A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x3002;</p>
<p>Nimble&#x5305;&#x4E0E;&#x5B58;&#x50A8;&#x5E93;&#x8026;&#x5408;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x5E93;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x5DF2;&#x5B58;&#x50A8;&#x5728;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x3002;&#x5C06;&#x8BE5;&#x5B58;&#x50A8;&#x5E93;&#x8F6C;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;Nimble&#x5305;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;.nimble &#x6587;&#x4EF6;&#x3002;&#x5176;&#x4ED6;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x5C06;&#x5176;&#x8F6F;&#x4EF6;&#x5305;&#x5B58;&#x50A8;&#x5728;&#x5355;&#x4E2A;&#x96C6;&#x4E2D;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x8FD9;&#x6709;&#x5176;&#x4F18;&#x70B9;&#xFF0C;&#x4E5F;&#x662F;Nimble&#x6700;&#x7EC8;&#x4E5F;&#x5C06;&#x652F;&#x6301;&#x7684;&#x3002;</p>
<p><a href="#d5e5758">[18]</a> <a href="http://semver.org" target="_blank">http://semver.org</a></p>
<h1 id="55-&#x5B89;&#x88C5;nimble&#x7684;&#x8F6F;&#x4EF6;&#x5305;">5.5 &#x5B89;&#x88C5;Nimble&#x7684;&#x8F6F;&#x4EF6;&#x5305;</h1>
<p>&#x5B89;&#x88C5;Nimble&#x5305;&#x53EF;&#x80FD;&#x662F;&#x60A8;&#x5C06;&#x4F7F;&#x7528;Nimble&#x6267;&#x884C;&#x7684;&#x6700;&#x5E38;&#x89C1;&#x4EFB;&#x52A1;&#x3002;&#x60A8;&#x5DF2;&#x7ECF;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x770B;&#x5230;&#x4E86; <code>install</code> &#x547D;&#x4EE4;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x6B64;&#x547D;&#x4EE4;&#x63D0;&#x4F9B;&#x4E86;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x3002;
install&#x547D;&#x4EE4;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x672C;&#x5730;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x3002;</li>
<li>&#x4ECE;&#x6307;&#x5B9A;&#x7684;URL&#x5B89;&#x88C5;&#x7A0B;&#x5E8F;&#x5305;&#x3002;</li>
<li>&#x6309;&#x540D;&#x79F0;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x3002;</li>
<li>&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x3002;</li>
<li>&#x4E00;&#x6B21;&#x5B89;&#x88C5;&#x591A;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#x3002;</li>
</ul>
<h2 id="551&#x4F7F;&#x7528;---install--&#x547D;&#x4EE4;">5.5.1&#x4F7F;&#x7528;   <code>install</code>  &#x547D;&#x4EE4;</h2>
<p>&#x672C;&#x5730;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x5B89;&#x88C5;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x53EA;&#x9700;&#x5728;&#x672C;&#x5730;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7EC8;&#x7AEF; <code>cd</code>  &#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x952E;&#x5165; <code>cd /home/user/MyPkg</code>  &#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C; <code>nimble install</code> &#x3002;</p>
<p>&#x8981;&#x4ECE;URL&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#xFF1A;&#x53EA;&#x9700;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7EC8;&#x7AEF;&#x5E76;&#x6267;&#x884C; <code>nimble install &lt;your_url_here&gt;</code> &#xFF0C;&#x7528;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x7684;URL&#x66FF;&#x6362;<your_url _here="">&#x3002;&#x5F53;&#x524D;&#xFF0C;URL&#x5FC5;&#x987B;&#x6307;&#x5411;&#x975E;&#x7A7A;&#x7684;Git&#x6216;Mercurial&#x5B58;&#x50A8;&#x5E93;&#x3002;</your_url></p>
<p>Nimble&#x4E3A;&#x60A8;&#x7701;&#x53BB;&#x4E86;&#x8BB0;&#x4F4F;&#x4E0D;&#x540C;&#x5305;&#x7684;&#x4E00;&#x5806;URL&#x7684;&#x9EBB;&#x70E6;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5305;&#x542B;Nim&#x793E;&#x533A;&#x521B;&#x5EFA;&#x7684;&#x5305;&#x5217;&#x8868;&#x7684;&#x5305;&#x5B58;&#x50A8;&#x5E93;&#x3002;Nimble&#x4E0B;&#x8F7D;&#x6B64;&#x5217;&#x8868;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x6709;&#x5173;&#x6BCF;&#x4E2A;&#x5305;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5305;&#x7684;URL&#x548C;&#x540D;&#x79F0;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;  <code>search</code>  &#x547D;&#x4EE4;&#x5417;&#xFF1F;&#x5B83;&#x4F1A;&#x641C;&#x7D22;&#x6B64;&#x5217;&#x8868;&#x3002;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x4E2D;&#x5217;&#x51FA;&#x7684;&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x53EA;&#x9700;&#x5728; <code>install</code> &#x547D;&#x4EE4;&#x540E;&#x6307;&#x5B9A;&#x5176;&#x540D;&#x79F0;&#x5373;&#x53EF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8981;&#x5B89;&#x88C5;<em>&#x56FE;5.5</em>&#x4E2D;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x4E2D;&#x663E;&#x793A;&#x7684;  <code>daemonize</code> &#x5305;&#xFF0C;&#x53EA;&#x9700;&#x6267;&#x884C; <code>nimble install daemonize</code> &#x5373;&#x53EF;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5728;&#x5305;&#x7684;&#x540D;&#x79F0;&#x540E;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;  <code>@</code>  &#x5B57;&#x7B26;&#xFF0C;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x5305;&#x7684;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8981;&#x5B89;&#x88C5;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5305;&#x7684; <code>0.1.0</code> &#x7248;&#x672C;&#xFF0C;&#x8BF7;&#x6267;&#x884C; <code>nimble install daemonize@0.1.0</code> . &#x9664;&#x4E86;&#x6307;&#x5B9A;&#x7279;&#x5B9A;&#x7248;&#x672C;&#xFF0C;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x7248;&#x672C;&#x8303;&#x56F4;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5E0C;&#x671B;&#x5B89;&#x88C5;&#x9AD8;&#x4E8E;&#x7248;&#x672C; <code>0.1.0</code> &#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x6267;&#x884C; <code>nimble install daemonize@&gt;=0.1.0</code> &#x3002;&#x5728;  <code>@</code>  &#x5B57;&#x7B26;&#x540E;&#x4F7F;&#x7528;  <code>#</code> &#x5B57;&#x7B26;&#x4E5F;&#x652F;&#x6301;&#x6307;&#x5B9A;&#x5B58;&#x50A8;&#x5E93;&#x4FEE;&#x8BA2;&#xFF0C;&#x4F8B;&#x5982; <code>nimble install daemonize@#b4be443</code> &#x3002;</p>
<blockquote>
<p>&#x8B66;&#x544A; &#x547D;&#x4EE4;&#x884C;&#x7EC8;&#x7AEF;=&#x4E2D;&#x7684;&#x7279;&#x6B8A;&#x5B57;&#x7B26;
&#x6839;&#x636E;&#x60A8;&#x7684;shell&#xFF0C;&#x67D0;&#x4E9B;&#x5B57;&#x7B26;&#xFF08;&#x5982; <code>@</code> &#x3001; <code>&gt;</code> &#x6216; <code>=</code> &#xFF09;&#x53EF;&#x80FD;&#x88AB;&#x89C6;&#x4E3A;shell&#x8BED;&#x6CD5;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x8F6C;&#x4E49;&#xFF0C;&#x6216;&#x8005;&#x50CF;&#x8FD9;&#x6837;&#x5F15;&#x7528;&#x5305;&#x540D;&#x548C;&#x7248;&#x672C;&#xFF1A;nimble install &quot;daemonize@&gt;=0.1.0&quot;</p>
</blockquote>
<p>&#x4E3A; <code>install</code> &#x547D;&#x4EE4;&#x6307;&#x5B9A;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x5C06;&#x5BFC;&#x81F4;Nimble&#x5B89;&#x88C5;&#x591A;&#x4E2A;&#x5305;&#x3002;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x53EA;&#x9700;&#x8981;&#x7528;&#x7A7A;&#x683C;&#x9694;&#x5F00;&#x3002;</p>
<h2 id="552--install--&#x547D;&#x4EE4;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF1F;">5.5.2  <code>install</code>  &#x547D;&#x4EE4;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF1F;</h2>
<p>&#x8981;&#x4E86;&#x89E3; <code>install</code>  &#x547D;&#x4EE4;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x547D;&#x4EE4;&#xFF1A; <code>nimble install daemonize</code> &#x3002;&#x5982;&#x679C;&#x5C1A;&#x672A;&#x6267;&#x884C;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x7ACB;&#x5373;&#x6267;&#x884C;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x4E8E;<em>&#x56FE;5.8</em>&#x4E2D;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x56FE;5.7. <code>nimble install daemonize</code> &#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p><img src="Images/ch05_nimble_install.png" alt="ch05 nimble install"></p>
<p>Nimble&#x7684;&#x8F93;&#x51FA;&#x76EE;&#x524D;&#x76F8;&#x5F53;&#x5197;&#x957F;&#xFF0C;&#x4F46;&#x5B83;&#x8BD5;&#x56FE;&#x63D0;&#x4F9B;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x5B89;&#x88C5;&#x4FE1;&#x606F;&#x3002;&#x60A8;&#x5728;<em>&#x56FE;5.8</em>&#x4E2D;&#x770B;&#x5230;&#x7684;&#x8F93;&#x51FA;&#x5728;&#x60A8;&#x7684;Nimble&#x7248;&#x672C;&#x4E2D;&#x53EF;&#x80FD;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x4F46;&#x5173;&#x952E;&#x4FE1;&#x606F;&#x5E94;&#x8BE5;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;<em>&#x56FE;5.8</em>&#x4E2D;&#x6240;&#x793A;&#x7684;&#x6D88;&#x606F;&#x663E;&#x793A;&#x4E86; <code>daemonize</code> &#x5305;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x90FD;&#x88AB;&#x590D;&#x5236;&#x5230;/Users/dom/.nimble/pkgs/daemonize-0.0.2/&#x4E2D;&#x3002;</p>
<p>&#x5728;&#x7EC8;&#x7AEF;&#x7A97;&#x53E3;&#x4E2D;&#x5411;&#x4E0A;&#x6EDA;&#x52A8;&#xFF0C;&#x60A8;&#x5C06;&#x770B;&#x5230;Nimble&#x9996;&#x5148;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF1B;&#x5F00;&#x59CB;&#x4E0B;&#x8F7D;&#x5305;&#x3002;&#x4F46;&#x5728;&#x6211;&#x8BF4;&#x5230;&#x8FD9;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x5148;&#x63D0;&#x4E00;&#x4E0B;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x5728;&#x5F00;&#x59CB;&#x4E0B;&#x8F7D;&#x4E4B;&#x524D;&#xFF0C;Nimble&#x9700;&#x8981;&#x77E5;&#x9053;&#x4ECE;&#x54EA;&#x91CC;&#x4E0B;&#x8F7D; <code>daemonize</code> &#x5305;&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x67E5;&#x9605;&#x5305;&#x88F9;&#x6E05;&#x5355;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;<em>&#x56FE;5.9</em>&#x663E;&#x793A;&#x4E86;&#x6574;&#x4E2A;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x53CA;&#x5176;&#x8BB8;&#x591A;&#x5B50;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x56FE;5.8. Nimble&#x7684;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;</p>
<p><img src="Images/ch05_nimble_install_process.png" alt="ch05 nimble install process"></p>
<p>&#x5305;&#x5217;&#x8868;&#x5F53;&#x524D;&#x6258;&#x7BA1;&#x5728;Git&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;URL&#x5728;&#x540D;&#x4E3A;GitHub&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x8BBF;&#x95EE;&#x8BE5;&#x5217;&#x8868;&#xFF1A;<a href="https://github.com/nim-lang/packages" target="_blank">https://github.com/nim-lang/packages</a>. &#x5305;&#x5217;&#x8868;&#x5B58;&#x50A8;&#x5E93;&#x5B58;&#x50A8;&#x4E00;&#x4E2A; <code>packages.json</code> &#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x6709;&#x5173;&#x4E0D;&#x540C;&#x5305;&#x7684;&#x5143;&#x6570;&#x636E;&#x5217;&#x8868;&#x3002;&#x5143;&#x6570;&#x636E;&#x5305;&#x62EC;&#x6BCF;&#x4E2A;&#x5305;&#x7684;&#x540D;&#x79F0;&#x3001;URL&#x3001;&#x63CF;&#x8FF0;&#x7B49;&#x3002;Nimble&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x6B64;&#x5217;&#x8868;&#xFF0C;&#x627E;&#x5230;&#x60A8;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x5305;&#x5E76;&#x68C0;&#x7D22;&#x8BE5;&#x5305;&#x7684;URL&#x3002;&#x8FD9;&#x6837;&#xFF0C;Nimble&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x8BE5;&#x5305;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x4E0B;&#x8F7D;&#x3002;<em>&#x56FE;5.10</em>&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5728; <code>packages.json</code> &#x6587;&#x4EF6;&#x4E2D;&#x627E;&#x5230; <code>daemonize</code> &#x5305;&#x3002;</p>
<p>&#x56FE;5.9.&#x5728; <code>packages.json</code> &#x6587;&#x4EF6;&#x4E2D;&#x67E5;&#x627E;&#x6709;&#x5173; <code>daemonize</code> &#x5305;&#x7684;&#x4FE1;&#x606F;</p>
<p><img src="Images/ch05_nimble_pkg_list.png" alt="ch05 nimble pkg list"></p>
<blockquote>
<p>[&#x6CE8;&#x91CA;] &#x5305;&#x5217;&#x8868;
&#x5B58;&#x50A8;&#x5728;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x5305;&#x5217;&#x8868;<a href="https://github.com/nim-lang/packages" target="_blank">https://github.com/nim-lang/packages</a>&#x662F;Nimble&#x7684;&#x5B98;&#x65B9;&#x5305;&#x6E05;&#x5355;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x5305;&#x5217;&#x8868;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x4FDD;&#x5BC6;&#x7684;&#x5305;&#x3002;&#x4ECE;0.7.0&#x7248;&#x5F00;&#x59CB;&#xFF0C;Nimble&#x652F;&#x6301;&#x591A;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x81EA;&#x5DF1;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#x4E0E;&#x5B98;&#x65B9;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x3002;Nimble&#x81EA;&#x8FF0;&#x6587;&#x4EF6;&#x7684;<em>&#x914D;&#x7F6E;Nimble</em>&#x90E8;&#x5206;&#x89E3;&#x91CA;&#x4E86;&#x5982;&#x4F55;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;<a href="https://github.com/nim-lang/nimble#configuration" target="_blank">https://github.com/nim-lang/nimble#configuration</a></p>
</blockquote>
<p>&#x4E0B;&#x8F7D;&#x4F7F;&#x7528;Git&#x6216;Mercurial&#x5B8C;&#x6210;&#x3002;&#x4F5C;&#x4E3A;&#x4E0B;&#x8F7D;&#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;Nimble&#x68C0;&#x67E5;&#x5728;&#x8FDC;&#x7A0B;&#x5B58;&#x50A8;&#x5E93;&#x4E0A;&#x521B;&#x5EFA;&#x7684;&#x6807;&#x8BB0;&#x3002;&#x5B83;&#x89E3;&#x6790;&#x6BCF;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x7684;&#x7248;&#x672C;&#x8981;&#x6C42;&#x3002;&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#x6807;&#x7B7E;&#x6EE1;&#x8DB3;&#x7248;&#x672C;&#x8981;&#x6C42;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x9009;&#x62E9;&#x6700;&#x9AD8;&#x7248;&#x672C;<em>&#x4E0B;&#x56FE;5.11</em>&#x663E;&#x793A;&#x4E86;Nimble&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x5B89;&#x88C5;Nimble&#x5305;&#x7684;&#x54EA;&#x4E2A;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x56FE;5.10.Nimble&#x5982;&#x4F55;&#x51B3;&#x5B9A;&#x8981;&#x5B89;&#x88C5;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x8F6F;&#x4EF6;&#x5305;</p>
<p><img src="Images/ch05_nimble_install_tags.png" alt="ch05 nimble install tags"></p>
<p>&#x4E0B;&#x8F7D;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5C06;&#x8BFB;&#x53D6;&#x5305;&#x7684; .nimble&#x6587;&#x4EF6;&#x3002;Nimble&#x9A8C;&#x8BC1;&#x6B64;&#x6587;&#x4EF6;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;&#x5728;&#x5F00;&#x59CB;&#x5B89;&#x88C5;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x68C0;&#x67E5;&#x5E76;&#x9A8C;&#x8BC1;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x662F;&#x5426;&#x6B63;&#x786E;&#xFF1A;</p>
<p> <code>*</code> .nimble&#x6587;&#x4EF6;&#x7684;&#x540D;&#x79F0;&#x5FC5;&#x987B;&#x4E0E; .nimble&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x7684; <code>name</code> &#x5B57;&#x6BB5;&#x76F8;&#x5BF9;&#x5E94;&#x3002;</p>
<ul>
<li>&#x5728; .nimble&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x7684; <code>version</code> &#x7248;&#x672C;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x4E0E;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x6807;&#x8BB0;&#x7684;&#x7248;&#x672C;&#x76F8;&#x5BF9;&#x5E94;&#x3002;</li>
<li>&#x5C06;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x6587;&#x4EF6;&#x5FC5;&#x987B;&#x9075;&#x5FAA;&#x7279;&#x5B9A;&#x7684;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x3002;</li>
<li>&#x5FC5;&#x987B;&#x5B89;&#x88C5; .nimble&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x6B63;&#x786E;&#x4F9D;&#x8D56;&#x9879;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x662F;Nimble&#x6267;&#x884C;&#x7684;&#x4E00;&#x4E9B;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x68C0;&#x67E5;&#x3002;&#x5982;&#x679C;&#x524D;&#x4E09;&#x4E2A;&#x5931;&#x8D25;&#xFF0C;&#x5C06;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x4E14;&#x65E0;&#x6CD5;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x3002;&#x7F3A;&#x5C11;&#x7684;&#x4F9D;&#x8D56;&#x9879;&#x5B9E;&#x9645;&#x4E0A;&#x5C06;&#x7531;Nimble&#x81EA;&#x52A8;&#x5B89;&#x88C5;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x60A8;&#x5C06;&#x4E86;&#x89E3;&#x6709;&#x5173;&#x8FD9;&#x4E9B;&#x68C0;&#x67E5;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;Nimble&#x5305;&#x3002;</p>
<p>&#x6210;&#x529F;&#x9A8C;&#x8BC1;&#x8F6F;&#x4EF6;&#x5305;&#x540E;&#xFF0C;&#x5B89;&#x88C5;&#x5F00;&#x59CB;&#xFF0C;Nimble&#x4F1A;&#x5C06;&#x8F6F;&#x4EF6;&#x5305;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x590D;&#x5236;&#x5230;~/.nimble/pkgs/pkg-ver &#xFF0C;&#x5176;&#x4E2D; <code>ver</code> &#x662F;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x7248;&#x672C;&#xFF0C; <code>pkg</code> &#x662F;&#x8F6F;&#x4EF6;&#x7684;&#x540D;&#x79F0;&#x3002;</p>
<p>&#x8FD9;&#x53EA;&#x662F;&#x5BF9;&#x5B89;&#x88C5;Nimble&#x5305;&#x8FC7;&#x7A0B;&#x7684;&#x7B80;&#x5355;&#x6982;&#x8FF0;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E; .nimble&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x9009;&#x9879;&#x3002;</p>
<h1 id="56-&#x521B;&#x5EFA;-nimble-&#x7684;&#x8F6F;&#x4EF6;&#x5305;">5.6 &#x521B;&#x5EFA; Nimble &#x7684;&#x8F6F;&#x4EF6;&#x5305;</h1>
<p>&#x60A8;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E00;&#x7EC4;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x91CD;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;<em>&#x7B2C;3&#x7AE0;</em>&#x4E2D;&#xFF0C;&#x60A8;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x4E2A; <code>protocol</code> &#x6A21;&#x5757;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x5BF9;&#x804A;&#x5929;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x548C;&#x89E3;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x8BE5;&#x6A21;&#x5757;&#x53EF;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4ECE;&#x8BE5;&#x6A21;&#x5757;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5305;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5C06;&#x8BE5;&#x5305;&#x6DFB;&#x52A0;&#x4E3A;&#x4F9D;&#x8D56;&#x9879;&#xFF0C;&#x5E76;&#x8F7B;&#x677E;&#x4F7F;&#x7528;&#x540C;&#x4E00;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x4ECE;Nim&#x5E93;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;Nimble&#x5305;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x70B9;&#x3002;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4F7F;&#x4F9D;&#x8D56;&#x9879;&#x7684;&#x5B89;&#x88C5;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x5176;&#x4ED6;&#x4EBA;&#x5C06;&#x60A8;&#x7684;&#x5305;&#x7528;&#x4F5C;&#x81EA;&#x5DF1;&#x5305;&#x7684;&#x4F9D;&#x8D56;&#x9879;&#x3002;</p>
<p>&#x521B;&#x5EFA;Nimble&#x5305;&#x4E5F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x3002;&#x4F60;&#x6240;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;.nimble &#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x4E86;&#x3002;Nimble&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#xFF0C;&#x8BE5;&#x547D;&#x4EE4;&#x4F7F;&#x521B;&#x5EFA;&#x6B64;&#x6587;&#x4EF6;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002; <code>init</code> &#x547D;&#x4EE4;&#x5C06;&#x8BE2;&#x95EE;&#x60A8;&#x6709;&#x5173;&#x5305;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x60A8;&#x5BF9;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x56DE;&#x7B54;&#x4E3A;&#x60A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;.nimble &#x6587;&#x4EF6;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x624B;&#x52A8;&#x7F16;&#x8F91;&#x751F;&#x6210;&#x7684; .nimble&#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x81EA;&#x5B9A;&#x4E49;&#x9009;&#x9879;&#x3002;&#x4F46;&#x4E00;&#x65E6;&#x4F60;&#x4E86;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x9009;&#x9879;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x4E5F;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x660E;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x672C;&#x5730;Nimble&#x5305;&#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x60A8;&#x4E5F;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x6253;&#x5F00;&#x5305;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x5E76;&#x5C06;&#x5176;&#x53D1;&#x5E03;&#x5230;Nimble&#x7684;&#x5305;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x65B0;&#x7684;Git&#x6216;Mercurial&#x5B58;&#x50A8;&#x5E93;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4ECE;&#x672A;&#x4F7F;&#x7528;&#x8FC7;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x5EFA;&#x8BAE;&#x9009;&#x62E9;Git&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53D7;&#x5230;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x652F;&#x6301;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#xFF0C;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x53D1;&#x5E03;Nimble&#x5305;&#x3002;</p>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x4ECE;&#x5355;&#x72EC;&#x7684;Nim&#x9879;&#x76EE;&#x4E2D;&#x521B;&#x5EFA;Nimble&#x5305;&#x3002;&#x4F46;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x82B1;&#x65F6;&#x95F4;&#x521B;&#x5EFA;Nimble&#x5305;&#x5462;&#xFF1F;</p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x60A8;&#x6B63;&#x5728;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x5E93;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x6570;&#x5B57;&#x7684;&#x7B80;&#x5355;&#x8FC7;&#x7A0B;&#x3002;&#x60A8;&#x6709;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7B80;&#x5355;&#x7684;&#x8BA1;&#x7B97;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x66F4;&#x4E13;&#x4E1A;&#x7684;&#x8BA1;&#x7B97;&#x7A0E;&#x6B3E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x60A8;&#x5E0C;&#x671B;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x90FD;&#x4F7F;&#x7528;&#x60A8;&#x7684;&#x5E93;&#xFF0C;&#x6B64;&#x5916;&#xFF0C;&#x60A8;&#x8FD8;&#x5E0C;&#x671B;&#x5141;&#x8BB8;&#x5176;&#x4ED6;&#x4EBA;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5E93;&#x590D;&#x5236;&#x5E76;&#x7C98;&#x8D34;&#x5230;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65C1;&#x8FB9;&#x3002;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x538B;&#x7F29;&#x5B83;&#x5E76;&#x901A;&#x8FC7;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x53D1;&#x9001;&#x6700;&#x7EC8;&#x7684;zip&#x5B58;&#x6863;&#xFF0C;&#x5C06;&#x5176;&#x5206;&#x53D1;&#x7ED9;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F9D;&#x9760;&#x60A8;&#x5411;&#x4ED6;&#x4EEC;&#x53D1;&#x9001;&#x60A8;&#x7684;&#x5E93;&#xFF0C;&#x6D6A;&#x8D39;&#x4E86;&#x5B9D;&#x8D35;&#x7684;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65E0;&#x6CD5;&#x8F7B;&#x677E;&#x5730;&#x53D1;&#x73B0;&#x60A8;&#x7684;&#x5E93;&#x5B58;&#x5728;&#x3002;</li>
<li>&#x60A8;&#x5FC5;&#x987B;&#x624B;&#x52A8;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5177;&#x6709;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5E93;&#x3002;</li>
</ul>
<p>&#x4F7F;&#x7528;Nimble&#x6253;&#x5305;&#x5E93;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8BB8;&#x591A;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Nimble&#x7684;&#x641C;&#x7D22;&#x529F;&#x80FD;&#x8F7B;&#x677E;&#x67E5;&#x627E;&#x5E93;&#x3002;&#x60A8;&#x53EA;&#x9700;&#x4E0A;&#x4F20;&#x4E00;&#x6B21;&#x60A8;&#x7684;&#x5E93;&#xFF0C;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x60A8;&#x548C;&#x5176;&#x4ED6;&#x4EBA;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x4F7F;&#x7528;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5E93;&#x3002;</p>
<p>&#x8003;&#x8651;&#x5230;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;Nimble&#x5305;&#x3002;</p>
<h2 id="561&#x9009;&#x62E9;&#x540D;&#x79F0;">5.6.1&#x9009;&#x62E9;&#x540D;&#x79F0;</h2>
<p>&#x5305;&#x7684;&#x540D;&#x79F0;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x5B83;&#x9700;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x77ED;&#xFF0C;&#x5E76;&#x7406;&#x60F3;&#x5730;&#x63CF;&#x8FF0;&#x5305;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<blockquote>
<p>|[&#x6CE8;&#x91CA;] &#x552F;&#x4E00;&#x6027;
&#x5F53;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x786E;&#x4FDD;&#x5B83;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x60A8;&#x6253;&#x7B97;&#x5C06;&#x8FD9;&#x6837;&#x7684;&#x5305;&#x53D1;&#x5E03;&#x5230;Nimble&#x5305;&#x5B58;&#x50A8;&#x5E93;&#x65F6;&#x3002;</p>
</blockquote>
<p>&#x60A8;&#x5FC5;&#x987B;&#x9009;&#x62E9;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x8FDE;&#x5B57;&#x7B26;&#x6216;at&#x7B26;&#x53F7;&#xFF08; <code>-</code> &#x6216; <code>@</code> &#xFF09;&#x7684;&#x540D;&#x79F0;&#x3002;&#x8FD9;&#x4E9B;&#x5B57;&#x7B26;&#x7531;Nimble&#x552F;&#x4E00;&#x5904;&#x7406;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x5141;&#x8BB8;&#x5728;&#x5305;&#x540D;&#x79F0;&#x4E2D;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x672C;&#x7AE0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x60A8;&#x5C06;&#x521B;&#x5EFA;&#x7684;&#x5305;&#x5C06;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x64CD;&#x4F5C;&#x6570;&#x5B57;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x60A8;&#x5E0C;&#x671B;&#x7684;&#x4EFB;&#x4F55;&#x5305;&#x540D;&#x79F0;&#xFF0C;&#x4F46;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x4F7F;&#x7528;&#x540D;&#x79F0; <code>NimbleExample</code> &#xFF0C;&#x5E76;&#x5047;&#x8BBE;&#x60A8;&#x4E5F;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x5904;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; <code>NimbleExample</code> &#x76EE;&#x5F55;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;Nimble&#x5305;&#x3002;</p>
<h2 id="562-nimble&#x5305;&#x7684;&#x76EE;&#x5F55;&#x5E03;&#x5C40;">5.6.2 Nimble&#x5305;&#x7684;&#x76EE;&#x5F55;&#x5E03;&#x5C40;</h2>
<p>&#x6240;&#x6709;Nimble&#x5305;&#x90FD;&#x5FC5;&#x987B;&#x9075;&#x5FAA;&#x7279;&#x5B9A;&#x7684;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x3002;&#x8FD9;&#x79CD;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x5BF9;&#x4E8E;&#x5E93;&#x6BD4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x66F4;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x88AB;&#x7F16;&#x8BD1;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x7684;&#x90FD;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5E93;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x89C4;&#x5219;&#x662F;&#x5C06;&#x6240;&#x6709;&#x6A21;&#x5757;&#x653E;&#x5728;&#x4EE5;&#x5305;&#x547D;&#x540D;&#x7684;&#x5355;&#x72EC;&#x76EE;&#x5F55;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5DF2;&#x521B;&#x5EFA;&#x7684;
 <code>NimbleExample</code> &#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x53E6;&#x4E00;&#x4E2A; <code>NimbleExample</code> &#x76EE;&#x5F55;&#x3002;&#x653E;&#x7F6E;&#x5728;&#x8BE5;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x6A21;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;NimbleSample/&#x524D;&#x7F00;&#x5BFC;&#x5165;&#xFF0C;&#x4F8B;&#x5982; <code>import NimbleSexample/module</code> &#x3002;</p>
<p>&#x6B64;&#x89C4;&#x5219;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5916;&#x662F;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x5305;&#x542B;&#x5E93;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x7684;&#x5355;&#x4E2A;&#x6A21;&#x5757;&#x653E;&#x5728;&#x5305;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x4E2D;&#x3002;&#x4F46;&#x5B83;&#x5FC5;&#x987B;&#x5171;&#x4EAB;&#x60A8;&#x7684;&#x5305;&#x7684;&#x540D;&#x79F0;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6A21;&#x5757;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x4E3A; <code>NimbleExample.nim</code> &#x3002;<em>&#x56FE;5.12</em>&#x663E;&#x793A;&#x4E86; <code>NimbleExample</code> &#x7684;&#x6700;&#x7EC8;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x56FE;5.11.  <code>NimbleExample</code>  &#x76EE;&#x5F55;&#x5E03;&#x5C40;</p>
<p><img src="Images/ch05_nimble_dir_layout.png" alt="ch05 nimble dir layout"></p>
<p>&#x51FA;&#x4E8E;&#x672C;&#x793A;&#x4F8B;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x5728; <code>NimbleExample</code> &#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x4EE5;&#x4E0B;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6E05;&#x5355;5.2. <code>math.nim</code> &#x6A21;&#x5757;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> add*(a, b: <span class="hljs-built_in">int</span>): <span class="hljs-built_in">int</span> = a + b     <span class="hljs-comment"># &lt;1&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x5B9A;&#x4E49;&#x65B0;&#x7684;  <code>add</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x53D6;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#x5E76;&#x8FD4;&#x56DE;&#x8FD9;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#x7684;&#x548C;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528;  <code>*</code> &#x5BFC;&#x51FA;</1></p>
</blockquote>
<p><em>&#x6E05;&#x5355;5.3</em>&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>add</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x5C06;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#x76F8;&#x52A0;&#x3002;&#x6CE8;&#x610F;&#x7528;&#x4E8E;&#x5BFC;&#x51FA;&#x8FC7;&#x7A0B;&#x7684;  <code>*</code> &#xFF0C;&#x5B83;&#x786E;&#x4FDD;&#x53EF;&#x4EE5;&#x4ECE;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x8BBF;&#x95EE; <code>add</code> &#x8FC7;&#x7A0B;&#x3002;&#x5C06;<em>&#x6E05;&#x5355;5.3</em>&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x4FDD;&#x5B58;&#x4E3A; <code>NimbleExample/NimbleExample</code> &#x4E2D;&#x7684; <code>math.nim</code> &#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5305;&#x4E2D;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x7EA6;&#x5B9A;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x53EA;&#x80FD;&#x7531;&#x8BE5;&#x5305;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x4EEC;&#x5E94;&#x8BE5;&#x653E;&#x5728; <code>private</code>  &#x6A21;&#x5757;&#x4E2D;&#xFF0C;&#x5C31;&#x50CF;&#x4E0B;&#x9762;<em>&#x6E05;&#x5355;5.4</em>&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>utils</code>  &#x6A21;&#x5757;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6E05;&#x5355;5.3. <code>utils.nim</code> &#x6A21;&#x5757;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">proc</span> mult*(a, b: <span class="hljs-built_in">int</span>): <span class="hljs-built_in">int</span> = a * b     <span class="hljs-comment"># &lt;1&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>mult</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x53D6;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x5F53;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x76F8;&#x4E58;&#x65F6;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528; <code>*</code> &#x5BFC;&#x51FA;&#x3002;</1></p>
</blockquote>
<p>&#x5728; <code>NimbleExample/NimbleExample</code>  &#x76EE;&#x5F55;&#x4E0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>private</code> &#x76EE;&#x5F55;&#xFF0C;&#x5728;   <code>NimbleExample/NimbleExample/private</code> &#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x4FDD;&#x5B58; <em>&#x6E05;&#x5355;5.4</em> &#x7684;&#x4EE3;&#x7801;&#x4E3A; <code>utils.nim</code>  &#x3002;</p>
<p>&#x6E05;&#x5355; 5.4.   <code>data.nim</code>  &#x6A21;&#x5757;&#x3002;</p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> <span class="hljs-type">NimbleExample</span>/math              <span class="hljs-comment"># &lt;1&gt;</span>
<span class="hljs-keyword">import</span> <span class="hljs-type">NimbleExample</span>/private/utils     <span class="hljs-comment"># &lt;2&gt;</span>
<span class="hljs-keyword">let</span> age* = mult(add(<span class="hljs-number">15</span>, <span class="hljs-number">5</span>), <span class="hljs-number">2</span>)         <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x4ECE; <code>NimbleExample</code> &#x5305;&#x5BFC;&#x5165; <code>math</code> &#x6A21;&#x5757;</1></p>
<p><2> &#x4ECE; <code>NimbleExample</code> &#x5305;&#x5BFC;&#x5165;&#x79C1;&#x6709; <code>utils</code> &#x6A21;&#x5757;</2></p>
<p><3> &#x4F7F;&#x7528; <code>utils</code> &#x548C; <code>math</code> &#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x8FC7;&#x7A0B;&#x8BA1;&#x7B97;&#x5E74;&#x9F84;&#x3002; <code>age</code> &#x53D8;&#x91CF;&#x4F7F;&#x7528; <code>*</code> &#x5BFC;&#x51FA;</3></p>
</blockquote>
<p>&#x6E05;&#x5355;5.5<em>&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x6709;&#x70B9;&#x590D;&#x6742;&#x3002;&#x5B83;&#x5BFC;&#x5165; <code>NimbleExample</code> &#x5305;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E24;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x5728;</em>&#x6E05;&#x5355;5.3<em>&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>math</code> &#x6A21;&#x5757;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x5728;</em>&#x6E05;&#x5355;5.4<em>&#x4E2D;&#x5B9A;&#x4E49;&#x4E86; <code>utils</code> &#x6A21;&#x5757;&#x3002;&#x5C06;</em>&#x6E05;&#x5355;5.5*&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x4FDD;&#x5B58;&#x4E3A; <code>NimbleExample/NimbleExample</code> &#x4E2D;&#x7684; <code>data.nim</code> &#x3002;</p>
<p><em>&#x56FE;5.13</em>&#x663E;&#x793A;&#x4E86;&#x6700;&#x7EC8;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x786E;&#x4FDD;&#x672C;&#x5730;&#x76EE;&#x5F55;&#x5E03;&#x5C40;&#x76F8;&#x540C;&#x3002;</p>
<p>&#x56FE;5.12. <code>NimbleExample</code> &#x76EE;&#x5F55;&#x5E03;&#x5C40;</p>
<p><img src="Images/ch05_nimble_dir_layout.png" alt="ch05 nimble dir layout"></p>
<h2 id="563-&#x7F16;&#x5199;nimble&#x6587;&#x4EF6;&#x5E76;&#x6574;&#x7406;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;">5.6.3 &#x7F16;&#x5199;.nimble&#x6587;&#x4EF6;&#x5E76;&#x6574;&#x7406;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</h2>
<p>&#x73B0;&#x5728;&#x6A21;&#x5757;&#x90FD;&#x5DF2;&#x653E;&#x7F6E;&#x5728;&#x6B63;&#x786E;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x662F;&#x65F6;&#x5019;&#x521B;&#x5EFA; <code>NimbleExample.nimble</code>  &#x6587;&#x4EF6;&#x4E86;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x6267;&#x884C; <code>nimble init</code> &#x8FD9;&#x5C06;&#x4E3A;&#x60A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684; <code>NimbleExample.nimble</code> &#x3002;&#x56FE; 5.14 &#x663E;&#x793A;&#x4E86;&#x751F;&#x6210;&#x6E05;&#x5355; 5.6 &#x6240;&#x793A; <code>NimbleExample.nimble</code> &#x6587;&#x4EF6;&#x6240;&#x9700;&#x7684;&#x95EE;&#x9898;&#x548C;&#x7B54;&#x6848;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<p>&#x56FE; 5.13. <code>nimble init</code> &#x547D;&#x4EE4;</p>
<p><img src="Images/ch05_nimble_init.png" alt="ch05 nimble init"></p>
<p>&#x6E05;&#x5355; 5.5. <code>NimbleExample.nimble</code>  &#x7684;&#x5F00;&#x5934;</p>
<pre><code class="lang-nim"><span class="hljs-comment"># Package</span>

version       = <span class="hljs-string">&quot;0.1.0&quot;</span>
author        = <span class="hljs-string">&quot;Your Name&quot;</span>
description   = <span class="hljs-string">&quot;Simple package to learn about Nimble&quot;</span>
license       = <span class="hljs-string">&quot;MIT&quot;</span>

<span class="hljs-comment"># Dependencies</span>

requires <span class="hljs-string">&quot;nim &gt;= 0.12.0&quot;</span>
</code></pre>
<p>&#x5728;&#x6267;&#x884C; <code>nimble init</code> &#x540E;&#xFF0C;&#x5C06;&#x6E05;&#x5355; 5.6 &#x7684;&#x5185;&#x5BB9;&#x4FDD;&#x5B58;&#x4E3A; <code>NimbleExample.nimble</code> &#x4E4B;&#x540E;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x6267;&#x884C; <code>nimble install</code> &#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x6210;&#x529F;&#x5B89;&#x88C5;&#x60A8;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#xFF01;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5982;&#x4F55;&#x521B;&#x5EFA;  <code>Nimble</code>  &#x5305;&#xFF0C;&#x591A;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x4F46;&#x662F;&#x521B;&#x5EFA; Nimble &#x8F6F;&#x4EF6;&#x5305;&#x53EA;&#x662F;&#x5F00;&#x53D1; Nimble &#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x4E00;&#x5C0F;&#x6B65;&#x3002;&#x8F6F;&#x4EF6;&#x5305;&#x5728;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x9700;&#x6C42;&#x4E5F;&#x4F1A;&#x968F;&#x4E4B;&#x53D8;&#x5316;&#xFF0C;&#x90A3;&#x4E48; Nimble &#x5982;&#x4F55;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5462;&#xFF1F;</p>
<p>&#x5728;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x5305;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x5929;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x60A8;&#x9700;&#x8981;&#x53E6;&#x4E00;&#x4E2A; Nim &#x5E93;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6B64;&#x5E93;&#x5C06;&#x662F;&#x4E00;&#x4E2A; Nimble &#x5305;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x4E3A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6574;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x7684; <code>add</code> &#xFF0C;&#x8FD9;&#x4E9B;&#x6574;&#x6570;&#x5927;&#x4E8E; Nim &#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x7684;&#x6700;&#x5927;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x3002;&#x8BE5; <code>bigints</code> &#x5305;&#x63D0;&#x4F9B;&#x6B64;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x6253;&#x5F00;&#x5305;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5E76;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x4F7F;&#x5176;&#x5185;&#x5BB9;&#x4E0E;&#x6E05;&#x5355; 5.7 &#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x76F8;&#x540C;&#x3002;&#x66F4;&#x6539;&#x4EE5;&#x7C97;&#x4F53;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x3002;math.nimNimbleExample</p>
<p>&#x6E05;&#x5355; 5.6. &#x5728; <code>math</code> &#x6A21;&#x5757;&#x4E2D;&#x4F7F;&#x7528; <code>bigints</code> &#x5305; </p>
<pre><code class="lang-nim"><span class="hljs-keyword">import</span> bigints     <span class="hljs-comment"># &lt;1&gt;</span>
<span class="hljs-keyword">proc</span> add*(a, b: <span class="hljs-built_in">int</span>): <span class="hljs-built_in">int</span> = a + b
<span class="hljs-keyword">proc</span> add*(a, b: <span class="hljs-type">BigInt</span>): <span class="hljs-type">BigInt</span> = a + b     <span class="hljs-comment"># &lt;2&gt;</span>
</code></pre>
<blockquote>
<p><1>    &#x4ECE;bigints&#x5305;&#x4E2D;&#x5BFC;&#x5165;&#x6A21;&#x5757;&#x3002;&#x65E0;&#x9700;&#x663E;&#x5F0F;&#x58F0;&#x660E;bigints&#x5305;&#x540D;&#x79F0;&#x548C;&#x6A21;&#x5757;&#x540D;&#x79F0;&#x3002;</1></p>
<p><2>    &#x4E3A;bigints&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;BigInt&#x7C7B;&#x578B;&#x5B9A;&#x4E49;add&#x8FC7;&#x7A0B;&#x3002;</2></p>
</blockquote>
<p>&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x6267;&#x884C; <code>nim c NimbleExample/mathmath.nim</code> &#x6765;&#x7F16;&#x8BD1;&#x5B83;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x5E94;&#x8F93;&#x51FA;&#x7C7B;&#x4F3C;&#x4E8E;(1, 8) Error: cannot open &apos;bigints&apos;bigintsbigints &#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x6307;&#x5411;&#x5BFC;&#x5165;&#x6A21;&#x5757;&#x7684;&#x4EE3;&#x7801;&#x884C;&#x3002;&#x7F16;&#x8BD1;&#x5931;&#x8D25;&#x7684;&#x539F;&#x56E0;&#x662F;&#x5C1A;&#x672A;&#x5B89;&#x88C5;&#x5305;&#x3002;&#x7ACB;&#x5373;&#x901A;&#x8FC7;&#x6267;&#x884C;  <code>nimble install bigintsNimbleExample/math</code>  &#x5B89;&#x88C5;&#x5B83;&#x3002;&#x73B0;&#x5728;&#x518D;&#x6B21;&#x7F16;&#x8BD1;&#x3002;&#x8FD9;&#x6B21;&#x7F16;&#x8BD1;&#x5E94;&#x8BE5;&#x4F1A;&#x6210;&#x529F;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x5426;&#x610F;&#x5473;&#x7740;NimbleExample&#x5305;&#x7684;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x90FD;&#x9700;&#x8981;&#x624B;&#x52A8;&#x5B89;&#x88C5;bigints&#x5305;&#xFF1F;&#x76EE;&#x524D;&#xFF0C;&#x662F;&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x5C31;&#x662F;NimbleExample.nimble&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4F9D;&#x8D56;&#x89C4;&#x8303;&#x7684;&#x6765;&#x6E90;&#x3002;</p>
<p>&#x4F7F;&#x7528; Nim &#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x4EFB;&#x4F55; Nim &#x6E90;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x60A8;&#x4F7F;&#x7528; Nimble &#x5B89;&#x88C5;&#x7684;&#x6BCF;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#x90FD;&#x5C06;&#x53EF;&#x7528;&#x4E8E;&#x8BE5;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x5B89;&#x88C5; <code>bigints</code> &#x5305;&#x540E;&#x7ACB;&#x5373;&#x5BFC;&#x5165; <code>bigints</code> &#x6A21;&#x5757;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p><strong>&#x5168;&#x5C40; Nimble &#x5305;&#x548C; Nim &#x7F16;&#x8BD1;&#x5668;</strong></p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528; Nimble &#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x65F6;&#xFF0C;&#x8BE5;&#x8F6F;&#x4EF6;&#x5305;&#x5C06;&#x5B89;&#x88C5;&#x5230;&#x5F53;&#x524D;&#x7528;&#x6237;&#x7684; Nimble &#x8F6F;&#x4EF6;&#x5305;&#x5B58;&#x50A8;&#x533A;&#x4E2D;&#xFF0C;&#x8BE5;&#x5B58;&#x50A8;&#x533A;&#x4F4D;&#x4E8E;~/.nimble/. &#x6BCF;&#x6B21;&#x4F7F;&#x7528; Nim &#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1; Nim &#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x8BE5;&#x6A21;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x5BFC;&#x5165;&#x5C5E;&#x4E8E; Nimble &#x5305;&#x5B58;&#x50A8;&#x533A;&#x4E2D;&#x4EFB;&#x4F55;&#x5305;&#x7684;&#x4EFB;&#x4F55;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5B89;&#x88C5;&#x4E86;&#x540C;&#x4E00;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Nim&#x5C06;&#x53EA;&#x4F7F;&#x7528;&#x6700;&#x65B0;&#x7684;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528; Nimble &#x7F16;&#x8BD1;&#x76F8;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x3002;Nimble&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x547D;&#x4EE4; <code>c</code> &#xFF0C;&#x5B83;&#x5B8C;&#x5168;&#x6309;&#x7167;Nim&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x7F16;&#x8BD1;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x73B0;&#x5728;&#x6267;&#x884C; <code>nimble c NimbleExample/math</code> &#x5E76;&#x8BB0;&#x4E0B;&#x7ED3;&#x679C;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x5931;&#x8D25;&#x611F;&#x5230;&#x60CA;&#x8BB6;&#xFF0C;&#x4F46;&#x5B83;&#x8BF4;&#x660E;&#x4E86;&#x76F4;&#x63A5;&#x4F7F;&#x7528; Nim &#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x548C;&#x4F7F;&#x7528; Nimble &#x7F16;&#x8BD1;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x952E;&#x533A;&#x522B;&#x3002;Nimble &#x4E0D;&#x5141;&#x8BB8;&#x60A8;&#x5BFC;&#x5165;&#x4EFB;&#x4F55;&#x672A;&#x5728;&#x9879;&#x76EE;&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x4E3A;&#x4F9D;&#x8D56;&#x9879;&#x7684;.nimble&#x6A21;&#x5757;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x6539; <code>NimbleExample.nimble</code> &#x6587;&#x4EF6;&#xFF0C;&#x4F7F;&#x5176;&#x5305;&#x542B; <code>bigints</code> &#x5305;&#x4F5C;&#x4E3A;&#x4F9D;&#x8D56;&#x9879;&#x3002;&#x6E05;&#x5355; 5.8 &#x663E;&#x793A;&#x4E86; <code>NimbleExample.nimble</code> &#x6587;&#x4EF6;&#x73B0;&#x5728;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5DEE;&#x5F02;&#x4EE5;&#x7C97;&#x4F53;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x3002;</p>
<p>&#x6E05;&#x5355; 5.7.&#x6DFB;&#x52A0;&#x5BF9; <code>bigints</code> &#x5305;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;</p>
<pre><code class="lang-nim"><span class="hljs-comment"># Package</span>

version       = <span class="hljs-string">&quot;0.1.0&quot;</span>
author        = <span class="hljs-string">&quot;Your Name&quot;</span>
description   = <span class="hljs-string">&quot;Simple package to learn about Nimble&quot;</span>
license       = <span class="hljs-string">&quot;MIT&quot;</span>

<span class="hljs-comment"># Dependencies</span>

requires <span class="hljs-string">&quot;nim &gt;= 0.12.0, **bigints**&quot;</span>
</code></pre>
<p>&#x6E05;&#x5355; 5.8 &#x4E2D;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x5BF9;&#x8BE5; <code>bigints</code> &#x5305;&#x7684;&#x7248;&#x672C;&#x7684;&#x8981;&#x6C42;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Nimble &#x5C06;&#x5C1D;&#x8BD5;&#x5B89;&#x88C5;&#x8BE5;&#x5E93;&#x7684;&#x6700;&#x65B0;&#x6807;&#x8BB0;&#x7248;&#x672C;&#xFF0C;&#x5373;&#x5047;&#x8BBE;&#x5C1A;&#x672A;&#x5B89;&#x88C5;&#x8BE5;&#x5E93;&#x3002;</p>
<blockquote>
<p>&#x5F00;&#x53D1;&#x7248;&#x672C;&#x4F9D;&#x8D56;:&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x5305;&#x540D;&#x79F0;&#x540E;&#x6307;&#x5B9A;#head&#xFF0C;&#x4F8B;&#x5982; <code>bigints#head</code>  &#x3002;&#x8FD9;&#x5C06;&#x4F7F; Nimble &#x59CB;&#x7EC8;&#x4F7F;&#x7528;&#x8BE5;&#x5305;&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#x7F16;&#x8BD1;&#x60A8;&#x7684;&#x5305;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x56FE; 5.15 &#x663E;&#x793A;&#x4E86;&#x6307;&#x5B9A;&#x548C;&#x4E0D;&#x6307;&#x5B9A;#head&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x3002;</p>
</blockquote>
<p>&#x56FE; 5.14. &#x6709;#head&#x4E0E;&#x65E0;#head &#x5B89;&#x88C5;&#x6807;&#x7B7E;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;</p>
<p><img src="Images/ch05_nimble_install_tags.png" alt="pic"></p>
<p>&#x4E00;&#x65E6;&#x4F60;&#x66F4;&#x6539;&#x4E86; <code>NimbleExample.nimble</code> &#x6587;&#x4EF6;&#x4EE5;&#x5339;&#x914D;&#x6E05;&#x5355; 5.8&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x4F7F;&#x7528; Nimble &#x6210;&#x529F;&#x7F16;&#x8BD1; <code>math</code> &#x6A21;&#x5757;&#x3002;&#x5982;&#x679C;&#x68C0;&#x6D4B;&#x5230; <code>bigints</code> &#x8F6F;&#x4EF6;&#x5305;&#x672A;&#x5B89;&#x88C5;&#xFF0C;Nimble &#x751A;&#x81F3;&#x4F1A;&#x81EA;&#x52A8;&#x4E3A;&#x60A8;&#x5B89;&#x88C5;&#x8BE5;&#x8F6F;&#x4EF6;&#x5305;&#xFF01;&#x4E0B;&#x9762;&#x7684;&#x56FE; 5.16 &#x663E;&#x793A;&#x4E86;&#x4F7F;&#x7528; <code>nim c</code> &#x548C; <code>nimble c</code> &#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x662F;&#x5426;&#x5B89;&#x88C5;&#x4E86; <code>bigints</code> &#x8F6F;&#x4EF6;&#x5305;&#x3002;</p>
<p>&#x56FE; 5.15.  <code>nim c</code> &#x4E0E; <code>nimble c</code> </p>
<p><img src="Images/ch05_nimble_c_nim.png" alt="ch05 nimble c nim"></p>
<p>&#x60A8;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5BF9; Nimble &#x5982;&#x4F55;&#x5904;&#x7406;&#x4F9D;&#x8D56;&#x9879;&#x6709;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x5177;&#x5907;&#x521B;&#x5EFA;&#x66F4;&#x591A; Nimble &#x5305;&#x6240;&#x9700;&#x7684;&#x77E5;&#x8BC6;&#x3002;&#x4ECD;&#x7136;&#x7F3A;&#x5C11;&#x4E00;&#x6761;&#x77E5;&#x8BC6;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x53D1;&#x5E03; Nimble &#x5305;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x6D41;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x8282;&#x8BA8;&#x8BBA;&#x53D1;&#x5E03; Nimble &#x5305;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x60F3;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x7684;&#x6311;&#x6218;&#x3002;&#x5728;&#x6B64;&#x5305;&#x7684;&#x67D0;&#x4E9B;&#x6A21;&#x5757;&#x4E2D;&#x4E3A;&#x6B64; Nimble &#x5305;&#x7F16;&#x5199;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528; Nimble &#x7684; <code>c</code>  &#x547D;&#x4EE4;&#x8FD0;&#x884C;&#x8FD9;&#x4E9B;&#x6D4B;&#x8BD5;&#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x5165;&#x95E8;&#xFF1A; <code>nimble c -r NimbleExample/math</code> &#xFF0C; <code>-r</code> &#x6807;&#x5FD7;&#x5C06;&#x610F;&#x5473;&#x7740;&#x751F;&#x6210;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x5728;&#x7F16;&#x8BD1;&#x540E;&#x81EA;&#x52A8;&#x8FD0;&#x884C;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#x5C06;&#x60A8;&#x7684;&#x6D4B;&#x8BD5;&#x653E;&#x5728;when isMainModule:&#x8BED;&#x53E5;&#x4E0B;&#xFF0C;&#x6B64;&#x8BED;&#x53E5;&#x53EF;&#x786E;&#x4FDD;&#x4EC5;&#x5728;&#x76F4;&#x63A5;&#x7F16;&#x8BD1; <code>math</code> &#x6A21;&#x5757;&#x65F6;&#x6267;&#x884C;&#x5176;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x3002;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BFC;&#x5165; <code>math</code> &#x6A21;&#x5757;&#x65F6;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x6D4B;&#x8BD5;&#x3002;</p>
<h3 id="57-&#x53D1;&#x5E03;nimble&#x5305;">5.7 &#x53D1;&#x5E03;Nimble&#x5305;</h3>
<p>&#x5C06; Nimble &#x8F6F;&#x4EF6;&#x5305;&#x53D1;&#x5E03;&#x5230;&#x5B98;&#x65B9;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#x7684;&#x8FC7;&#x7A0B;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x3002;&#x4F46;&#x5728;&#x53D1;&#x5E03;&#x5305;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x7ECF;&#x8FC7;&#x5BA1;&#x6279;&#x8FC7;&#x7A0B;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x5BA1;&#x6279;&#x8FC7;&#x7A0B;&#x4E0D;&#x662F;&#x5F88;&#x4E25;&#x683C;&#xFF0C;&#x53EA;&#x8981;&#x60A8;&#x7684;&#x5305;&#x7684;&#x540D;&#x79F0;&#x4E0D;&#x4E0E;&#x5217;&#x8868;&#x4E2D;&#x5DF2;&#x6709;&#x7684;&#x4EFB;&#x4F55;&#x73B0;&#x6709;&#x5305;&#x51B2;&#x7A81;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x88AB;&#x63A5;&#x53D7;&#x3002;</p>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5728;&#x53D1;&#x5E03;&#x5305;&#x4E4B;&#x524D;&#xFF0C;&#x5FC5;&#x987B;&#x5148;&#x5C06;&#x5176;&#x4E0A;&#x4F20;&#x5230; Git &#x6216; Mercurial &#x5B58;&#x50A8;&#x5E93;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#xFF0C;&#x4F8B;&#x5982; Github &#x6216; BitBucket&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x5728;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x521D;&#x59CB;&#x5316; Git &#x6216; Mercurial &#x5B58;&#x50A8;&#x5E93;&#x3002;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x521B;&#x5EFA; Git &#x5B58;&#x50A8;&#x5E93;&#x3002;&#x5B58;&#x50A8;&#x5E93;&#x7C7B;&#x578B;&#x7684;&#x9009;&#x62E9;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x504F;&#x597D;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728; Git &#x88AB;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x8BA9;&#x6211;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x521B;&#x5EFA;&#x5B58;&#x50A8;&#x5E93;&#x3002;</p>
<blockquote>
<p>[&#x6CE8;]    &#x7248;&#x672C;&#x63A7;&#x5236;
&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#x63A7;&#x5236;&#x3001;Git &#x548C; Mercurial &#x7684;&#x7EC6;&#x8282;&#x4E0D;&#x5728;&#x672C;&#x4E66;&#x7684;&#x8BA8;&#x8BBA;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x719F;&#x6089;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x60A8;&#x8FDB;&#x4E00;&#x6B65;&#x9605;&#x8BFB;&#x5B83;&#x4EEC;&#x3002;    </p>
</blockquote>
<p>&#x5728;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x8FD8;&#x6CA1;&#x6709;&#x5E10;&#x6237;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5728; <a href="http://github.com" target="_blank">http://github.com</a> &#x4E0A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5E10;&#x6237;&#x3002;&#x73B0;&#x5728;&#x5C31;&#x53BB;&#x90A3;&#x91CC;&#x5427;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x5E10;&#x6237;&#x5E76;&#x767B;&#x5F55;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x5355;&#x51FB;&#x6807;&#x8BB0;&#x4E3A;&#x65B0;&#x5EFA;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x6309;&#x94AE;&#x5728; GitHub &#x4E0A;&#x521B;&#x5EFA;&#x65B0;&#x7684; Git &#x5B58;&#x50A8;&#x5E93;&#x3002;&#x5982;&#x679C;&#x60A8;&#x627E;&#x4E0D;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x6309;&#x94AE;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5BFC;&#x822A;&#x5230;&#x4EE5;&#x4E0B; URL&#xFF1A;<a href="https://github.com/new&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x4F1A;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x4E8E;&#x56FE;" target="_blank">https://github.com/new&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x4F1A;&#x770B;&#x5230;&#x7C7B;&#x4F3C;&#x4E8E;&#x56FE;</a> 5.17 &#x4E2D;&#x7684;&#x5C4F;&#x5E55;&#x622A;&#x56FE;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x56FE; 5.16.&#x5728; Github &#x4E0A;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5B58;&#x50A8;&#x5E93;</p>
<p><img src="Images/ch05_github_new_repo.png" alt="ch05 github new repo"></p>
<p>&#x6307;&#x5B9A;&quot;NimbleExample&quot;&#x4F5C;&#x4E3A;&#x5B58;&#x50A8;&#x5E93;&#x540D;&#x79F0;&#xFF0C;&#x7136;&#x540E;&#x5355;&#x51FB;&#x7EFF;&#x8272;&#x7684;&#x521B;&#x5EFA;&#x5B58;&#x50A8;&#x5E93;&#x6309;&#x94AE;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x5C06;&#x770B;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#xFF0C;&#x8BE5;&#x7F51;&#x9875;&#x5C06;&#x8BA9;&#x60A8;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#x521B;&#x5EFA;&#x5B58;&#x50A8;&#x5E93;&#x3002;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x6307;&#x4EE4;&#x975E;&#x5E38;&#x901A;&#x7528;&#xFF0C;&#x6E05;&#x5355; 5.9 &#x663E;&#x793A;&#x4E86;&#x7C7B;&#x4F3C;&#x4E8E;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x662F;&#x4E3A;&#x6210;&#x529F;&#x5C06; <code>NimbleExample</code> &#x5305;&#x4E0A;&#x4F20;&#x5230; GitHub &#x800C;&#x5B9A;&#x5236;&#x7684;&#x3002;&#x7ACB;&#x5373;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x6E05;&#x5355; 5.8.&#x7528;&#x4E8E;&#x5C06; <code>NimbleExample</code> &#x5305;&#x4E0A;&#x8F7D;&#x5230; GitHub &#x7684;&#x547D;&#x4EE4;&#x3002;</p>
<pre><code class="lang-bash">git init
git add NimbleExample.nimble NimbleExample/data.nim NimbleExample/math.nim NimbleExample/private/utils.nim
git commit -m <span class="hljs-string">&quot;first commit&quot;</span>
git remote add origin git@github.com:&lt;your-user-name&gt;/NimbleExample.git     <span class="hljs-comment"># &lt;1&gt;</span>
git push -u origin master
</code></pre>
<blockquote>
<p><1>    &#x8BB0;&#x5F97;&#x628A;  <code>&lt;your-user-name&gt;</code>  &#x6539;&#x6210;&#x4F60;&#x7684;Github&#x7528;&#x6237;&#x540D;&#xFF01;</1></p>
</blockquote>
<p>&#x6210;&#x529F;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x540E;&#xFF0C;&#x5BFC;&#x822A;&#x5230; <a href="https://github.com/&lt;your-user-name%3E/NimbleExample" target="_blank">https://github.com/\<your-user-name>/NimbleExample</your-user-name></a>  &#x5E94;&#x4F1A;&#x663E;&#x793A; <code>NimbleExample.nimble</code> &#x6587;&#x4EF6;&#x5217;&#x8868;&#x3002;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x5E94;&#x5305;&#x62EC;  <code>NimbleExample</code> &#x6587;&#x4EF6;&#x3001;&#x76EE;&#x5F55;&#x53CA;&#x5176;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x53EA;&#x5269;&#x4E0B;&#x4E00;&#x4EF6;&#x4E8B;&#x8981;&#x505A;&#x3002;&#x8BE5;&#x8F6F;&#x4EF6;&#x5305;&#x662F;&#x516C;&#x5F00;&#x7684;&#xFF0C;&#x4F46; Nimble &#x5C1A;&#x672A;&#x627E;&#x5230;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C1A;&#x672A;&#x6DFB;&#x52A0;&#x5230;&#x5176;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x5C06;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x6267;&#x884C; <code>nimble install NimbleExample</code> &#x6765;&#x5B89;&#x88C5;&#x5B83;&#x3002;</p>
<p>Nimble&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#xFF0C;&#x4F46;&#x5B98;&#x65B9;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#x662F;&#x4F7F;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x3002;&#x5B98;&#x65B9;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#x5B58;&#x50A8;&#x5728;&#x4F4D;&#x4E8E;&#x6B64;&#x5904;&#x7684; GitHub &#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#xFF1A;<a href="https://github.com/nim-lang/packages" target="_blank">https://github.com/nim-lang/packages</a>&#x3002;&#x6BCF;&#x5F53;&#x7528;&#x6237;&#x60F3;&#x8981;&#x5C06;&#x5305;&#x6DFB;&#x52A0;&#x5230;&#x6B64;&#x5305;&#x5217;&#x8868;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x79F0;&#x4E3A;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x521B;&#x5EFA;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#x540E;&#xFF0C;Nim &#x793E;&#x533A;&#x786E;&#x4FDD;&#x53EF;&#x4EE5;&#x5C06;&#x5305;&#x6DFB;&#x52A0;&#x5230;&#x5305;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x68C0;&#x67E5;&#x5305;&#x7684;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#xFF0C;&#x4F8B;&#x5982;&#x5305;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5B83;&#x4E0D;&#x4F1A;&#x4E0E;&#x5217;&#x8868;&#x4E2D;&#x5DF2;&#x6709;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5305;&#x7684;&#x540D;&#x79F0;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x5728;&#x53D1;&#x5E03;&#x5305;&#x4E4B;&#x524D;&#xFF0C;&#x6700;&#x597D;&#x786E;&#x4FDD;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x5B89;&#x88C5;&#x5305;&#x3002;&#x5728;&#x5305;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#x6267;&#x884C;&#x4EE5;&#x9A8C;&#x8BC1;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x5B89;&#x88C5;&#x3002;
 <code>nimble install</code> </p>
<p>&#x7136;&#x540E;&#xFF0C;&#x5305;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x5E03;&#x4E86;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x521B;&#x5EFA;&#x62C9;&#x53D6;&#x8BF7;&#x6C42;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Nimble &#x7684;  <code>publish</code> &#x547D;&#x4EE4;&#x3002;&#x7ACB;&#x5373;&#x6267;&#x884C; <code>nimble publish</code> &#x5E76;&#x6309;&#x7167;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x63D0;&#x793A;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x8BE5;&#x8FC7;&#x7A0B;&#x6709;&#x4E9B;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x9700;&#x8981;&#x60A8;&#x4E3A; Nimble &#x521B;&#x5EFA;&#x65B0;&#x7684; GitHub &#x8BBF;&#x95EE;&#x4EE4;&#x724C;&#x3002;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#x4E86;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x5927;&#x5927;&#x7B80;&#x5316;&#x53D1;&#x5E03; Nimble &#x5305;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5F53;&#x60A8;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x88AB;&#x63A5;&#x53D7;&#x5E76;&#x6DFB;&#x52A0;&#x5230;&#x8F6F;&#x4EF6;&#x5305;&#x5217;&#x8868;&#x4E2D;&#x65F6;&#xFF0C;&#x60A8;&#x5C06;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x6267;&#x884C;  <code>nimble install NimbleExample</code>  &#x6765;&#x5B89;&#x88C5;&#x5B83;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x53D1;&#x5E03; Nimble &#x5305;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x3002;&#x5728;&#x5F00;&#x53D1;&#x65B0;&#x7248;&#x672C;&#x5305;&#x65F6;&#xFF0C;&#x65E0;&#x9700;&#x518D;&#x6B21;&#x53D1;&#x5E03;&#x5305;&#xFF0C;&#x800C;&#x662F;&#x6807;&#x8BB0;&#x7248;&#x672C;&#xFF0C;&#x60A8;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#x627E;&#x5230;&#x3002;</p>
<h2 id="58-&#x5F00;&#x53D1;&#x4E00;&#x4E2A;nimble&#x8F6F;&#x4EF6;&#x5305;">5.8 &#x5F00;&#x53D1;&#x4E00;&#x4E2A;Nimble&#x8F6F;&#x4EF6;&#x5305;</h2>
<p>&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x901A;&#x5E38;&#x88AB;&#x8D4B;&#x4E88;&#x7248;&#x672C;&#x6765;&#x786E;&#x5B9A;&#x5176;&#x72B6;&#x6001;&#x3002;&#x8F6F;&#x4EF6;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x65B0;&#x7684;&#x5F00;&#x53D1;&#x4F7F;&#x7528;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x7684;&#x7248;&#x672C;&#x53F7;&#x8FDB;&#x884C;&#x6807;&#x8BB0;&#x3002; <code>NimbleExample</code> &#x8F6F;&#x4EF6;&#x5305;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x8BE5;&#x8F6F;&#x4EF6;&#x5305;&#x4EE5; <code>0.1.0</code> &#x7248;&#x672C;&#x5F00;&#x59CB;&#x5176;&#x751F;&#x547D;&#xFF0C;&#x5982;&#x679C;&#x7EE7;&#x7EED;&#x5F00;&#x53D1;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x5929;&#x53EF;&#x80FD;&#x4F1A;&#x8FBE;&#x5230;&#x7248;&#x672C; <code>1.0</code> &#x751A;&#x81F3; <code>10.3</code> .&#x7248;&#x672C;&#x53EF;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x533A;&#x5206;&#x548C;&#x8BC6;&#x522B;&#x5305;&#x7684;&#x4E0D;&#x540C;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x5305;&#x7684;&#x7248;&#x672C;&#x4FE1;&#x606F;&#x5B58;&#x50A8;&#x5728;&#x5305;&#x7684;.nimble&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x5B83;&#x662F;&#x4F7F;&#x7528;&#x952E;&#x503C; <code>version</code> &#x6307;&#x5B9A;&#x7684;&#x3002;&#x7248;&#x672C;&#x5FC5;&#x987B;&#x81F3;&#x5C11;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x591A;&#x4E2A;&#x6570;&#x5B57;&#x5FC5;&#x987B;&#x7528;&#x53E5;&#x70B9;&#x5206;&#x9694;&#x3002;&#x4F8B;&#x5982;version = &quot;1.42.5&quot;&#x3002;</p>
<h3 id="581-&#x8D4B;&#x4E88;&#x7248;&#x672C;&#x53F7;&#x542B;&#x4E49;">5.8.1 &#x8D4B;&#x4E88;&#x7248;&#x672C;&#x53F7;&#x542B;&#x4E49;</h3>
<p>&#x7248;&#x672C;&#x53F7;&#x7684;&#x5206;&#x914D;&#x548C;&#x9012;&#x589E;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; <code>1.0</code> &#x7248;&#x672C;&#x53F7;&#x9664;&#x4E86;&#x8868;&#x793A;&#x7248;&#x672C;&#x6BD4; <code>0.5</code> &#x7248;&#x672C;&#x65B0;&#x4E4B;&#x5916;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x610F;&#x4E49;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#x4F7F;&#x7528;&#x8BED;&#x4E49;&#x7248;&#x672C;&#x63A7;&#x5236;&#xFF0C;&#x7248;&#x672C;&#x53F7;&#x4F1A;&#x544A;&#x8BC9;&#x60A8;&#x6709;&#x5173;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x8F6F;&#x4EF6;&#x7684; API &#x517C;&#x5BB9;&#x6027;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x8BED;&#x4E49;&#x7248;&#x672C;&#x63A7;&#x5236;&#x662F;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x7531;&#x4E09;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x7684;&#x7248;&#x672C;&#x53F7;&#x7684;&#x7EA6;&#x5B9A;&#xFF1A;&#x4E3B;&#x8981;&#x7248;&#x672C;&#x3001;&#x6B21;&#x8981;&#x7248;&#x672C;&#x548C;&#x4FEE;&#x8865;&#x7A0B;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x4E0D;&#x5F71;&#x54CD;&#x8F6F;&#x4EF6; API &#x7684;&#x5C0F;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x548C;&#x66F4;&#x6539;&#xFF0C;&#x4FEE;&#x8865;&#x7A0B;&#x5E8F;&#x5C06;&#x9012;&#x589E;&#x3002;&#x5F53;&#x5BF9;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#x6DFB;&#x52A0;&#x65F6;&#xFF0C;&#x6B21;&#x8981;&#x5185;&#x5BB9;&#x5C06;&#x9012;&#x589E;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5F53;&#x8F6F;&#x4EF6;&#x7684; API &#x66F4;&#x6539;&#x4E3A;&#x4E0D;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x4E3B;&#x8981;&#x7248;&#x672C;&#x5C06;&#x9012;&#x589E;&#x3002;&#x5B8C;&#x6574;&#x7684;&#x8BED;&#x4E49;&#x7248;&#x672C;&#x63A7;&#x5236;&#x89C4;&#x8303;&#x53EF;&#x5728;  <a href="http://semver.org" target="_blank">http://semver.org</a> &#x4E2D;&#x627E;&#x5230;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x80FD;&#x60F3;&#x4E3A;&#x5305;&#x7248;&#x672C;&#x63A7;&#x5236;&#x65B9;&#x6848;&#x63D0;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x89C4;&#x5219;&#x3002;&#x4F46;&#x6211;&#x7EDD;&#x5BF9;&#x5EFA;&#x8BAE;&#x5BF9;&#x4F60;&#x7684; Nimble &#x5305;&#x4F7F;&#x7528;&#x8BED;&#x4E49;&#x7248;&#x672C;&#x63A7;&#x5236;&#x3002;</p>
<h3 id="582-&#x5B58;&#x50A8;&#x5355;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;">5.8.2 &#x5B58;&#x50A8;&#x5355;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;</h3>
<p>&#x5BF9;&#x4E8E;&#x7248;&#x672C;&#x63A7;&#x5236;&#x548C; Nimble &#x5305;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6CA1;&#x6709;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684; Git &#x6216; Mercurial &#x5B58;&#x50A8;&#x5E93;&#x7684;&#x672C;&#x5730; Nimble &#x5305;&#x5177;&#x6709;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x3002;&#x8FD9;&#x662F;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x3002;.nimble</p>
<p>&#x5177;&#x6709;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684; Git &#x6216; Mercurial &#x5B58;&#x50A8;&#x5E93;&#x7684;&#x672C;&#x5730; Nimble &#x5305;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x68C0;&#x7D22;&#x8FD9;&#x4E9B;&#x5305;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x50A8;&#x5E93;&#x5305;&#x542B;&#x5305;&#x7684;&#x5B8C;&#x6574;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x68C0;&#x7D22;&#x4EE5;&#x524D;&#x7248;&#x672C;&#x7684;&#x5305;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#x3002;&#x8FD9;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x8FDC;&#x7A0B; Nimble &#x5305;&#xFF0C;&#x5B83;&#x4EEC;&#x76EE;&#x524D;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x6B64;&#x7C7B;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x3002;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D;&#x6B64;&#x5B58;&#x50A8;&#x5E93;&#xFF0C;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x7248;&#x672C;&#x7684; Nimble &#x5305;&#x7684;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x5E93;&#x3002;</p>
<p>&#x56FE; 5.17.&#x6CA1;&#x6709;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x672C;&#x5730; Nimble &#x5305;&#x4E0E;&#x5177;&#x6709; Git &#x5B58;&#x50A8;&#x5E93;&#x7684;&#x672C;&#x5730; Nimble &#x5305;</p>
<p><img src="Images/ch05_repo_versioning.png" alt="ch05 repo versioning"></p>
<p>&#x5728;&#x5F00;&#x53D1; Nimble &#x8F6F;&#x4EF6;&#x5305;&#x65F6;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x8BB0;&#x4F4F;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;Nimble&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x5728;Nimble&#x8F6F;&#x4EF6;&#x5305;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x7684;&#x6807;&#x7B7E;&#x6765;&#x8BC6;&#x522B;&#x5B58;&#x50A8;&#x67D0;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x70B9;&#x3002;</p>
<p>&#x6BCF;&#x5F53;&#x4F60;&#x60F3;&#x8981;&#x53D1;&#x5E03;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5305;&#x65F6;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6309;&#x7167;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x64CD;&#x4F5C;&#xFF1A;</p>
<ul>
<li>1.&#x9012;&#x589E;.nimble&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x53F7;&#x3002;</li>
<li>2.&#x5C06;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x63D0;&#x4EA4;&#x5230;&#x5B58;&#x50A8;&#x5E93;&#x4E2D;&#x3002;&#x4F8B;&#x5982;&#xFF1A;git commit -am &quot;Version 0.1.2&quot;&#x3002;</li>
<li>3.&#x6807;&#x8BB0;&#x60A8;&#x521A;&#x521A;&#x8FDB;&#x884C;&#x7684;&#x63D0;&#x4EA4;&#xFF0C;&#x4F7F;&#x7528;&#x65B0;&#x7248;&#x672C;&#x53F7;&#x4F5C;&#x4E3A;&#x6807;&#x8BB0;&#x540D;&#x79F0;&#x3002;&#x4F8B;&#x5982;&#xFF1A; <code>git tag v0.1.2</code> &#x3002;</li>
<li>4.&#x5C06;&#x66F4;&#x6539;&#x4E0A;&#x4F20;&#x5230;&#x8FDC;&#x7A0B;&#x5B58;&#x50A8;&#x5E93;&#xFF0C;&#x786E;&#x4FDD;&#x4E5F;&#x4E0A;&#x4F20;&#x6807;&#x7B7E;&#x3002;&#x4F8B;&#x5982;&#xFF1A; <code>git push origin master --tags</code> &#x3002;</li>
</ul>
<p>&#x9996;&#x5148;&#x6267;&#x884C;&#x6B65;&#x9AA4; 1 &#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x5982;&#x679C;&#x6807;&#x8BB0;&#x7684;&#x540D;&#x79F0;&#x4E0E;&#x6807;&#x8BB0;&#x5BF9;&#x5E94;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x70B9;&#x7684;.nimble&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x7248;&#x672C;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;Nimble &#x5C06;&#x62D2;&#x7EDD;&#x5B89;&#x88C5;&#x8F6F;&#x4EF6;&#x5305;&#x3002;</p>
<p>&#x6807;&#x8BB0;&#x4E0A;&#x8FF0;&#x7248;&#x672C;&#x6240;&#x9700;&#x7684;&#x6B65;&#x9AA4;&#x7279;&#x5B9A;&#x4E8E; Git&#x3002;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x4E3A;&#x4E86;&#x5F00;&#x53D1; Nimble &#x5305;&#xFF0C;&#x4F60;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x5BF9; Git &#x6216; Mercurial &#x6709;&#x975E;&#x5E38;&#x57FA;&#x672C;&#x7684;&#x4E86;&#x89E3;&#x3002;</p>
<h2 id="59-&#x603B;&#x7ED3;">5.9 &#x603B;&#x7ED3;</h2>
<p>Nimble &#x4E0D;&#x662F;&#x5F00;&#x53D1; Nim &#x8F6F;&#x4EF6;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x8BA9;&#x60A8;&#x8BBF;&#x95EE;&#x6570;&#x767E;&#x4E2A;&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5B9E;&#x73B0;&#x8F6F;&#x4EF6;&#x7684;&#x5DE5;&#x4F5C;&#x66F4;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x60A8;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x4F7F;&#x7528; Nimble &#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x5305;&#x62EC;&#x5982;&#x4F55;&#x5B89;&#x88C5; Nimble &#x8F6F;&#x4EF6;&#x5305;&#x3001;&#x5982;&#x4F55;&#x641C;&#x7D22;&#x8F6F;&#x4EF6;&#x5305;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x65B0;&#x8F6F;&#x4EF6;&#x5305;&#x3002;&#x60A8;&#x5C06;&#x6210;&#x529F;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684; Nimble &#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x4E0E; Nim &#x793E;&#x533A;&#x7684;&#x5176;&#x4ED6;&#x6210;&#x5458;&#x5171;&#x4EAB;&#x5B83;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x6DB5;&#x76D6;&#xFF1A;</p>
<ul>
<li>&#x6982;&#x8FF0;&#x4EC0;&#x4E48;&#x662F;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x4EE5;&#x53CA;&#x53EF;&#x7528;&#x7684;&#x4E0D;&#x540C;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x3002;</li>
<li>&#x6709;&#x5173;&#x5982;&#x4F55;&#x5B89;&#x88C5;Nimble&#x5305;&#x7684;&#x8BF4;&#x660E;&#x3002;</li>
<li>&#x4F7F;&#x7528; <code>nimble</code> &#x547D;&#x4EE4;&#x884C;&#x754C;&#x9762;&#x3002;</li>
<li>&#x4F7F;&#x7528; <code>install</code> &#x8BE5;&#x547D;&#x4EE4;&#x5B89;&#x88C5; Nimble&#x8F6F;&#x4EF6;&#x5305;&#x3002;</li>
<li>&#x521B;&#x5EFA; Nimble &#x5305;&#x3002;</li>
<li>&#x53D1;&#x5E03; Nimble &#x5305;&#x3002;</li>
</ul>
<p>&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x60A8;&#x5C06;&#x4E86;&#x89E3;&#x5E76;&#x53D1;&#x5728; Nim &#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x5927;&#x91CF;&#x793A;&#x4F8B;&#x5E76;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x5229;&#x7528;&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x60A8;&#x5C06;&#x4E86;&#x89E3; Nim &#x4E2D;&#x7684;&#x5E76;&#x53D1;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x5728;&#x54EA;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="04.html" class="navigation navigation-prev " aria-label="Previous page: 第四章 标准库畅游">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="09a_cn.html" class="navigation navigation-next " aria-label="Next page: 第五加章 文档和调试">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第五章 包管理","level":"5.3","depth":1,"next":{"title":"第五加章 文档和调试","level":"5.4","depth":1,"path":"09a_cn.adoc","ref":"./09a_cn.adoc","articles":[]},"previous":{"title":"第四章 标准库畅游","level":"5.2","depth":1,"path":"04.md","ref":"./04.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"05.md","mtime":"2023-02-08T06:35:01.871Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-02-08T10:58:18.278Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

