
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第九章 元编程 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="08.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="nimspecial.html">
            
                <a href="nimspecial.html">
            
                    
                    Nim特色
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="nim2.0.html">
            
                <a href="nim2.0.html">
            
                    
                    Nim 2.0 的改进
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2020-10-15-introduction-to-arc-orc-in-nim.html">
            
                <a href="2020-10-15-introduction-to-arc-orc-in-nim.html">
            
                    
                    Nim 的 ARC/ORC 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="2020-12-08-introducing-orc.html">
            
                <a href="2020-12-08-introducing-orc.html">
            
                    
                     ORC 卓越的 GC 算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="09a_cn.html">
            
                <a href="09a_cn.html">
            
                    
                     Nim实战补充章节：Nim 程序的文档和调试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="2022-11-11-a-cost-model-for-nim_cn.html">
            
                <a href="2022-11-11-a-cost-model-for-nim_cn.html">
            
                    
                     Nim2.0 的成本模型 
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="00a.html">
            
                <a href="00a.html">
            
                    
                    关于本书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="00w.html">
            
                <a href="00w.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="01.html">
            
                <a href="01.html">
            
                    
                    第一章 初识Nim
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="3.2" data-path="02.html">
            
                <a href="02.html">
            
                    
                    第二章 开始使用Nim
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="4.1" data-path="03.html">
            
                <a href="03.html">
            
                    
                    第三章 编写一个网络聊天程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.2" data-path="04.html">
            
                <a href="04.html">
            
                    
                    第四章 标准库畅游
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.3" data-path="05.html">
            
                <a href="05.html">
            
                    
                    第五章 包管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.4" data-path="06.html">
            
                <a href="06.html">
            
                    
                    第六章 并行编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="4.5" data-path="07.html">
            
                <a href="07.html">
            
                    
                    第七章 构建一个Twitter克隆
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="5.1" data-path="08.html">
            
                <a href="08.html">
            
                    
                    第八章 外部程序接口FFI
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="5.2" data-path="09.html">
            
                <a href="09.html">
            
                    
                    第九章 元编程
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第九章 元编程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E5D;&#x7AE0;-&#x5143;&#x7F16;&#x7A0B;">&#x7B2C;&#x4E5D;&#x7AE0; &#x5143;&#x7F16;&#x7A0B;</h1>
<p>&#x672C;&#x7AE0;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x5143;&#x7F16;&#x7A0B;&#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x6700;&#x597D;&#x5730;&#x4F7F;&#x7528;&#x5B83;</li>
<li>&#x4F7F;&#x7528;&#x6CDB;&#x578B;&#x6D88;&#x9664;&#x4EE3;&#x7801;&#x91CD;&#x590D;</li>
<li>&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;AST&#x662F;&#x4EC0;&#x4E48;</li>
<li>&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#x4EE3;&#x7801;</li>
<li>&#x4F7F;&#x7528;&#x6A21;&#x677F;&#x548C;&#x5B8F;</li>
</ul>
<p>&#x672C;&#x7AE0;&#x63CF;&#x8FF0;&#x4E86;Nim&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x6700;&#x5148;&#x8FDB;&#x3001;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#x4E4B;&#x4E00;&#x3002;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x79F0;&#x4E3A;&#x5143;&#x7F16;&#x7A0B;&#xFF0C;&#x5B83;&#x7531;&#x8BB8;&#x591A;&#x7EC4;&#x4EF6;&#x7EC4;&#x6210;&#xFF0C;&#x5305;&#x62EC;&#x6CDB;&#x578B;&#x3001;&#x6A21;&#x677F;&#x548C;&#x5B8F;&#x3002;</p>
<p>&#x5143;&#x7F16;&#x7A0B;&#x662F;Nim&#x7684;&#x4E00;&#x9879;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x4F7F;&#x60A8;&#x80FD;&#x591F;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6E90;&#x4EE3;&#x7801;&#x89C6;&#x4E3A;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x80FD;&#x591F;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x6765;&#x8BFB;&#x53D6;&#x3001;&#x751F;&#x6210;&#x3001;&#x5206;&#x6790;&#x548C;&#x4FEE;&#x6539;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x3002;&#x80FD;&#x591F;&#x6267;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x6D3B;&#x52A8;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x60A8;&#x4F7F;&#x7528;&#x66F4;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x5B8C;&#x6210;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x53CD;&#x8FC7;&#x6765;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5143;&#x7F16;&#x7A0B;&#x51CF;&#x5C11;&#x4E86;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x9605;&#x8BFB;&#x3001;&#x5206;&#x6790;&#x548C;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x5374;&#x4E0D;&#x662F;&#x3002;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x7B80;&#x5355;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Person</span> = <span class="hljs-keyword">object</span>
    name: <span class="hljs-built_in">string</span>
    age: <span class="hljs-built_in">int</span>
</code></pre>
<p>&#x5728;&#x6CA1;&#x6709;&#x5143;&#x7F16;&#x7A0B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5206;&#x6790;&#x6B64;&#x4EE3;&#x7801;&#x4EE5;&#x68C0;&#x7D22;&#x6709;&#x5173;Person&#x7C7B;&#x578B;&#x7684;&#x4FE1;&#x606F;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x5C06;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x89C6;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;&#x5728;Nim&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x8BA9;&#x60A8;&#x5206;&#x6790;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x904D;&#x5386;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros

<span class="hljs-keyword">type</span>
  <span class="hljs-type">Person</span> = <span class="hljs-keyword">object</span>
    name: <span class="hljs-built_in">string</span>
    age: <span class="hljs-built_in">int</span>

<span class="hljs-keyword">static</span>:
  <span class="hljs-keyword">for</span> sym <span class="hljs-keyword">in</span> getType[<span class="hljs-type">Person</span>](<span class="hljs-number">2</span>):
    echo(sym.symbol)
</code></pre>
<p>&#x7F16;&#x8BD1;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x5C06;&#x663E;&#x793A;&#x7F16;&#x8BD1;&#x5668;&#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x540D;&#x79F0;&#x548C;&#x5E74;&#x9F84;&#x3002;</p>
<p>&#x8FD9;&#x53EA;&#x662F;&#x5143;&#x7F16;&#x7A0B;&#x5141;&#x8BB8;&#x60A8;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x5E8F;&#x5217;&#x5316;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x7F16;&#x5199;&#x7279;&#x5B9A;&#x4E8E;&#x60A8;&#x6216;&#x5176;&#x4ED6;&#x4EBA;&#x5B9A;&#x4E49;&#x7684;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x60A8;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x4E00;&#x7279;&#x6027;&#x548C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7279;&#x6027;&#xFF0C;&#x5143;&#x7F16;&#x7A0B;&#x6253;&#x5F00;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x5143;&#x7F16;&#x7A0B;&#x4E3A;Nim&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x589E;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5143;&#x7F16;&#x7A0B;&#x4EE3;&#x7801;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x4F1A;&#x51CF;&#x5C11;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x60A8;&#x5C06;&#x5B66;&#x4E60;&#x4E09;&#x79CD;&#x5143;&#x7F16;&#x7A0B;&#x6784;&#x9020;&#x65B9;&#x5F0F;&#xFF0C;&#x4ECE;&#x6CDB;&#x578B;&#x5F00;&#x59CB;&#xFF0C;&#x5230;&#x6A21;&#x677F;&#xFF0C;&#x518D;&#x5230;&#x5B8F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x60A8;&#x5C06;&#x770B;&#x5230;&#x5982;&#x4F55;&#x4E3A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7F16;&#x5199;&#x7B80;&#x5355;&#x7684;&#x57DF;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x3002;&#x9886;&#x57DF;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x662F;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;9.4&#x8282;&#x3002;</p>
<h2 id="91-generics-&#x6CDB;&#x578B;">9.1 Generics &#x6CDB;&#x578B;</h2>
<p>&#x6B63;&#x5982;&#x4F60;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x7684;&#xFF0C;Nim&#x662F;&#x4E00;&#x79CD;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;Nim&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x4E0E;&#x5176;&#x76F8;&#x5173;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x4F46;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x4F8B;&#x5982;int&#x548C;float&#x7C7B;&#x578B;&#x90FD;&#x8868;&#x793A;&#x6570;&#x5B57;&#xFF0C;&#x4F46;&#x524D;&#x8005;&#x4E0D;&#x80FD;&#x8868;&#x793A;&#x5206;&#x6570;&#xFF0C;&#x800C;&#x540E;&#x8005;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x5206;&#x6570;&#x3002;</p>
<p>&#x6CDB;&#x578B;&#x662F;&#x4E00;&#x79CD;&#x5141;&#x8BB8;&#x60A8;&#x4EE5;&#x79F0;&#x4E3A;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x7684;&#x6837;&#x5F0F;&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5728;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x60A8;&#x6839;&#x636E;&#x5728;&#x8C03;&#x7528;&#x7B97;&#x6CD5;&#x4E4B;&#x524D;&#x672A;&#x77E5;&#x7684;&#x7C7B;&#x578B;&#x7F16;&#x5199;&#x7B97;&#x6CD5;&#x3002;&#x6CDB;&#x578B;&#x7F16;&#x7A0B;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x3002;</p>
<p>&#x6CDB;&#x578B;&#x4E0E;Nim&#x4E2D;&#x7684;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x5143;&#x7F16;&#x7A0B;&#x7EC4;&#x4EF6;&#x6709;&#x5173;&#xFF0C;&#x5373;&#x6A21;&#x677F;&#x548C;&#x5B8F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x751F;&#x6210;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x672C;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x8FC7;&#x7A0B;&#x548C;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x6CDB;&#x578B;&#xFF0C;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5728;&#x8FD9;&#x4E9B;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x6700;&#x4F73;&#x5730;&#x5229;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x5B83;&#x8FD8;&#x5C06;&#x7B80;&#x8981;&#x5730;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x7EA6;&#x675F;&#x6CDB;&#x578B;&#x4EE5;&#x4F7F;&#x7B97;&#x6CD5;&#x7684;&#x5B9A;&#x4E49;&#x66F4;&#x51C6;&#x786E;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x8BED;&#x8A00;&#x5C06;&#x6CDB;&#x578B;&#x79F0;&#x4E3A;&#x53C2;&#x6570;&#x591A;&#x6001;&#x6027;&#x6216;&#x6A21;&#x677F;&#x3002;&#x8BB8;&#x591A;&#x8457;&#x540D;&#x7684;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x652F;&#x6301;&#x6CDB;&#x578B;&#xFF0C;&#x5305;&#x62EC;Java&#x3001;C#&#x3001;C++&#x3001;Objective C&#x548C;Swift&#x3002;&#x4E5F;&#x6709;&#x5C11;&#x6570;&#x8BED;&#x8A00;&#x6709;&#x610F;&#x5FFD;&#x7565;&#x4E86;&#x8FD9;&#x4E00;&#x7279;&#x6027;&#xFF0C;Go&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x56E0;&#x6B64;&#x81ED;&#x540D;&#x662D;&#x8457;&#x3002;</p>
<h3 id="911-&#x6CDB;&#x578B;&#x8FC7;&#x7A0B;&#x51FD;&#x6570;">9.1.1 &#x6CDB;&#x578B;&#x8FC7;&#x7A0B;(&#x51FD;&#x6570;)</h3>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x60A8;&#x66F4;&#x597D;&#x5730;&#x4E86;&#x89E3;Nim&#x4E2D;&#x7684;&#x6CDB;&#x578B;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x6CDB;&#x578B;myMax&#x8FC7;&#x7A0B;&#x7684;&#x4EE5;&#x4E0B;&#x5B9E;&#x73B0;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> myMax[T](a, b: T): T =
  <span class="hljs-keyword">if</span> a &lt; b:
    <span class="hljs-keyword">return</span> b
  <span class="hljs-keyword">else</span>:
    <span class="hljs-keyword">return</span> a

doAssert myMax(<span class="hljs-number">5</span>, <span class="hljs-number">10</span>) == <span class="hljs-number">10</span>
doAssert myMax(<span class="hljs-number">31</span>.<span class="hljs-number">3</span>, <span class="hljs-number">1</span>.<span class="hljs-number">23124</span>) == <span class="hljs-number">31</span>.<span class="hljs-number">3</span>
</code></pre>
<p>&#x8BE5;&#x793A;&#x4F8B;&#x7684;&#x5173;&#x952E;&#x90E8;&#x5206;&#x662F;&#x7B2C;&#x4E00;&#x884C;&#x3002;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x6CDB;&#x578B;&#x7C7B;&#x578B;T&#x5B9A;&#x4E49;&#x5728;&#x8FC7;&#x7A0B;&#x540D;&#x79F0;&#x540E;&#x7684;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4F5C;&#x53C2;&#x6570;a&#x548C;b&#x7684;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x8FC7;&#x7A0B;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x63A8;&#x65AD;&#x6CDB;&#x578B;&#x7C7B;&#x578B;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x5B83;&#x4EEC;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x6240;&#x793A;&#xFF1A;</p>
<p> <code>doAssert myMax[float](5, 10.5) == 10.5</code> </p>
<p>&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x660E;&#x786E;&#x5730;&#x544A;&#x8BC9;&#x7F16;&#x8BD1;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;myMax&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF0C;&#x6CDB;&#x578B;&#x7C7B;&#x578B;T&#x5E94;&#x8BE5;&#x5B9E;&#x4F8B;&#x5316;&#x4E3A;float&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x63A8;&#x65AD;T&#x7684;&#x7C7B;&#x578B;&#x65B9;&#x9762;&#x505A;&#x5F97;&#x5F88;&#x597D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6307;&#x5B9A;int&#x6587;&#x672C;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x6307;&#x5B9A;float&#x6587;&#x672C;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x5C06;&#x9690;&#x5F0F;&#x5730;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x8F6C;&#x6362;&#x4E3A;&#x6D6E;&#x70B9;&#x3002;</p>
<p> <code>doAssert myMax(5&#xFF0C;10.5)==10.5</code> </p>
<p>&#x5373;&#x4F7F;&#x4F20;&#x9012;&#x7ED9;myMax&#x8FC7;&#x7A0B;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x4E5F;&#x5C06;&#x6210;&#x529F;&#x7F16;&#x8BD1;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x8FC7;&#x7A0B;&#x5B9A;&#x4E49;&#x4E2D;&#x5B9A;&#x4E49;&#x4EFB;&#x610F;&#x591A;&#x7684;&#x6CDB;&#x578B;&#x7C7B;&#x578B;&#x3002;&#x5F53;&#x524D;myMax&#x8FC7;&#x7A0B;&#x53EA;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EE5;&#x4E0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x5C06;&#x5931;&#x8D25;&#xFF0C;&#x5E76;&#x51FA;&#x73B0;&#x7C7B;&#x578B;&#x4E0D;&#x5339;&#x914D;&#x9519;&#x8BEF;&#x3002;</p>
<p> <code>doAssert myMax(5&apos;i32&#xFF0C;10.5)==10.5</code> </p>
<p>&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x672A;&#x80FD;&#x7F16;&#x8BD1;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x53C2;&#x6570;a&#x7684;&#x7C7B;&#x578B;&#x662F;int32&#xFF0C;&#x800C;b&#x7684;&#x7C7B;&#x578B;&#x662F;float&#x3002;&#x4E0A;&#x9762;&#x5B9A;&#x4E49;&#x7684;myMax&#x8FC7;&#x7A0B;&#x53EA;&#x80FD;&#x7528;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x8C03;&#x7528;&#x3002;</p>
<h3 id="912&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x6CDB;&#x578B;">9.1.2&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x6CDB;&#x578B;</h3>
<p>&#x5728;&#x7F16;&#x5199;Nim&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x5728;&#x521D;&#x59CB;&#x5316;&#x671F;&#x95F4;&#x6307;&#x5B9A;&#x5BF9;&#x8C61;&#x4E2D;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5177;&#x4F53;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x4E13;&#x95E8;&#x5316;&#x3002;</p>
<p>&#x8FD9;&#x5BF9;&#x4E8E;&#x5BB9;&#x5668;&#x7C7B;&#x578B;(&#x5982;&#x5217;&#x8868;&#x548C;&#x54C8;&#x5E0C;&#x8868;)&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5355;&#x9879;&#x901A;&#x7528;&#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Container</span>[T] = <span class="hljs-keyword">object</span>
    empty: <span class="hljs-built_in">bool</span>
    value: T
</code></pre>
<p>&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x63A5;&#x53D7;&#x6CDB;&#x578B;&#x7C7B;&#x578B;T&#x7684;Container&#x7C7B;&#x578B;&#x3002;&#x7136;&#x540E;&#xFF0C;Container&#x7C7B;&#x578B;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x7531;&#x5B9A;&#x4E49;Container&#x53D8;&#x91CF;&#x65F6;&#x6307;&#x5B9A;&#x7684;&#x6CDB;&#x578B;&#x7C7B;&#x578B;T&#x786E;&#x5B9A;&#x3002;</p>
<p>Container&#x7C7B;&#x578B;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> initContainer[T](): <span class="hljs-type">Container</span>[T] =
  <span class="hljs-literal">result</span>.empty = <span class="hljs-literal">true</span>
</code></pre>
<p>&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x8C03;&#x7528;&#x6B64;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<p> <code>var myBox=initContainer[string]()</code> </p>
<p>&#x5F53;&#x524D;&#x5FC5;&#x987B;&#x5728;&#x65B9;&#x62EC;&#x53F7;&#x4E4B;&#x95F4;&#x6307;&#x5B9A;&#x6CDB;&#x578B;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x5C06;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#xFF1A;</p>
<p> <code>var myBox=initContainer()</code> </p>
<p>&#x7F16;&#x8BD1;&#x6B64;&#x4EE3;&#x7801;&#x5C06;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#xFF1A;&#x65E0;&#x6CD5;&#x5B9E;&#x4F8B;&#x5316;&#xFF1A; <code>T</code> &#x9519;&#x8BEF;&#x6D88;&#x606F;&#x3002;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x4E0D;&#x80FD;&#x603B;&#x662F;&#x63A8;&#x65AD;&#x6CDB;&#x578B;&#x7C7B;&#x578B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x65E0;&#x6CD5;&#x63A8;&#x65AD;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<h3 id="913-&#x6CDB;&#x578B;&#x9650;&#x5236;">9.1.3 &#x6CDB;&#x578B;&#x9650;&#x5236;</h3>
<p>&#x6709;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x9650;&#x5236;&#x6CDB;&#x578B;&#x8FC7;&#x7A0B;&#x6216;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x6240;&#x63A5;&#x53D7;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x589E;&#x5F3A;&#x5B9A;&#x4E49;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x60A8;&#x548C;&#x4EE3;&#x7801;&#x7684;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x66F4;&#x6E05;&#x695A;&#x3002;&#x8003;&#x8651;&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x7684;myMax&#x8FC7;&#x7A0B;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x8C03;&#x7528;&#x5B83;&#x65F6;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> myMax[T](a, b: T): T =
  <span class="hljs-keyword">if</span> a &lt; b:
    <span class="hljs-keyword">return</span> b
  <span class="hljs-keyword">else</span>:
    <span class="hljs-keyword">return</span> a
echo myMax(<span class="hljs-string">&quot;Hello&quot;</span>, <span class="hljs-string">&quot;World&quot;</span>)
</code></pre>
<p>&#x5982;&#x679C;&#x4FDD;&#x5B58;&#x6B64;&#x4EE3;&#x7801;&#xFF0C;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x5B83;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5C06;&#x770B;&#x5230;&#x663E;&#x793A;&#x7684;&#x5B57;&#x7B26;&#x4E32; <code>World</code> &#x3002;</p>
<p>&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x4E0D;&#x5E0C;&#x671B;&#x7B97;&#x6CD5;&#x4E0E;&#x4E00;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x53EA;&#x4E0E;&#x6574;&#x6570;&#x548C;&#x6D6E;&#x70B9;&#x6570;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x7EA6;&#x675F;myMax&#x8FC7;&#x7A0B;&#x7684;&#x6CDB;&#x578B;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> myMax[T: <span class="hljs-built_in">int</span> | <span class="hljs-built_in">float</span>](a, b: T): T =
  <span class="hljs-keyword">if</span> a &lt; b:
    <span class="hljs-keyword">return</span> b
  <span class="hljs-keyword">else</span>:
    <span class="hljs-keyword">return</span> a

echo myMax(<span class="hljs-string">&quot;Hello&quot;</span>, <span class="hljs-string">&quot;World&quot;</span>)
</code></pre>
<p>&#x7F16;&#x8BD1;&#x6B64;&#x4EE3;&#x7801;&#x5C06;&#x5931;&#x8D25;&#xFF0C;&#x5E76;&#x51FA;&#x73B0;&#x4EE5;&#x4E0B;&#x9519;&#x8BEF;&#xFF1A;</p>
<pre><code class="lang-bash">/tmp/file.nim(7, 11) Error: <span class="hljs-built_in">type</span> mismatch: got (string, string)
but expected one of:
proc myMax[T: int | <span class="hljs-built_in">float</span>](a, b: T): T
</code></pre>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x7EA6;&#x675F;&#x8FC7;&#x7A0B;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#xFF0C;Nim&#x63D0;&#x4F9B;&#x4E86;&#x5C11;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x7C7B;&#x3002;&#x7C7B;&#x578B;&#x7C7B;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x4F2A;&#x7C7B;&#x578B;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5339;&#x914D;&#x7EA6;&#x675F;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x7C7B;&#x578B;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x81EA;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x7C7B;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Number</span> = <span class="hljs-built_in">int</span> | <span class="hljs-built_in">float</span> | <span class="hljs-built_in">uint</span>

<span class="hljs-keyword">proc</span> isPositive(x: <span class="hljs-type">Number</span>): <span class="hljs-built_in">bool</span> =
  <span class="hljs-keyword">return</span> x &gt; <span class="hljs-number">0</span>
</code></pre>
<p>&#x8BB8;&#x591A;&#x5DF2;&#x5728;&#x7CFB;&#x7EDF;&#x6A21;&#x5757;&#x4E2D;&#x4E3A;&#x60A8;&#x5B9A;&#x4E49;&#x3002;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x5185;&#x7F6E;&#x7C7B;&#x578B;&#x7C7B;&#x53EF;&#x4EE5;&#x5339;&#x914D;&#x6240;&#x6709;&#x7C7B;&#x578B;&#x7EC4;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;Nim&#x624B;&#x518C;&#x4E2D;&#x627E;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x5217;&#x8868;&#x3002;</p>
<h3 id="914--concepts-&#x6982;&#x5FF5;">9.1.4  Concepts &#x6982;&#x5FF5;</h3>
<p>&#x6982;&#x5FF5;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x7C7B;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x6784;&#x9020;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x5339;&#x914D;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x7684;&#x4EFB;&#x610F;&#x8981;&#x6C42;&#x3002;&#x5B83;&#x4EEC;&#x5BF9;&#x4E8E;&#x5B9A;&#x4E49;&#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x63A5;&#x53E3;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x5B9E;&#x9A8C;&#x6027;&#x7684;Nim&#x7279;&#x6027;&#x3002;&#x672C;&#x8282;&#x5C06;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x6982;&#x5FF5;&#x7684;&#x5FEB;&#x901F;&#x6982;&#x8FF0;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x8FC7;&#x591A;&#x5730;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x8BED;&#x4E49;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x7684;max&#x8FC7;&#x7A0B;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7EA6;&#x675F;&#xFF0C;&#x8BE5;&#x7EA6;&#x675F;&#x5C06;&#x5176;&#x9650;&#x5236;&#x4E3A;&#x4EC5;&#x63A5;&#x53D7;int&#x548C;float&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;max&#x8FC7;&#x7A0B;&#xFF0C;&#x63A5;&#x53D7;&#x4EFB;&#x4F55;&#x4E3A;&#x5176;&#x5B9A;&#x4E49;&#x4E86;&lt;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x7C7B;&#x578B;&#x66F4;&#x6709;&#x610F;&#x4E49;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x4EE5;&#x4EE3;&#x7801;&#x7684;&#x5F62;&#x5F0F;&#x6307;&#x5B9A;&#x6B64;&#x8981;&#x6C42;.</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">Comparable</span> = concept a     <span class="hljs-comment"># &lt;1&gt;</span>
    (a &lt; a) <span class="hljs-keyword">is</span> <span class="hljs-built_in">bool</span>     <span class="hljs-comment"># &lt;2&gt;</span>

<span class="hljs-keyword">proc</span> max(a, b: <span class="hljs-type">Comparable</span>): <span class="hljs-type">Comparable</span> =
  <span class="hljs-keyword">if</span> a &lt; b:
    <span class="hljs-keyword">return</span> b
  <span class="hljs-keyword">else</span>:
    <span class="hljs-keyword">return</span> a
</code></pre>
<blockquote>
<p><1>&#x6982;&#x5FF5;&#x5B9A;&#x4E49;&#x4E0E;concept&#x5173;&#x952E;&#x5B57;&#x4E00;&#x8D77;&#x5F15;&#x5165;&#xFF0C;&#x540E;&#x9762;&#x662F;&#x7C7B;&#x578B;&#x6807;&#x8BC6;&#x7B26;&#x3002;</1></p>
<p><2>&#x8BE5;&#x884C;&#x6307;&#x5B9A;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x6B64;&#x6982;&#x5FF5;&#x4E0E;&#x7C7B;&#x578B;&#x5339;&#x914D;&#xFF0C;&#x5FC5;&#x987B;&#x4E3A;&#x8BE5;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8FD4;&#x56DE;&#x5E03;&#x5C14;&#x503C;&#x7684; &lt; &#x8FC7;&#x7A0B;&#x3002;</2></p>
</blockquote>
<p>&#x6982;&#x5FF5;&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x7EC4;&#x6210;&#x3002;&#x8FD9;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5728;concept&#x5173;&#x952E;&#x5B57;&#x4E4B;&#x540E;&#x5B9A;&#x4E49;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x5F53;&#x6839;&#x636E;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x68C0;&#x67E5;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x53EA;&#x8981;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x5C31;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8BE5;&#x6982;&#x5FF5;&#xFF1A;</p>
<ul>
<li>&#x6982;&#x5FF5;&#x4F53;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x90FD;&#x4F1A;&#x7F16;&#x8BD1;&#xFF0C;</li>
<li>&#x5E76;&#x4E14;&#x8BA1;&#x7B97;&#x4E3A;&#x5E03;&#x5C14;&#x503C;&#x7684;&#x6240;&#x6709;&#x8868;&#x8FBE;&#x5F0F;&#x5747;&#x4E3A;true&#x3002;</li>
</ul>
<p>is&#x8FD0;&#x7B97;&#x7B26;&#x786E;&#x5B9A;&#x6307;&#x5B9A;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x5426;&#x8FD4;&#x56DE;bool&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x8FD4;&#x56DE;true&#xFF0C;&#x5219;&#x8FD4;&#x56DE;false&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x4E00;&#x4E9B;&#x5FEB;&#x901F;&#x6D4B;&#x8BD5;&#x6765;&#x68C0;&#x67E5;Comparable&#x6982;&#x5FF5;&#x662F;&#x5426;&#x5982;&#x9884;&#x671F;&#x7684;&#x90A3;&#x6837;&#x6709;&#x6548;&#xFF0C;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x53D6;&#x81EA;&#x524D;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x3002;</p>
<pre><code class="lang-Nim">doAssert max(<span class="hljs-number">5</span>, <span class="hljs-number">10</span>) == <span class="hljs-number">10</span>
doAssert max(<span class="hljs-number">31</span>.<span class="hljs-number">3</span>, <span class="hljs-number">1</span>.<span class="hljs-number">23124</span>) == <span class="hljs-number">31</span>.<span class="hljs-number">3</span>
</code></pre>
<p>&#x60A8;&#x5E0C;&#x671B;&#x8FD9;&#x4E24;&#x884C;&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x7B2C;&#x4E00;&#x884C;&#x6307;&#x5B9A;&#x4E86;&#x4E24;&#x4E2A;int&#x53C2;&#x6570;&#xFF0C;proc <code>&lt;</code> (a&#xFF0C;b:int)&#xFF1A;bool&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x6B64;int&#x6EE1;&#x8DB3;Comparable&#x6982;&#x5FF5;&#x3002;&#x7B2C;&#x4E8C;&#x884C;&#x6307;&#x5B9A;&#x4E24;&#x4E2A;float&#x53C2;&#x6570;&#xFF0C;&#x7C7B;&#x4F3C;&#x5730;proc&lt;&apos;(a&#xFF0C;b&#xFF1A;float)&#xFF1A;boo&#x4E5F;&#x5B58;&#x5728;&#x3002;
&#x4F46;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x5199;&#x5165;echo max([5&#xFF0C;3]&#xFF0C;[1&#xFF0C;6])&#x5C06;&#x4E24;&#x4E2A;&#x6570;&#x7EC4;&#x4F20;&#x9012;&#x5230;max&#x8FC7;&#x7A0B;&#x5931;&#x8D25;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#xFF1A;</p>
<pre><code class="lang-bash">/tmp/file.nim(11, 9) Error: <span class="hljs-built_in">type</span> mismatch: got (Array constructor[0..1, int], Array constructor[0..1, int])
but expected one of:
proc max[Comparable](a, b: Comparable): Comparable
proc max(x, y: int): int
proc max(x, y: int8): int8
</code></pre>
<p>&#x6982;&#x5FF5;&#x662F;&#x5F3A;&#x5927;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x65B0;&#x7684;Nim&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5B9E;&#x9A8C;&#x6027;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x5B9E;&#x9A8C;&#x6027;&#x8D28;&#xFF0C;&#x672C;&#x7AE0;&#x5C06;&#x4E0D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x975E;&#x5E38;&#x6B22;&#x8FCE;&#x60A8;&#x5728;Nim&#x624B;&#x518C;&#x4E2D;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x3002;[27]&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x5B66;&#x4E60;&#x6A21;&#x677F;&#x3002;</p>
<h2 id="92-&#x6A21;&#x677F;-templates">9.2 &#x6A21;&#x677F; TEMPLATES</h2>
<p>Nim&#x4E2D;&#x7684;&#x6A21;&#x677F;&#x662F;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6A21;&#x677F;&#x63D0;&#x4F9B;&#x4E86;&#x76F4;&#x63A5;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x5B8F;&#xFF0C;&#x60A8;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#x5B66;&#x4E60;&#x3002;&#x4E0E;&#x6CDB;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x66FF;&#x6362;&#x673A;&#x5236;&#xFF0C;&#x5141;&#x8BB8;&#x60A8;&#x66FF;&#x6362;&#x6A21;&#x677F;&#x4E3B;&#x4F53;&#x4E2D;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5C31;&#x50CF;&#x6240;&#x6709;&#x5143;&#x7F16;&#x7A0B;&#x7279;&#x6027;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x80FD;&#x529B;&#x5E2E;&#x52A9;&#x60A8;&#x5904;&#x7406;&#x6837;&#x677F;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x6A21;&#x677F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x51CF;&#x5C11;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x7684;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x3002;&#x5728;Nim&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x6A21;&#x677F;&#x6700;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x5C06;&#x53D8;&#x91CF;&#x6CE8;&#x5165;&#x8C03;&#x7528;&#x8303;&#x56F4;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x6A21;&#x677F;&#x7684;&#x8C03;&#x7528;&#x65B9;&#x5F0F;&#x4E0E;&#x8FC7;&#x7A0B;&#x76F8;&#x540C;&#x3002;&#x5F53;Nim&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x6E90;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x4EFB;&#x4F55;&#x6A21;&#x677F;&#x8C03;&#x7528;&#x90FD;&#x5C06;&#x66FF;&#x6362;&#x4E3A;&#x6A21;&#x677F;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x770B;&#x770B;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x7684;&#x4EE5;&#x4E0B;&#x6A21;&#x677F;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">template</span> `!=` (a, b: untyped) =     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">not</span> (a == b)
</code></pre>
<p><1>&#x73B0;&#x5728;&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#x975E;&#x7C7B;&#x578B;&#x5316;&#x7C7B;&#x578B;&#xFF0C;&#x7A0D;&#x540E;&#x4F1A;&#x89E3;&#x91CA;&#x3002;</1></p>
<p>&#x5C06; != &#x8FD0;&#x7B97;&#x7B26;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x7C7B;&#x578B;&#x5355;&#x72EC;&#x5B9E;&#x73B0;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6CDB;&#x578B;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x591A;&#x7684;&#x8C03;&#x7528;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49; != &#x4F1A;&#x50CF;&#x4E0B;&#x9762;&#x4E00;&#x6837;&#xFF1A;</p>
<p> <code>doAssert(5 != 4)</code> </p>
<p>&#x8BED;&#x53E5;&#x88AB;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;</p>
<p> <code>doAssert(not (5 == 4))</code> </p>
<p>&#x8FD9;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x5982;&#x56FE;9.1&#x6240;&#x793A;&#x3002;</p>
<p>&#x56FE;9.1 Nim&#x6E90;&#x4EE3;&#x7801;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6269;&#x5C55;&#x7684;&#x6A21;&#x677F;</p>
<p><img src="Images/ch09_template_compilation.png" alt="alt &#x5C5E;&#x6027;&#x6587;&#x672C;"></p>
<p>&#x6A21;&#x677F;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x66FF;&#x4EE3;&#x673A;&#x5236;&#xFF0C;&#x51CF;&#x5C11;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x7684;&#x9700;&#x8981;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6A21;&#x677F;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5373;&#x6A21;&#x677F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4EE3;&#x7801;&#x8BED;&#x53E5;&#x3002;</p>
<h3 id="921&#x5411;&#x6A21;&#x677F;&#x4F20;&#x9012;&#x4EE3;&#x7801;&#x5757;">9.2.1&#x5411;&#x6A21;&#x677F;&#x4F20;&#x9012;&#x4EE3;&#x7801;&#x5757;</h3>
<p>&#x4EE3;&#x7801;&#x5757;&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8BED;&#x53E5;&#x7EC4;&#x6210;&#x3002;&#x5728;&#x666E;&#x901A;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x4E2D;&#xFF0C;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x533F;&#x540D;&#x8FC7;&#x7A0B;&#x5411;&#x5176;&#x4E2D;&#x4F20;&#x9012;&#x591A;&#x4E2A;&#x8BED;&#x53E5;&#x3002;&#x4F7F;&#x7528;&#x6A21;&#x677F;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x4F20;&#x9012;&#x4EE3;&#x7801;&#x5757;&#x3002;Nim&#x652F;&#x6301;&#x6A21;&#x677F;&#x7684;&#x7279;&#x6B8A;&#x8BED;&#x6CD5;&#xFF0C;&#x5141;&#x8BB8;&#x5C06;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4EE3;&#x7801;&#x8BED;&#x53E5;&#x4F20;&#x9012;&#x7ED9;&#x6A21;&#x677F;&#x3002;
&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x663E;&#x793A;&#x4E86;&#x63A5;&#x53D7;&#x4EE3;&#x7801;&#x5757;&#x4F5C;&#x4E3A;&#x5176;&#x53C2;&#x6570;&#x4E4B;&#x4E00;&#x7684;&#x6A21;&#x677F;&#x5B9A;&#x4E49;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> os

<span class="hljs-keyword">template</span> repeat(statements: untyped) =
  <span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
    statements

repeat:
  echo(<span class="hljs-string">&quot;Hello Templates!&quot;</span>)
  sleep(<span class="hljs-number">1000</span>)
</code></pre>
<blockquote>
<p><1> <code>sleep</code> &#x51FD;&#x6570;&#x9700;&#x8981; <code>os</code> &#x6A21;&#x5757;</1></p>
<p><2>&#x6A21;&#x677F;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x5BF9;&#x5E94;&#x4E8E;&#x4EE3;&#x7801;&#x5757;&#x3002;</2></p>
<p><3>&#x4EE3;&#x7801;&#x5757;&#x88AB;&#x66FF;&#x6362;&#x5230;&#x6B64;&#x5904;&#x3002;</3></p>
<p><4>&#x63A5;&#x53D7;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x6A21;&#x677F;&#x662F;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x7684;&#x3002;</4></p>
</blockquote>
<p>&#x5B8F;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x5757;:  &#x5B8F;(&#x60A8;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#x4E86;&#x89E3;)&#x4E5F;&#x652F;&#x6301;&#x4EE3;&#x7801;&#x5757;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x6A21;&#x677F;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x6807;&#x8BC6;&#x7B26;&#x5C06;&#x66FF;&#x6362;&#x4E3A;&#x4F20;&#x9012;&#x5230;&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x5757;&#x3002;&#x7F16;&#x8BD1;&#x5668;&#x5C55;&#x5F00;&#x6A21;&#x677F;&#x540E;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> os

<span class="hljs-keyword">while</span> <span class="hljs-literal">true</span>:
  echo(<span class="hljs-string">&quot;Hello Templates!&quot;</span>)
  sleep(<span class="hljs-number">1000</span>)`
</code></pre>
<p>&#x56FE;9.2&#x663E;&#x793A;&#x4E86;&#x91CD;&#x590D;&#x6A21;&#x677F;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8BE5;&#x6A21;&#x677F;&#x63A5;&#x53D7;&#x4EE3;&#x7801;&#x5757;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x56FE;9.2.&#x4F20;&#x9012;&#x5230;&#x91CD;&#x590D;&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x88AB;&#x66FF;&#x6362;&#x5230;&#x5176;&#x4E3B;&#x4F53;&#x4E2D;
<img src="Images/ch09_template_body.png" alt="alt "></p>
<p>&#x8FD9;&#x663E;&#x793A;&#x4E86;&#x6A21;&#x677F;&#x7684;&#x4E00;&#x4E9B;&#x60CA;&#x4EBA;&#x7684;&#x66FF;&#x6362;&#x529F;&#x80FD;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5FC5;&#x987B;&#x63A5;&#x53D7;&#x4EE3;&#x7801;&#x5757;&#x3002;&#x4E0B;&#x4E00;&#x8282;&#x63CF;&#x8FF0;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x5982;&#x4F55;&#x5728;&#x6A21;&#x677F;&#x4E3B;&#x4F53;&#x4E2D;&#x66FF;&#x6362;&#xFF0C;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x6B64;&#x529F;&#x80FD;&#x3002;</p>
<blockquote>
<p>&#x591A;&#x4E2A;&#x4EE3;&#x7801;&#x5757;
&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;do&#x7B26;&#x53F7;&#x5C06;&#x591A;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x4F20;&#x9012;&#x7ED9;&#x6A21;&#x677F;&#x6216;&#x5B8F;&#x3002;&#x4F46;&#x8FD9;&#x8D85;&#x51FA;&#x4E86;&#x672C;&#x7AE0;&#x7684;&#x8303;&#x56F4;&#x3002;&#x6709;&#x5173;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;Nim&#x624B;&#x518C;&#x3002;[28]</p>
</blockquote>
<p>&#x4E86;&#x89E3;&#x4EE3;&#x7801;&#x5757;&#x548C;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x5982;&#x4F55;&#x4EA4;&#x4E92;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x89C4;&#x5219;&#x662F;&#xFF0C;&#x5F53;&#x4EE3;&#x7801;&#x5757;&#x4F20;&#x9012;&#x5230;&#x6A21;&#x677F;&#x4E2D;&#x65F6;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x59CB;&#x7EC8;&#x5305;&#x542B;&#x5B83;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> os
<span class="hljs-keyword">template</span> repeat(count: <span class="hljs-built_in">int</span>, statements: untyped) =     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> <span class="hljs-number">0</span> .. &lt;count:
    statements

repeat <span class="hljs-number">5</span>:
  echo(<span class="hljs-string">&quot;Hello Templates!&quot;</span>)
  sleep(<span class="hljs-number">1000</span>)`
</code></pre>
<p><1>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&#x8BED;&#x53E5;&#x7684;&#x53C2;&#x6570;&#x5305;&#x542B;&#x4EE3;&#x7801;&#x5757;&#x3002;</1></p>
<h3 id="922&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x66FF;&#x6362;">9.2.2&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x66FF;&#x6362;</h3>
<p>&#x6A21;&#x677F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x901A;&#x5E38;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x4F8B;&#x5982;&#x53D8;&#x91CF;&#x6216;&#x7C7B;&#x578B;&#x540D;&#x79F0;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x89E3;&#x91CA;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x677F;&#x7279;&#x5B9A;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x4FEE;&#x6539;&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x66FF;&#x6362;&#x884C;&#x4E3A;&#x3002;
&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0E;&#x8FC7;&#x7A0B;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x9012;&#x5230;&#x6A21;&#x677F;&#x4E2D;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">template</span> declareVar(varName: untyped, value: typed) =     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">var</span> varName = value     <span class="hljs-comment"># &lt;2&gt;</span>

declareVar(foo, <span class="hljs-number">42</span>)       <span class="hljs-comment"># &lt;3&gt;</span>
echo(foo)
</code></pre>
<blockquote>
<p><1>&#x6A21;&#x677F;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x975E;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x53E5;&#x3002;</1></p>
<p><2>&#x65E0;&#x8BBA;&#x4F20;&#x9012;&#x5230;&#x6A21;&#x677F;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x5C06;&#x66FF;&#x6362;&#x6B64;&#x884C;&#x4E2D;&#x7684;varName&#x548C;&#x503C;&#x3002;</2></p>
<p><3>&#x5C06;&#x5C55;&#x5F00;&#x4E3A;&#xFF1A;var foo=42&#x3002;</3></p>
</blockquote>
<p>&#x5F53;&#x8C03;&#x7528; <code>declareVar</code> &#x6A21;&#x677F;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x6269;&#x5C55;&#x4E3A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x3002;&#x5728;&#x6A21;&#x677F;&#x4E2D;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x548C;&#x503C;&#x3002;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x4E0D;&#x540C;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x975E;&#x7C7B;&#x578B;&#x5316;&#x7684;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x533A;&#x522B;&#x5F88;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x56FE;9.3&#x663E;&#x793A;&#x4E86; <code>declareVar</code> &#x6A21;&#x677F;&#x5982;&#x4F55;&#x751F;&#x6210;&#x5B9A;&#x4E49;&#x65B0;&#x53D8;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x56FE;9.3.&#x53C2;&#x6570;&#x5728;&#x6A21;&#x677F;&#x4E2D;&#x88AB;&#x66FF;&#x6362;&#xFF0C;&#x5176;&#x7C7B;&#x578B;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x63A5;&#x53D7;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x6807;&#x8BC6;&#x7B26;
<img src="Images/ch09_template_args.png" alt="alt "></p>
<p>&#x975E;&#x7C7B;&#x578B;&#x5316;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x5141;&#x8BB8;&#x6307;&#x5B9A;&#x5C1A;&#x672A;&#x58F0;&#x660E;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x5C06;&#x6B64;&#x7C7B;&#x578B;&#x547D;&#x540D;&#x4E3A;&#x975E;&#x7C7B;&#x578B;&#x5316;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x672A;&#x58F0;&#x660E;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x8FD8;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x3002;&#x4E0A;&#x9762;&#x793A;&#x4F8B;&#x4E2D;&#x7684;foo&#x6807;&#x8BC6;&#x7B26;&#x6CA1;&#x6709;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x58F0;&#x660E;&#xFF0C;&#x56E0;&#x6B64;&#x662F;&#x975E;&#x7C7B;&#x578B;&#x5316;&#x7684;&#x3002;&#x3002;</p>
<p>&#x7C7B;&#x578B;&#x5316;&#x6A21;&#x677F;&#x53C2;&#x6570;&#x5141;&#x8BB8;&#x6307;&#x5B9A;&#x5DF2;&#x58F0;&#x660E;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x6216;&#x5177;&#x6709;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x503C;42&#x6709;&#x4E00;&#x4E2A;int&#x7C7B;&#x578B;&#x3002;&#x8BE5;&#x7C7B;&#x578B;&#x5141;&#x8BB8;&#x6307;&#x5B9A;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x6A21;&#x677F;&#x4E5F;&#x5141;&#x8BB8;&#x60A8;&#x6307;&#x5B9A;int&#x3001;float&#x548C;string&#x7B49;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x8981;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BF4;&#x660E;&#x5DEE;&#x5F02;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x4EE5;&#x4E0B;declareVar&#x8C03;&#x7528;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">template</span> declareVar(varName: untyped, value: typed) =
  <span class="hljs-keyword">var</span> varName = value

<span class="hljs-keyword">var</span> myInt=<span class="hljs-number">42</span>
declareVar(foo&#xFF0C;myInt)  <span class="hljs-comment"># &lt;1&gt;</span>
declareVar(foo&#xFF0C;myUndeclardVar)  <span class="hljs-comment"># &lt;2&gt;</span>
</code></pre>
<blockquote>
<p><1>&#x8FD9;&#x5C06;&#x7F16;&#x8BD1;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0A;&#x9762;&#x58F0;&#x660E;&#x4E86;myInt&#x3002;</1></p>
<p><2>&#x8FD9;&#x5C06;&#x4E0D;&#x4F1A;&#x7F16;&#x8BD1;&#xFF0C;&#x56E0;&#x4E3A;myUndeclaredVar&#x672A;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x58F0;&#x660E;&#x3002;</2></p>
</blockquote>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x7C7B;&#x578B;&#x5316;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x80FD;&#x5C06;&#x672A;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x3002;&#x53EA;&#x6709;&#x5B9A;&#x4E49;&#x4E86;&#x5177;&#x6709;&#x8BE5;&#x540D;&#x79F0;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x624D;&#x80FD;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;&#x8BE5;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x7F16;&#x8BD1;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x5C06;&#x5BFC;&#x81F4;&#x672A;&#x58F0;&#x660E;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x9519;&#x8BEF;</p>
<h3 id="923-template-hygiene-&#x6A21;&#x677F;&#x6D01;&#x51C0;&#x6027;&#x7C7B;&#x4F3C;&#x4E8E;&#x95ED;&#x5305;&#xFF0C;&#x53D8;&#x91CF;&#x4E0D;&#x51FA;&#x4F5C;&#x7528;&#x57DF;">9.2.3 Template Hygiene &#x6A21;&#x677F;&#x6D01;&#x51C0;&#x6027;(&#x7C7B;&#x4F3C;&#x4E8E;&#x95ED;&#x5305;&#xFF0C;&#x53D8;&#x91CF;&#x4E0D;&#x51FA;&#x4F5C;&#x7528;&#x57DF;)</h3>
<p>&#x5982;&#x4E0A;&#x9762;&#x7684;declareVar&#x6A21;&#x677F;&#x6240;&#x793A;&#xFF0C;&#x6A21;&#x677F;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5728;&#x8C03;&#x7528;&#x6A21;&#x677F;&#x540E;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x53EF;&#x53D6;&#x7684;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x5728;&#x6A21;&#x677F;&#x5185;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x5C06;&#x5176;&#x66B4;&#x9732;&#x4E8E;&#x5916;&#x90E8;&#x8303;&#x56F4;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x80FD;&#x529B;&#x79F0;&#x4E3A;&#x6A21;&#x677F;&#x6D01;&#x51C0;&#x6027;&#x3002;</p>
<p>&#x518D;&#x6B21;&#x8003;&#x8651;&#x524D;&#x9762;&#x7684;&#x6A21;&#x677F;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">template</span>-declareVar(varName:untyped&#xFF0C;value:typed)=
 <span class="hljs-keyword">var</span> varName=value

declareVar(foo&#xFF0C;<span class="hljs-number">42</span>)
echo(foo)
</code></pre>
<p>&#x8C03;&#x7528;declareVar&#x6A21;&#x677F;&#x5C06;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x65B0;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;varName&#x53D8;&#x91CF;&#x88AB;&#x6CE8;&#x5165;&#x5230;&#x8C03;&#x7528;&#x8303;&#x56F4;&#x4E2D;&#x3002;&#x6CE8;&#x5165;&#x4F1A;&#x81EA;&#x52A8;&#x53D1;&#x751F;&#xFF0C;&#x56E0;&#x4E3A;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x53D6;&#x81EA;&#x6A21;&#x677F;&#x7684;&#x53C2;&#x6570;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x53D8;&#x91CF;&#x4E0D;&#x4F1A;&#x88AB;&#x6CE8;&#x5165;&#x5230;&#x6A21;&#x677F;&#x4E2D;&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x4EEC;&#x7528;&#xFF5B;.inject.&#xFF5D;pragma&#x663E;&#x5F0F;&#x6807;&#x8BB0;&#x3002;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x663E;&#x793A;&#x4E86;&#x6CE8;&#x5165;&#x53D8;&#x91CF;&#x548C;&#x672A;&#x6CE8;&#x5165;&#x53D8;&#x91CF;&#x7684;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x7684;&#x6BD4;&#x8F83;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">template</span> hygiene(varName: untyped) =
  <span class="hljs-keyword">var</span> varName = <span class="hljs-number">42</span>          <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">var</span> notInjected = <span class="hljs-number">128</span>     <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-keyword">var</span> injected <span class="hljs-meta">{.inject.}</span> = notInjected + <span class="hljs-number">2</span>     <span class="hljs-comment"># &lt;3&gt;</span>

hygiene(injectedImplicitly)

doAssert(injectedImplicitly == <span class="hljs-number">42</span>)
doAssert(injected == <span class="hljs-number">130</span>)
</code></pre>
<blockquote>
<p><1>&#x9690;&#x5F0F;&#x6CE8;&#x5165;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x540D;&#x79F0;&#x53D6;&#x81EA;varName&#x53C2;&#x6570;&#x3002;</1></p>
<p><2>&#x53EA;&#x80FD;&#x5728;&#x6B64;&#x6A21;&#x677F;&#x4E2D;&#x8BBF;&#x95EE;&#x3002;</2></p>
<p><3>&#x7531;&#x4E8E;&#xFF5B;.inject.&#xFF5D;pragma&#x800C;&#x6CE8;&#x5165;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;notInjected&#x53D8;&#x91CF;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x3002;</3></p>
</blockquote>
<p>&#x5C1D;&#x8BD5;&#x8BBF;&#x95EE;&#x6A21;&#x677F;&#x5916;&#x90E8;&#x7684;notInjected&#x53D8;&#x91CF;&#x5C06;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#xFF1A;&#x672A;&#x58F0;&#x660E;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF1A;&apos;notInjected&apos;&#x6D88;&#x606F;&#x3002;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x7531;&#x6A21;&#x677F;&#x6CE8;&#x5165;&#x8C03;&#x7528;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x5199;&#x6A21;&#x677F;&#x65F6;&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x7CBE;&#x786E;&#x5730;&#x8BB0;&#x5F55;&#x7531;&#x5176;&#x6CE8;&#x5165;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x6CE8;&#x610F;&#x4EC5;&#x66B4;&#x9732;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x6CE8;&#x5165;&#x53D8;&#x91CF;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x597D;&#x7684;&#x98CE;&#x683C;&#x3002;&#x6807;&#x51C6;&#x5E93;&#x53EA;&#x4F1A;&#x5C06;&#x5176;&#x6CE8;&#x5165;mapIt&#x4E4B;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x4E2D;&#x3002; (&#x6620;&#x5C04;&#x5230;&#xFF1F;)</p>
<p>&#x4E0A;&#x8FF0;&#x6D01;&#x51C0;&#x6027;&#x89C4;&#x5219;&#x4E0E;&#x4EE5;&#x4E0B;&#x5B9A;&#x4E49;&#x76F8;&#x540C;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
<span class="hljs-keyword">var</span>
<span class="hljs-keyword">let</span>
<span class="hljs-keyword">const</span>
</code></pre>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x90FD;&#x662F;&#x6D01;&#x51C0;&#x7684;&#x3002;&#x4EE5;&#x4E0B;&#x5B9A;&#x4E49;&#x7684;&#x89C4;&#x5219;&#x76F8;&#x53CD;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span>
<span class="hljs-keyword">iterator</span>
<span class="hljs-keyword">converter</span>
<span class="hljs-keyword">template</span>
<span class="hljs-keyword">macro</span>
</code></pre>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x662F;&#x4E0D;&#x6D01;&#x51C0;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4E3A;&#x4E86;&#x6355;&#x83B7;&#x6CA1;&#x6709;&#x89E3;&#x91CA;&#x7684;&#x6700;&#x5E38;&#x89C1;&#x7528;&#x4F8B;&#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x5B8F;&#xFF0C;&#x8FD9;&#x662F;Nim&#x4E2D;&#x4E0E;&#x6A21;&#x677F;&#x76F8;&#x5173;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5B83;&#x6BD4;&#x6A21;&#x677F;&#x7075;&#x6D3B;&#x5F97;&#x591A;&#xFF0C;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x5F97;&#x591A;&#x3002;</p>
<blockquote>
<p>[28] Nim&#x624B;&#x518C;&#x4E2D;  <code>do</code>  &#x7684;&#x8BF4;&#x660E;, <a href="http://nim-lang.org/docs/manual.html#procedures-do-notation" target="_blank">http://nim-lang.org/docs/manual.html#procedures-do-notation</a></p>
</blockquote>
<h2 id="93-macro-&#x5B8F;">9.3 Macro &#x5B8F;</h2>
<p>Nim&#x4E2D;&#x7684;&#x5B8F;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;Nim&#x8868;&#x8FBE;&#x5F0F;&#x6216;&#x8BED;&#x53E5;&#x3002;&#x5B8F;&#x662F;&#x8BFB;&#x53D6;&#x3001;&#x751F;&#x6210;&#x3001;&#x5206;&#x6790;&#x548C;&#x4FEE;&#x6539;Nim&#x4EE3;&#x7801;&#x7684;&#x6700;&#x7EC8;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x5B58;&#x5728;&#x4E8E;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x6A21;&#x677F;&#x786E;&#x5B9E;&#x662F;&#x5B8F;&#x7684;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x4E3B;&#x8981;&#x7531;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x66FF;&#x6362;&#x7EC4;&#x6210;&#x3002;&#x6A21;&#x677F;&#x88AB;&#x79F0;&#x4E3A;&#x58F0;&#x660E;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5728;&#x5176;&#x4E3B;&#x4F53;&#x4E2D;&#x663E;&#x793A;&#x4E86;&#x5E94;&#x8BE5;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x63CF;&#x8FF0;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x6240;&#x9700;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;Nim&#x5B8F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8FC7;&#x7A0B;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5305;&#x542B;&#x63CF;&#x8FF0;&#x5E94;&#x8BE5;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x6B65;&#x9AA4;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5F53;&#x8C03;&#x7528;&#x5B8F;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4E3B;&#x4F53;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Nim&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x4E2A;&#x76F8;&#x5173;&#x7279;&#x6027;&#xFF0C;&#x5373;&#x7F16;&#x8BD1;&#x65F6;&#x51FD;&#x6570;&#x6267;&#x884C;&#xFF0C;&#x4E5F;&#x4E0E;&#x5B8F;&#x7684;&#x7814;&#x7A76;&#x76F8;&#x5173;&#x3002;&#x6B64;&#x529F;&#x80FD;&#x5141;&#x8BB8;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#xFF0C;&#x60A8;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x5C0F;&#x8282;&#x4E2D;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5B8F;&#x5BF9;Nim&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x4E0E;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#x3002;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x60A8;&#x4E60;&#x60EF;&#x4E8E;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x7684;&#x6587;&#x672C;&#x8868;&#x793A;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4EE5;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x7F16;&#x5199;&#x3001;&#x8BFB;&#x53D6;&#x548C;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x3002;&#x4F46;&#x662F;&#x5B8F;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8868;&#x793A;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x79CD;&#x8868;&#x793A;&#x88AB;&#x79F0;&#x4E3A;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x3002;</p>
<p>&#x56FE;9.4&#x663E;&#x793A;&#x4E86;&#x6A21;&#x677F;&#x548C;&#x5B8F;&#x4E4B;&#x95F4;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x3002;</p>
<p>&#x56FE;9.4.&#x6A21;&#x677F;&#x662F;&#x58F0;&#x660E;&#x6027;&#x7684;&#xFF0C;&#x800C;&#x5B8F;&#x662F;&#x7A0B;&#x5E8F;&#x6027;&#x7684;&#x3002;
<img src="Images/ch09_template_macros.png" alt="alt "></p>
<p>&#x672C;&#x8282;&#x5C06;&#x5E26;&#x60A8;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#xFF0C;&#x4EE5;&#x4FBF;&#x6559;&#x60A8;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B8F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x60A8;&#x8FD8;&#x5C06;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x5B8F;&#x6280;&#x80FD;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x914D;&#x7F6E;&#x5E93;&#x3002;</p>
<h3 id="931&#x7F16;&#x8BD1;&#x65F6;&#x51FD;&#x6570;&#x6267;&#x884C;">9.3.1&#x7F16;&#x8BD1;&#x65F6;&#x51FD;&#x6570;&#x6267;&#x884C;</h3>
<p>&#x7F16;&#x8BD1;&#x65F6;&#x51FD;&#x6570;&#x6267;&#x884C;(CTFE)&#x662F;Nim&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6027;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x76F8;&#x5BF9;&#x5C11;&#x89C1;&#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#x3002;</p>
<p>CTFE&#x5DF2;&#x7ECF;&#x5728;&#x7B2C;2&#x7AE0;&#x4E2D;&#x5411;&#x60A8;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x8FC7;&#x4E86;&#xFF0C;&#x60A8;&#x770B;&#x5230;Nim&#x4E2D;&#x5E38;&#x91CF;&#x7684;&#x503C;&#x5FC5;&#x987B;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x53EF;&#x8BA1;&#x7B97;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> fillString(): <span class="hljs-built_in">string</span> =
  <span class="hljs-literal">result</span> = <span class="hljs-string">&quot;&quot;</span>
  echo(<span class="hljs-string">&quot;Generating string&quot;</span>)
  <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> <span class="hljs-number">0</span> .. <span class="hljs-number">4</span>:
    <span class="hljs-literal">result</span>.add($i)

<span class="hljs-keyword">const</span> count = fillString()
</code></pre>
<p>&#x7F16;&#x8BD1;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x65F6;&#xFF0C;&#x7F16;&#x8BD1;&#x6D88;&#x606F;&#x4E2D;&#x5C06;&#x663E;&#x793A;&#x6D88;&#x606F;&quot;Generating string&quot;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;fillString&#x8FC7;&#x7A0B;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#x7684;&#x3002;
&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5916;&#x90E8;&#x51FD;&#x6570;&#x63A5;&#x53E3;(FFI)&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x67D0;&#x4E9B;&#x6A21;&#x5757;/&#x8FC7;&#x7A0B;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x65E0;&#x6CD5;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x751F;&#x6210;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x9664;&#x975E;&#x60A8;&#x4F7F;&#x7528;staticExec&#x95F4;&#x63A5;&#x751F;&#x6210;&#x3002;</li>
<li>&#x7F16;&#x8BD1;&#x65F6;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x672A;&#x4F7F;&#x7528;&#xFF5B;compileTime.&#xFF5D;pragma&#x6CE8;&#x91CA;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;</li>
</ul>
<p>&#x5C3D;&#x7BA1;&#x6709;&#x8FD9;&#x4E9B;&#x9650;&#x5236;&#xFF0C;Nim&#x8FD8;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x53D8;&#x901A;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x5141;&#x8BB8;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x548C;&#x6267;&#x884C;&#x5916;&#x90E8;&#x8FDB;&#x7A0B;&#x7B49;&#x5E38;&#x89C1;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x4F7F;&#x7528; <code>staticRead</code> &#x548C; <code>staticExec</code> &#x8FC7;&#x7A0B;&#x6267;&#x884C;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5B8F;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x3001;&#x5206;&#x6790;&#x548C;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4E5F;&#x5FC5;&#x987B;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6267;&#x884C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x540C;&#x6837;&#x7684;&#x9650;&#x5236;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x4ED6;&#x4EEC;&#x3002;</p>
<h3 id="932-abstract-syntax-trees-&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;">9.3.2 Abstract Syntax Trees &#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;</h3>
<p>&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;(AST)&#x662F;&#x8868;&#x793A;&#x6E90;&#x4EE3;&#x7801;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x8BB8;&#x591A;&#x7F16;&#x8BD1;&#x5668;&#x5728;&#x6700;&#x521D;&#x89E3;&#x6790;&#x6E90;&#x4EE3;&#x7801;&#x540E;&#x5728;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x6709;&#x4E9B;&#x50CF;Nim&#x7F16;&#x8BD1;&#x5668;&#x5411;&#x7528;&#x6237;&#x516C;&#x5F00;&#x5B83;&#x3002;</p>
<p>AST&#x662F;&#x4E00;&#x68F5;&#x6811;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4EE3;&#x8868;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x4E86;&#x89E3;AST&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;AST&#x7684;&#x793A;&#x4F8B;&#x3002;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x6CD5;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;  <code>5*(5+10)</code>  &#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;AST&#x53EF;&#x80FD;&#x7C7B;&#x4F3C;&#x4E8E;<strong>&#x56FE;9.5</strong>&#x6240;&#x793A;&#x3002;</p>
<p>Figure 9.5. &#x8868;&#x793A;5*&#xFF08;5+10&#xFF09;&#x7684;&#x7B80;&#x5355;AST&#x56FE;</p>
<p><img src="Images/ch09_ast_simple.png" alt="alt &#x5C5E;&#x6027;&#x6587;&#x672C;"></p>
<p>&#x4ECE;&#x73B0;&#x5728;&#x8D77;&#xFF0C;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x628A;&#x8FD9;&#x4E2A;AST&#x79F0;&#x4E3A;Simple AST&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;Simple AST&#x5982;&#x4F55;&#x8868;&#x793A;&#x4E3A;Nim&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x6E05;&#x5355;9.1&#x663E;&#x793A;&#x4E86;Node&#x7C7B;&#x578B;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x7528;&#x4E8E;&#x5EFA;&#x6A21;Simple AST&#xFF0C;&#x5982;&#x56FE;9.5&#x6240;&#x793A;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">NodeKind</span> = <span class="hljs-keyword">enum</span>
    <span class="hljs-type">Literal</span>, <span class="hljs-type">Operator</span>       <span class="hljs-comment"># &lt;1&gt;</span>

  <span class="hljs-type">Node</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>
    <span class="hljs-keyword">case</span> kind: <span class="hljs-type">NodeKind</span>
    <span class="hljs-keyword">of</span> <span class="hljs-type">Literal</span>:
      value: <span class="hljs-built_in">int</span>            <span class="hljs-comment"># &lt;2&gt;</span>
    <span class="hljs-keyword">of</span> <span class="hljs-type">Operator</span>:
      left, right: <span class="hljs-type">Node</span>     <span class="hljs-comment"># &lt;3&gt;</span>
      operator: <span class="hljs-built_in">char</span>        <span class="hljs-comment"># &lt;4&gt;</span>

<span class="hljs-keyword">proc</span> newLiteralNode(value: <span class="hljs-built_in">int</span>): <span class="hljs-type">Node</span> =     <span class="hljs-comment"># &lt;4&gt;</span>
  <span class="hljs-literal">result</span> = <span class="hljs-type">Node</span>(
    kind: <span class="hljs-type">Literal</span>,
    value: value
  )

<span class="hljs-keyword">var</span> root = <span class="hljs-type">Node</span>(            <span class="hljs-comment"># &lt;6&gt;</span>
  kind: <span class="hljs-type">Operator</span>,
  operator: &apos;*&apos;,
  left: newLiteralNode(<span class="hljs-number">5</span>),
  right: <span class="hljs-type">Node</span>(
    kind: <span class="hljs-type">Operator</span>,
    operator: &apos;+&apos;,
    left: newLiteralNode(<span class="hljs-number">5</span>),
    right: newLiteralNode(<span class="hljs-number">10</span>),
  )
)
</code></pre>
<blockquote>
<p><1> &#x5728;SimpleAST&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#xFF1A;&#x5305;&#x542B;&#x4EFB;&#x610F;&#x6570;&#x5B57;&#x7684;&#x6587;&#x672C;&#x548C;&#x6307;&#x5B9A;&#x8981;&#x6267;&#x884C;&#x7684;&#x7B97;&#x672F;&#x8FD0;&#x7B97;&#x7C7B;&#x578B;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x3002;</1></p>
<p><2> &#x5982;&#x679C;&#x8282;&#x70B9;&#x662F;&#x6587;&#x672C;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x503C;&#x5B57;&#x6BB5;&#x4E2D;&#x5B58;&#x50A8;int&#x3002;</2></p>
<p><3> &#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x6700;&#x591A;&#x53EF;&#x4EE5;&#x6709;&#x4E24;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x6B64;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#x5141;&#x8BB8;&#x5F62;&#x6210;&#x6811;&#x3002;</3></p>
<p><4> &#x5982;&#x679C;&#x8282;&#x70B9;&#x662F;&#x6587;&#x672C;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x8FD0;&#x7B97;&#x7B26;&#x5B57;&#x6BB5;&#x4E2D;&#x5B58;&#x50A8;&#x5B57;&#x7B26;&#x3002;</4></p>
<p><5> &#x521B;&#x5EFA;&#x65B0;&#x6587;&#x672C;&#x8282;&#x70B9;&#x7684;&#x4FBF;&#x6377;&#x8FC7;&#x7A0B;&#x3002;</5></p>
<p><6> &#x6839;&#x53D8;&#x91CF;&#x4FDD;&#x5B58;&#x5BF9;AST&#x4E2D;&#x6839;&#x8282;&#x70B9;&#x7684;&#x5F15;&#x7528;&#x3002;</6></p>
</blockquote>
<p>&#x6839;&#x8282;&#x70B9;&#x73B0;&#x5728;&#x4EE5;AST&#x7684;&#x5F62;&#x5F0F;&#x4FDD;&#x5B58;   <code>5*(5+10)</code>  &#x7684;&#x5B8C;&#x6574;&#x8868;&#x793A;&#x3002;&#x56FE;9.6&#x663E;&#x793A;&#x4E86;SimpleAST&#x56FE;&#x5982;&#x4F55;&#x6620;&#x5C04;&#x5230;&#x6E05;&#x5355;9.1&#x4E2D;&#x5B9A;&#x4E49;&#x7684;Node&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x56FE;9.6&#x3002;&#x4E00;&#x4E2A;&#x5E26;&#x6CE8;&#x91CA;&#x7684;&#x56FE;9.5&#x663E;&#x793A;&#x4E86;&#x5B83;&#x5982;&#x4F55;&#x6620;&#x5C04;&#x5230;&#x6E05;&#x5355;9.1&#x4E2D;&#x7684;&#x6839;&#x76EE;&#x5F55;
<img src="Images/ch09_ast_simple_annotated.png" alt=""></p>
<p>&#x60A8;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C06;&#x4EFB;&#x4F55;Node&#x5B9E;&#x4F8B;&#x8F6C;&#x6362;&#x4E3A;&#x5176;&#x6587;&#x672C;&#x8868;&#x793A;&#xFF0C;&#x6216;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x7F29;&#x8FDB;&#x7684;&#x683C;&#x5F0F;&#x5C06;&#x5176;&#x663E;&#x793A;&#x4E3A;&#x6811;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>&#x6E05;&#x5355;9.2.&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x7F29;&#x8FDB;&#x7684;&#x683C;&#x5F0F;&#x663E;&#x793A;&#x7684;  <code>5*(5+10)</code>  &#x7684;&#x7B80;&#x5316;AST</p>
<pre><code>Operator &apos;*&apos;
  Literal 5
  Operator &apos;+&apos;
    Literal 5
    Literal 10`
</code></pre><p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;Nim&#x7684;AST&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x5B83;&#x5EFA;&#x6A21;&#x7684;&#x8BED;&#x8A00;&#x6BD4;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x590D;&#x6742;&#x5F97;&#x591A;&#x3002;&#x7531;simple AST&#x5EFA;&#x6A21;&#x7684;&#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x4E5F;&#x662F;&#x6709;&#x6548;&#x7684;Nim&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;Nim&#x7684;AST&#x4E0E;&#x4E4B;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B8F;&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;dumpTree&#x5B8F;&#xFF0C;&#x8BE5;&#x5B8F;&#x5C06;&#x4E00;&#x5757;&#x4EE3;&#x7801;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4EE5;&#x4E0E;&#x6E05;&#x5355;9.2&#x6240;&#x793A;&#x76F8;&#x540C;&#x7684;&#x57FA;&#x4E8E;&#x7F29;&#x8FDB;&#x7684;&#x683C;&#x5F0F;&#x8F93;&#x51FA;&#x4EE3;&#x7801;&#x5757;&#x7684;AST&#x3002;
&#x8981;&#x5728;Nim&#x4E2D;&#x663E;&#x793A;  <code>5*(5+10)</code>  &#x7684;AST&#xFF0C;&#x8BF7;&#x7F16;&#x8BD1;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x5217;&#x8868;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros

dumpTree:
  <span class="hljs-number">5</span> * (<span class="hljs-number">5</span> + <span class="hljs-number">10</span>)
</code></pre>
<p>&#x5728;&#x6765;&#x81EA;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x6D88;&#x606F;&#x4E2D;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-type">StmtList</span>
  <span class="hljs-type">Infix</span>
    <span class="hljs-type">Ident</span> <span class="hljs-string">&quot;*&quot;</span>
    <span class="hljs-type">IntLit</span> <span class="hljs-number">5</span>
    <span class="hljs-type">Par</span>
      <span class="hljs-type">Infix</span>
        <span class="hljs-type">Ident</span> <span class="hljs-string">&quot;+&quot;</span>
        <span class="hljs-type">IntLit</span> <span class="hljs-number">5</span>
        <span class="hljs-type">IntLit</span> <span class="hljs-number">10</span>
</code></pre>
<p>&#x60A8;&#x5C06;&#x6CE8;&#x610F;&#x5230;&#xFF0C;Nim AST&#x5728;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x65B9;&#x9762;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1A;</p>
<ul>
<li>&#x5B83;&#x5305;&#x62EC;&#x66F4;&#x591A;&#x7684;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982; <code>StmtList</code> &#x3001; <code>Infix</code> &#x548C; <code>Ident</code> &#xFF0C;&#x4EE5;&#x53CA; <code>Par</code></li>
<li>AST&#x4E0D;&#x518D;&#x662F;&#x4E8C;&#x53C9;&#x6811;&#xFF1A;&#x67D0;&#x4E9B;&#x8282;&#x70B9;&#x5305;&#x542B;2&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x3002;</li>
</ul>
<p>&#x4F46;&#x662F;&#x7ED3;&#x6784;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;AST&#x53EA;&#x5305;&#x542B;&#x5173;&#x4E8E;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x4F7F;&#x7528;&#x4E2D;&#x7F00;&#x8868;&#x793A;&#x6CD5;&#x8C03;&#x7528; <code>*</code> &#x548C; <code>+</code> &#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x5E76;&#x4E14;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5305;&#x542B;&#x5728;&#x62EC;&#x53F7;&#x4E2D;&#x3002;</p>
<p>AST&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4EFB;&#x4F55;&#x6709;&#x6548;&#x7684;Nim&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x6B64;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x7684;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#x3002;&#x8981;&#x4E86;&#x89E3;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x663E;&#x793A;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x6784;&#x9020;&#x7684;AST&#xFF0C;&#x4F8B;&#x5982;&#x8FC7;&#x7A0B;&#x3001;for&#x5FAA;&#x73AF;&#x3001;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x3001;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4EE5;&#x53CA;&#x60A8;&#x53EF;&#x4EE5;&#x60F3;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6784;&#x9020;&#x3002;</p>
<p>Nim AST&#x5728;&#x4EE5;&#x4E0B;URL&#x63D0;&#x4F9B;&#x7684;&#x5B8F;&#x6A21;&#x5757;&#x6587;&#x6863;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x63CF;&#x8FF0;&#xFF1A;<a href="http://nim-lang.org/docs/macros.html" target="_blank">http://nim-lang.org/docs/macros.html</a> &#x8BE5;&#x6587;&#x6863;&#x5305;&#x542B;&#x4E00;&#x4E2A;NimNode&#x7C7B;&#x578B;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8BE5;&#x7C7B;&#x578B;&#x4E0E;&#x6E05;&#x5355;9.1&#x4E2D;&#x5B9A;&#x4E49;&#x7684;Node&#x7C7B;&#x578B;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;&#x5B8F;&#x6A21;&#x5757;&#x8FD8;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x53EF;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x3001;&#x4FEE;&#x6539;&#x548C;&#x8BFB;&#x53D6;AST&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x5728;&#x7EE7;&#x7EED;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x3002;&#x8868;9.1&#x63CF;&#x8FF0;&#x4E86;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x60A8;&#x770B;&#x5230;&#x7684;Nim AST&#x4E2D;&#x7684;&#x6BCF;&#x79CD;&#x8282;&#x70B9;&#x7C7B;&#x578B;:</p>
<table>
<thead>
<tr>
<th>&#x8282;&#x70B9;&#x7C7B;&#x578B;</th>
<th>&#x63CF;&#x8FF0;</th>
<th>&#x5B50;&#x8282;&#x70B9;&#x7C7B;&#x578B;</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>StmtList</code></td>
<td>&#x8BED;&#x53E5;&#x5217;&#x8868;</td>
<td>&#x8868;&#x793A;&#x8BED;&#x53E5;&#x7684;&#x4EFB;&#x610F;&#x6570;&#x91CF;Nim&#x8282;&#x70B9;</td>
</tr>
<tr>
<td><code>Infix</code></td>
<td>&#x4E2D;&#x7F00;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;5*5</td>
<td>&#x4E2D;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4E2D;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;</td>
</tr>
<tr>
<td><code>Ident</code></td>
<td>&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x8FC7;&#x7A0B;&#x6216;&#x53D8;&#x91CF;&#x540D;</td>
<td>&#x8282;&#x70B9;&#x7684;&#x6807;&#x8BC6;&#x5B57;&#x6BB5;&#x5305;&#x542B;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x5B50;&#x7EA7;</td>
</tr>
<tr>
<td><code>Par</code></td>
<td>&#x5706;&#x62EC;&#x53F7;</td>
<td>&#x4EE3;&#x7801;&#x5728;&#x62EC;&#x53F7;&#x5185;</td>
</tr>
<tr>
<td><code>IntLit</code></td>
<td>&#x6574;&#x6570;&#x91CF;&#xFF0C;&#x8282;&#x70B9;&#x5B57;&#x6BB5;&#x7684;&#x6574;&#x6570;&#x503C;</td>
<td>&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x5B50;&#x7EA7;</td>
</tr>
</tbody>
</table>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x5B8F;&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x8FC7;&#x7A0B;&#x6784;&#x5EFA;  <code>5*(5+10)</code>  &#x7684;Nim AST&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6E05;&#x5355;9.1&#x4E2D;&#x7684;root&#x5B9A;&#x4E49;&#x3002;&#x6E05;&#x5355;9.3&#x663E;&#x793A;&#x4E86;&#x521B;&#x5EFA;  <code>5*(5+10)</code>  &#x7684;Nim AST&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x6E05;&#x5355;9.3.&#x521B;&#x5EFA;  <code>5*(5+10)</code>  &#x7684;Nim AST</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros     <span class="hljs-comment"># &lt;1&gt;</span>

<span class="hljs-keyword">static</span>:           <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-keyword">var</span> root = newStmtList(
    infix(
      newIntLitNode(<span class="hljs-number">5</span>),
      <span class="hljs-string">&quot;*&quot;</span>,
      newPar(
        infix(
          newIntLitNode(<span class="hljs-number">5</span>),
          <span class="hljs-string">&quot;+&quot;</span>,
          newIntLitNode(<span class="hljs-number">10</span>)
        )
      )
    )
  )
  echo(root.repr)     <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x5B8F;&#x6A21;&#x5757;&#x5B9A;&#x4E49;&#x4E86;&#x6784;&#x5EFA;AST&#x7684;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x6B65;&#x9AA4;&#x3002;</1></p>
<p><2>  <code>static</code> &#x5173;&#x952E;&#x5B57;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x8FD0;&#x884C;&#x5176;&#x4E3B;&#x4F53;&#x3002;&#x56E0;&#x4E3A;AST&#x8FC7;&#x7A0B;&#x4EC5;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x53EF;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;&#x3002;</2></p>
<p><3>  <code>repr</code> &#x8C03;&#x7528;&#x5C06;&#x6839;&#x8282;&#x70B9;&#x8F6C;&#x6362;&#x4E3A;Nim&#x4EE3;&#x7801;&#x7684;&#x6587;&#x672C;&#x8868;&#x793A;&#x3002;</3></p>
</blockquote>
<p>&#x7F16;&#x8BD1;&#x6E05;&#x5355;9.3&#xFF0C;&#x6CE8;&#x610F;&#x8F93;&#x51FA;&#x662F;  <code>5*(5+10)</code>  &#x3002;&#x60A8;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x6784;&#x5EFA;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;NimAST&#xFF01;</p>
<h3 id="933-&#x5B8F;&#x5B9A;&#x4E49;">9.3.3 &#x5B8F;&#x5B9A;&#x4E49;</h3>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x60A8;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;AST&#x662F;&#x4EC0;&#x4E48;&#x3001;&#x5982;&#x4F55;&#x6784;&#x9020;&#x5B83;&#x4EE5;&#x53CA;&#x5728;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x663E;&#x793A;&#x5B83;&#x7684;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x3002;&#x4F46;&#x60A8;&#x4ECD;&#x7136;&#x7F3A;&#x5C11;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x77E5;&#x8BC6;&#xFF1A;&#x53D1;&#x51FA;&#x751F;&#x6210;&#x7684;AST&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x6240;&#x4EE3;&#x8868;&#x7684;Nim&#x4EE3;&#x7801;&#x5305;&#x542B;&#x5728;&#x6700;&#x7EC8;&#x7684;&#x53EF;&#x6267;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;
&#x5B8F;&#x6B63;&#x662F;&#x7528;&#x4E8E;&#x6B64;&#x76EE;&#x7684;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x60A8;&#x5DF2;&#x7ECF;&#x6784;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x6570;&#x503C;&#x7684;&#x7B80;&#x5355;&#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x7684;AST&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x53D1;&#x51FA;AST&#x7684;&#x5B8F;&#xFF0C;&#x4EE5;&#x4FBF;&#x8BA1;&#x7B97;&#x7B97;&#x672F;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>&#x6E05;&#x5355; 9.4. &#x4F20;&#x9012;(Emit&#xFF0C;&#x53D1;&#x51FA;&#xFF0C;&#x4F20;&#x9012;&#xFF0C;&#x6563;&#x53D1;&#xFF0C;&#x53D1;&#x5C04;)&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x5B8F; 5 * (5 + 10)</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros      <span class="hljs-comment"># &lt;1&gt;</span>

<span class="hljs-keyword">macro</span> calculate(): <span class="hljs-built_in">int</span> =     <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-literal">result</span> = newStmtList(      <span class="hljs-comment"># &lt;3&gt;</span>
    infix(         <span class="hljs-comment"># &lt;4&gt;</span>
      newIntLitNode(<span class="hljs-number">5</span>),      <span class="hljs-comment"># &lt;4&gt;</span>
      <span class="hljs-string">&quot;*&quot;</span>,         <span class="hljs-comment"># &lt;6&gt;</span>
      newPar(      <span class="hljs-comment"># &lt;7&gt;</span>
        infix(     <span class="hljs-comment"># &lt;8&gt;</span>
          newIntLitNode(<span class="hljs-number">5</span>),
          <span class="hljs-string">&quot;+&quot;</span>,     <span class="hljs-comment"># &lt;6&gt;</span>
          newIntLitNode(<span class="hljs-number">10</span>)
        )
      )
    )
  )

echo(calculate())
</code></pre>
<blockquote>
<p><1> &#x5BFC;&#x5165;AST&#x521B;&#x5EFA;&#x6240;&#x9700;&#x7684;&#x5B8F;&#x6A21;&#x5757;&#x3002;</1></p>
<p><2> &#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>calculate</code> &#x7684;&#x65B0;&#x5B8F;&#x3002;</2></p>
<p><3> &#x521B;&#x5EFA;&#x5E26;&#x6709;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x65B0; <code>StmtList</code> &#x8282;&#x70B9;&#x3002;&#x7ED3;&#x679C;&#x8282;&#x70B9;&#x751F;&#x6210;  <code>5*(5+10)</code>  &#x3002;</3></p>
<p><4> &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>Infix</code> &#x8282;&#x70B9;&#x4F5C;&#x4E3A; <code>StmtList</code> &#x8282;&#x70B9;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x7ED3;&#x679C;&#x8282;&#x70B9;&#x751F;&#x6210;  <code>5*(5+10)</code>  &#x3002;</4></p>
<p><5> &#x5C06;&#x65B0; <code>IntLit</code> &#x8282;&#x70B9;&#x521B;&#x5EFA;&#x4E3A; <code>Infix</code> &#x8282;&#x70B9;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x7ED3;&#x679C;&#x8282;&#x70B9;&#x4EA7;&#x751F; <code>5</code> &#x3002;</5></p>
<p><6> &#x6307;&#x5B9A;&#x8981;&#x8C03;&#x7528;&#x7684;&#x4E2D;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#x3002;</6></p>
<p><7> &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>Par</code> &#x8282;&#x70B9;&#x4F5C;&#x4E3A; <code>Infix</code> &#x8282;&#x70B9;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x7ED3;&#x679C;&#x8282;&#x70B9;&#x4EA7;&#x751F;(5+10)&#x3002;</7></p>
<p><8> &#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>Infix</code> &#x8282;&#x70B9;&#x4F5C;&#x4E3A; <code>Par</code> &#x8282;&#x70B9;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x7ED3;&#x679C;&#x8282;&#x70B9;&#x4EA7;&#x751F; <code>5+10</code> &#x3002;</8></p>
</blockquote>
<p>&#x5173;&#x4E8E;&#x6E05;&#x5355;9.4&#xFF0C;&#x6709;&#x4E24;&#x4EF6;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B8F;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0E;&#x8FC7;&#x7A0B;&#x548C;&#x6A21;&#x677F;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8C03;&#x7528;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5728;&#x5B8F;&#x4E3B;&#x4F53;&#x4E2D;&#x6784;&#x5EFA;&#x7684;AST&#x6811;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x5B8F;&#x5F53;&#x524D;&#x4EC5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x5220;&#x9664;StmtList&#x8282;&#x70B9;&#x3002;&#x8BA1;&#x7B97;&#x5B8F;&#x7684;&#x65B0;&#x5B9A;&#x4E49;&#x5982;&#x6E05;&#x5355;9.5&#x6240;&#x793A;&#x3002;</p>
<p>&#x6E05;&#x5355;9.5.&#x5728;&#x5B8F;&#x4E2D;&#x751F;&#x6210;&#x5355;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros

<span class="hljs-keyword">macro</span> calculate(): <span class="hljs-built_in">int</span> =
  <span class="hljs-literal">result</span> = infix(         <span class="hljs-comment"># &lt;1&gt;</span>
    newIntLitNode(<span class="hljs-number">5</span>),     <span class="hljs-comment"># &lt;2&gt;</span>
    <span class="hljs-string">&quot;*&quot;</span>,        <span class="hljs-comment"># &lt;3&gt;</span>
    newPar(     <span class="hljs-comment"># &lt;4&gt;</span>
      infix(
        newIntLitNode(<span class="hljs-number">5</span>),
        <span class="hljs-string">&quot;+&quot;</span>,
        newIntLitNode(<span class="hljs-number">10</span>)
      )
    )
  )

echo(calculate())
</code></pre>
<blockquote>
<p><1> &#x521B;&#x5EFA;&#x65B0;&#x7684; <code>Infix</code> &#x8282;&#x70B9;&#x3002;&#x751F;&#x6210;&#x7684;&#x8282;&#x70B9;&#x751F;&#x6210;  <code>5*(5+10)</code>  &#x3002;</1></p>
<p><2> &#x521B;&#x5EFA;&#x65B0;&#x7684; <code>IntLit</code> &#x8282;&#x70B9;&#x3002;&#x751F;&#x6210;&#x7684;&#x8282;&#x70B9;&#x751F;&#x6210; <code>5</code> &#x3002;</2></p>
<p><3> &#x6307;&#x5B9A;&#x8981;&#x8C03;&#x7528;&#x7684;&#x4E2D;&#x7F00;&#x8FD0;&#x7B97;&#x7B26;&#x3002;</3></p>
<p><4> &#x521B;&#x5EFA;&#x65B0;&#x7684; <code>Par</code> &#x8282;&#x70B9;&#x3002;&#x7ED3;&#x679C;&#x8282;&#x70B9;&#x4EA7;&#x751F;(5+10)&#x3002;</4></p>
</blockquote>
<p>&#x5B8F;&#x751F;&#x6210;&#x529F;&#x80FD;&#x7B49;&#x6548;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6CA1;&#x6709;&#x591A;&#x4F59;&#x7684;AST&#x8282;&#x70B9;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x5B8F;&#x793A;&#x4F8B;&#xFF0C;&#x65E8;&#x5728;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5B8F;&#x5982;&#x4F55;&#x4F7F;&#x7528;AST&#x6765;&#x53D1;&#x51FA;Nim&#x4EE3;&#x7801;&#x3002;&#x7B49;&#x6548;&#x6A21;&#x677F;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x529F;&#x80FD;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">template</span> calculate(): <span class="hljs-built_in">int</span> = <span class="hljs-number">5</span> * (<span class="hljs-number">5</span> + <span class="hljs-number">10</span>)

echo(calculate())
</code></pre>
<p>&#x8BA1;&#x7B97;&#x5B8F;&#x751F;&#x6210;&#x9759;&#x6001;AST&#xFF0C;&#x4F46;&#x5B8F;&#x7684;&#x771F;&#x6B63;&#x5A01;&#x529B;&#x662F;&#x52A8;&#x6001;&#x751F;&#x6210;AST&#x7684;&#x80FD;&#x529B;&#x3002;&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x6700;&#x597D;&#x5730;&#x5229;&#x7528;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x3002;</p>
<h3 id="934-&#x5B8F;&#x7684;&#x53C2;&#x6570;">9.3.4 &#x5B8F;&#x7684;&#x53C2;&#x6570;</h3>
<p> &#x5C31;&#x50CF;&#x8FC7;&#x7A0B;&#x548C;&#x6A21;&#x677F;&#x4E00;&#x6837;&#xFF0C;&#x8C03;&#x7528;&#x5B8F;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5411;&#x5B83;&#x4EEC;&#x4F20;&#x9012;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x5B8F;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4ECE;&#x800C;&#x6539;&#x53D8;&#x5B83;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x4F20;&#x9012;&#x5B8F;&#x5E94;&#x5728;&#x5176;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3002;</p>
<p> &#x4E0D;&#x8FC7;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;&#x5B8F;&#x7684;&#x53C2;&#x6570;&#x5E94;&#x8BE5;&#x6709;&#x70B9;&#x4E0D;&#x540C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B8F;&#x53C2;&#x6570;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x662F;int&#xFF0C;&#x4F46;&#x5728;&#x5B8F;&#x7684;&#x4E3B;&#x4F53;&#x4E2D;&#x5B83;&#x662F;NimNode&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x6F14;&#x793A;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros

<span class="hljs-keyword">macro</span> arguments(number: <span class="hljs-built_in">int</span>, unknown: untyped): untyped =     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-literal">result</span> = newStmtList()      <span class="hljs-comment"># &lt;2&gt;</span>
  echo number.treeRepr()      <span class="hljs-comment"># &lt;3&gt;</span>
  echo unknown.treeRepr()     <span class="hljs-comment"># &lt;3&gt;</span>

arguments(<span class="hljs-number">71</span>, [<span class="hljs-string">&quot;12&quot;</span>, <span class="hljs-string">&quot;89&quot;</span>])
</code></pre>
<blockquote>
<p><1>&#x6BCF;&#x4E2A;&#x5B8F;&#x90FD;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x3002;</1></p>
<p><2>&#x6BCF;&#x4E2A;&#x5B8F;&#x90FD;&#x5FC5;&#x987B;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;AST&#xFF0C;&#x5728;&#x6B64;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7A7A;&#x7684; <code>StmtList</code> &#x8282;&#x70B9;&#x4EE5;&#x6EE1;&#x8DB3;&#x6B64;&#x89C4;&#x5219;&#x3002;
 <3>  <code>treeRepr</code> &#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#x4E8E; <code>dumpTree</code> &#x5B8F;&#xFF0C;&#x5B83;&#x8FD4;&#x56DE; <code>NimNode</code> &#x7684;&#x56DB;&#x5143;&#x7EC4;&#x8868;&#x793A;&#x3002;</3></2></p>
</blockquote>
<p>&#x7F16;&#x8BD1;&#x6B64;&#x5217;&#x8868;&#x5C06;&#x4EA7;&#x751F;&#x4EE5;&#x4E0B;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-type">IntLit</span> <span class="hljs-number">71</span>     <span class="hljs-comment"># &lt;1&gt;</span>
<span class="hljs-type">Bracket</span>       <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-type">StrLit</span> <span class="hljs-number">12</span>
  <span class="hljs-type">StrLit</span> <span class="hljs-number">89</span>
</code></pre>
<blockquote>
<p><1> &#x4F20;&#x9012;&#x7ED9;&#x5B8F;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684; AST&#xFF1A;71&#x3002;</1></p>
<p><2> &#x4F20;&#x9012;&#x7ED9;&#x5B8F;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7684; AST&#xFF1A;[&quot;12&quot;,&quot;89&quot;]</2></p>
</blockquote>
<p>&#x60A8;&#x9700;&#x8981;&#x4ECE;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#x5B66;&#x4E60;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#xFF1A;</p>
<ul>
<li>&#x5B8F;&#x5FC5;&#x987B;&#x59CB;&#x7EC8;&#x5177;&#x6709;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x59CB;&#x7EC8;&#x8FD4;&#x56DE;&#x6709;&#x6548;&#x7684; <code>AST</code> &#xFF0C;&#x5373;&#x4F7F;&#x8BE5; AST &#x672C;&#x8D28;&#x4E0A;&#x662F;&#x7A7A;&#x7684;&#x3002;</li>
<li>&#x6240;&#x6709;&#x5B8F;&#x53C2;&#x6570;&#x90FD;&#x662F; <code>Nim-AST</code> &#x8282;&#x70B9;&#x3002;</li>
</ul>
<p>&#x540E;&#x4E00;&#x70B9;&#x975E;&#x5E38;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x5B8F;&#x5DF2;&#x7ECF;&#x64CD;&#x7EB5;&#x4E86;AST&#x3002;&#x5C06;&#x6BCF;&#x4E2A;&#x5B8F;&#x53C2;&#x6570;&#x8868;&#x793A;&#x4E3A;AST&#x8282;&#x70B9;&#x5141;&#x8BB8;&#x5728;Nim&#x4E2D;&#x901A;&#x5E38;&#x4E0D;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x7684;&#x6784;&#x9020;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-nim">arguments(<span class="hljs-number">71</span>, [<span class="hljs-string">&quot;12&quot;</span>, <span class="hljs-number">876</span>, <span class="hljs-number">0</span>.<span class="hljs-number">5</span>, -<span class="hljs-number">0</span>.<span class="hljs-number">9</span>])
</code></pre>
<p>&#x6B64;&#x793A;&#x4F8B;&#x663E;&#x793A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x4EE5;&#x4E0B;AST&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-type">Bracket</span>
  <span class="hljs-type">StrLit</span> <span class="hljs-number">12</span>
  <span class="hljs-type">IntLit</span> <span class="hljs-number">876</span>
  <span class="hljs-type">Float64Lit</span> <span class="hljs-number">0</span>.<span class="hljs-number">5</span>
  <span class="hljs-type">Prefix</span>
    <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;-&quot;</span>
    <span class="hljs-type">Float64Lit</span> <span class="hljs-number">0</span>.<span class="hljs-number">9</span>`
</code></pre>
<p>Nim&#x4E2D;&#x7684;&#x6570;&#x7EC4;&#x662F;&#x540C;&#x6784;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x5305;&#x542B;&#x7684;&#x6BCF;&#x4E2A;&#x503C;&#x90FD;&#x5FC5;&#x987B;&#x662F;&#x76F8;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5C1D;&#x8BD5;&#x58F0;&#x660E;&#x503C;&#x4E3A; <code>12 &#x3001;876&#x3001;0.5&#x3001;-0.9</code> &#x7684;&#x6570;&#x7EC4;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x5305;&#x62EC;&#x5B57;&#x7B26;&#x4E32;&#x3001;int&#x548C;float&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B8F;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x8C03;&#x7528;&#x5B8F;&#x65F6;&#x4F7F;&#x7528;&#x5F02;&#x6784;&#x6570;&#x7EC4;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x8FD9;&#x5E94;&#x8BE5;&#x80FD;&#x8BA9;&#x4F60;&#x5F88;&#x597D;&#x5730;&#x4E86;&#x89E3;&#x57FA;&#x672C;&#x7684;&#x5B8F;&#x89C2;&#x6982;&#x5FF5;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x914D;&#x7F6E;DSL&#x3002;</p>
<h2 id="94-&#x521B;&#x5EFA;&#x914D;&#x7F6E;-dsl">9.4 &#x521B;&#x5EFA;&#x914D;&#x7F6E; DSL</h2>
<p>&#x5143;&#x7F16;&#x7A0B;&#x5141;&#x8BB8;&#x7684;&#x6700;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#x4E4B;&#x4E00;&#x662F;&#x521B;&#x5EFA;&#x9886;&#x57DF;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x3002;&#x9886;&#x57DF;&#x7279;&#x5B9A;&#x8BED;&#x8A00;(DSL)&#x662F;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x7684;&#x8BED;&#x8A00;&#x3002;&#x5728;Nim&#x8BED;&#x6CD5;&#x7684;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x975E;&#x5E38;&#x7075;&#x6D3B;&#x548C;&#x76F4;&#x89C2;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4F7F;&#x7F16;&#x5199;&#x8F6F;&#x4EF6;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x7F16;&#x5199;DSL&#x6765;&#x5B9A;&#x4E49;HTML&#x7684;&#x7ED3;&#x6784;&#x3002;&#x60A8;&#x5C06;&#x7F16;&#x5199;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7F16;&#x5199;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x7684;&#x957F;&#x5B57;&#x7B26;&#x4E32;&#x6587;&#x5B57;&#xFF1A;</p>
<pre><code class="lang-Nim">html:
  head: title(<span class="hljs-string">&quot;My page&quot;</span>)
  body: h1(<span class="hljs-string">&quot;Hello!&quot;</span>)
</code></pre>
<p>&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x914D;&#x7F6E;DSL&#x3002;&#x8BE5;DSL&#x5C06;&#x5141;&#x8BB8;&#x60A8;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x5B9A;&#x4E49;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x7136;&#x540E;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;&#x7ED3;&#x6784;&#x8F7B;&#x677E;&#x5730;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;&#x60A8;&#x5C06;&#x9996;&#x5148;&#x770B;&#x5230;&#x5178;&#x578B;&#x7684;DSL&#x662F;&#x5982;&#x4F55;&#x5728;Nim&#x7684;AST&#x4E2D;&#x8868;&#x793A;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x60A8;&#x5C06;&#x67E5;&#x770B;&#x6240;&#x9700;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;AST&#x8868;&#x793A;&#xFF0C;&#x6700;&#x540E;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x5728;&#x7528;&#x6237;&#x4F7F;&#x7528;DSL&#x65F6;&#x6839;&#x636E;&#x7528;&#x6237;&#x6307;&#x5B9A;&#x7684;&#x4FE1;&#x606F;&#x6784;&#x5EFA;AST&#x3002;</p>
<p>&#x60A8;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x521B;&#x5EFA;&#x7684;DSL&#x5C06;&#x5141;&#x8BB8;&#x7F16;&#x5199;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> configurator

config <span class="hljs-type">MyAppConfig</span>:
  address: <span class="hljs-built_in">string</span>
  port: <span class="hljs-built_in">int</span>

<span class="hljs-keyword">var</span> config = newMyAppConfig()
config.load(<span class="hljs-string">&quot;myapp.cfg&quot;</span>)
echo(<span class="hljs-string">&quot;Configuration address: &quot;</span>, config.address)
echo(<span class="hljs-string">&quot;Configuration port: &quot;</span>, config.port)
</code></pre>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>MyAppConfig</code> &#x7684;&#x7B80;&#x5355;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x4E24;&#x6761;&#x4FE1;&#x606F;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x7684;&#x7AEF;&#x53E3;&#x3002;&#x8BE5;&#x5B9A;&#x4E49;&#x4F7F;&#x7528;&#x6784;&#x9020;&#x51FD;&#x6570;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x672C;&#x5730;myapp.cfg&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5B57;&#x6BB5;&#x8BBF;&#x95EE;&#xFF0C;&#x5176;&#x503C;&#x663E;&#x793A;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x3002;</p>
<p>&#x6307;&#x5B9A;&#x8FD9;&#x6837;&#x7684;&#x914D;&#x7F6E;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7B80;&#x5316;&#x4E86;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x5B9A;&#x4E49;&#x4E86;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x9605;&#x8BFB;&#x548C;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x6B64;DSL&#x5C06;&#x88AB;&#x7F16;&#x5199;&#x4E3A;&#x540D;&#x4E3A; <code>configuration</code> &#x7684;&#x5E93;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x5427;&#xFF01;</p>
<h3 id="941&#x542F;&#x52A8;&#x914D;&#x7F6E;&#x5668;&#x9879;&#x76EE;">9.4.1&#x542F;&#x52A8;&#x914D;&#x7F6E;&#x5668;&#x9879;&#x76EE;</h3>
<p>&#x9996;&#x5148;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x5904;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x914D;&#x7F6E;&#x5668;&#x76EE;&#x5F55;&#x3002;&#x4E0E;&#x4EFB;&#x4F55;&#x9879;&#x76EE;&#x4E00;&#x6837;&#xFF0C;&#x8BBE;&#x7F6E;&#x5305;&#x542B;src&#x76EE;&#x5F55;&#x548C;Nimble&#x6587;&#x4EF6;&#x7684;&#x9879;&#x76EE;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7075;&#x6D3B;&#x7684;init&#x547D;&#x4EE4;&#x6765;&#x5E2E;&#x52A9;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5728; <code>src</code> &#x76EE;&#x5F55;&#x4E2D;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; <code>configuration.nim</code> &#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5728;&#x60A8;&#x559C;&#x7231;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x6253;&#x5F00;&#x5B83;&#x3002;</p>
<p>&#x5B8F;&#x5C06;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x914D;&#x7F6E;&#x5668;DSL&#xFF0C;&#x56E0;&#x6B64;&#x8BF7;&#x5728;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x914D;&#x7F6E;&#x5668;.nim&#x6587;&#x4EF6;&#x7684;&#x9876;&#x90E8;&#x5BFC;&#x5165;&#x5B8F;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x5F53;&#x4F7F;&#x7528;DSL&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x5148;&#x5199;&#x4E0B;&#x60A8;&#x5E0C;&#x671B;&#x5B83;&#x7684;&#x6837;&#x5B50;&#x3002;&#x5F88;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x914D;&#x7F6E;DSL&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x7F16;&#x8BD1;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros

dumpTree:
  config <span class="hljs-type">MyAppConfig</span>:
    address: <span class="hljs-built_in">string</span>
    port: <span class="hljs-built_in">int</span>
</code></pre>
<p>&#x5982;&#x679C;&#x7F16;&#x8BD1;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x60A8;&#x7684;DSL&#x5728;Nim&#x4E2D;&#x8BED;&#x6CD5;&#x6709;&#x6548;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x3002;
&#x6D4B;&#x8BD5;DSL&#x7684;&#x6709;&#x6548;&#x6027;&#x540E;&#xFF0C;&#x4E3A;&#x8BE5;DSL&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5B8F;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x5404;&#x79CD;&#x53C2;&#x6570;&#x7684;AST&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x6E05;&#x5355;9.6&#x6240;&#x793A;&#x3002;</p>
<p>&#x6E05;&#x5355;9.6.&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x914D;&#x7F6E;&#x5B8F;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros

<span class="hljs-keyword">macro</span> config(typeName: untyped, fields: untyped): untyped =     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-literal">result</span> = newStmtList()      <span class="hljs-comment"># &lt;2&gt;</span>
  echo treeRepr(typeName)     <span class="hljs-comment"># &lt;3&gt;</span>
  echo treeRepr(fields)       <span class="hljs-comment"># &lt;3&gt;</span>

config <span class="hljs-type">MyAppConfig</span>:
  address: <span class="hljs-built_in">string</span>
  port: <span class="hljs-built_in">int</span>
</code></pre>
<blockquote>
<p><1>  <code>config</code> &#x5B8F;&#x63A5;&#x53D7;&#x7C7B;&#x578B;&#x540D;&#x548C;&#x5B57;&#x6BB5;&#x5217;&#x8868;&#x3002;</1></p>
<p><2> &#x6BCF;&#x4E2A;&#x5B8F;&#x90FD;&#x5FC5;&#x987B;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;AST&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;AST&#x3002;</2></p>
<p><3> &#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x663E;&#x793A; <code>typeName</code> &#x548C; <code>fields</code> &#x53C2;&#x6570;&#x7684;AST&#x3002;</3></p>
</blockquote>
<p>&#x5C06;&#x6B64;&#x4EE3;&#x7801;&#x4FDD;&#x5B58;&#x5230;configuration.nim&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x8BE5;&#x6587;&#x4EF6;&#x3002;&#x60A8;&#x5C06;&#x5728;&#x8F93;&#x51FA;&#x4E2D;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;MyAppConfig&quot;</span>
<span class="hljs-type">StmtList</span>
  <span class="hljs-type">Call</span>
    <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;address&quot;</span>
    <span class="hljs-type">StmtList</span>
      <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;string&quot;</span>
  <span class="hljs-type">Call</span>
    <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;port&quot;</span>
    <span class="hljs-type">StmtList</span>
      <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;int&quot;</span>
</code></pre>
<p>&#x8FD9;&#x8BA9;&#x60A8;&#x4E86;&#x89E3;&#x4E86;&#x5C06;&#x8981;&#x4F7F;&#x7528;&#x7684;AST&#x7ED3;&#x6784;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x51B3;&#x5B9A;&#x9700;&#x8981;&#x53D1;&#x51FA;&#x4EC0;&#x4E48;&#x4EE3;&#x7801;&#x6765;&#x5B9E;&#x73B0;&#x6240;&#x9700;&#x7684;&#x4EE3;&#x7801;&#x903B;&#x8F91;&#x7684;&#x65F6;&#x5019;&#x4E86;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x672C;&#x8282;&#x5F00;&#x5934;&#x6240;&#x793A;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5B8F;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4E09;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6784;&#x9020;&#xFF1A;</p>
<ul>
<li><code>MyAppConfig</code> &#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x914D;&#x7F6E;&#x6570;&#x636E;&#x3002;</li>
<li>&#x521D;&#x59CB;&#x5316;&#x65B0; <code>MyAppConfig</code> &#x7C7B;&#x578B;&#x7684; <code>newMyAppConfig</code> &#x6784;&#x9020;&#x51FD;&#x6570;&#x8FC7;&#x7A0B;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x89E3;&#x6790;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x89E3;&#x6790;&#x6587;&#x4EF6;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;&#x586B;&#x5145; <code>MyAppConfig</code> &#x5BF9;&#x8C61;&#x7684;&#x6307;&#x5B9A;&#x5B9E;&#x4F8B;&#x3002;</li>
</ul>
<p>&#x751F;&#x6210;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8FC7;&#x7A0B;&#x7684;&#x540D;&#x79F0;&#x53D6;&#x51B3;&#x4E8E;&#x914D;&#x7F6E;&#x6784;&#x9020;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x540D;&#x79F0;&#x3002;&#x5B8F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x6765;&#x66F4;&#x6539;&#x5B83;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x751F;&#x6210;&#x7684;&#x7C7B;&#x578B;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x5B57;&#x6BB5;&#x4E5F;&#x5C06;&#x53D6;&#x51B3;&#x4E8E;&#x914D;&#x7F6E;&#x6784;&#x9020;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E09;&#x8282;&#x5C06;&#x7740;&#x91CD;&#x4E8E;&#x5728;&#x5B8F;&#x4E2D;&#x5B9E;&#x73B0;&#x529F;&#x80FD;&#xFF0C;&#x4EE5;&#x521B;&#x5EFA;&#x4E09;&#x4E2A;&#x6784;&#x9020;&#xFF0C;&#x5305;&#x62EC;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x3001;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8FC7;&#x7A0B;&#x548C;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x3002;</p>
<h3 id="942&#x751F;&#x6210;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;">9.4.2&#x751F;&#x6210;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;</h3>
<p> &#x5728;&#x5F00;&#x59CB;&#x5728;&#x5B8F;&#x4E2D;&#x7F16;&#x5199;AST&#x751F;&#x6210;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x8981;&#x751F;&#x6210;&#x4EC0;&#x4E48;AST&#x3002;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5E0C;&#x671B;&#x5B8F;&#x53D1;&#x51FA;&#x7684;Nim&#x4EE3;&#x7801;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5148;&#x5199;&#x4E0B;&#x5E94;&#x8BE5;&#x7531; <code>config</code> &#x6784;&#x9020;&#x751F;&#x6210;&#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#xFF0C;&#x60A8;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x8FC7;&#x8FD9;&#x4E2A;&#x6784;&#x9020;&#xFF1A;</p>
<pre><code class="lang-Nim">config <span class="hljs-type">MyAppConfig</span>:
  address: <span class="hljs-built_in">string</span>
  port: <span class="hljs-built_in">int</span>
</code></pre>
<p>&#x9700;&#x8981;&#x4ECE;&#x4E2D;&#x751F;&#x6210;&#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">MyAppConfig</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>
    address: <span class="hljs-built_in">string</span>
    port: <span class="hljs-built_in">int</span>
</code></pre>
<p> <code>config</code> &#x6784;&#x9020;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x4E24;&#x6761;&#x4FE1;&#x606F;&#x5DF2;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x6B64;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#xFF0C;&#x5373;&#x7C7B;&#x578B;&#x540D; <code>MyAppConfig</code> &#x548C;&#x4E24;&#x4E2A;&#x540D;&#x4E3A; <code>address</code> &#x548C; <code>port</code> &#x7684;&#x5B57;&#x6BB5;&#x3002;&#x4E0E;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x4E00;&#x6837;&#xFF0C;&#x6B64;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x4E3A;AST&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x751F;&#x6210;AST&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5B83;&#x7684;AST&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> macros

dumpTree:
  <span class="hljs-keyword">type</span>
    <span class="hljs-type">MyAppConfig</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>
      address: <span class="hljs-built_in">string</span>
      port: <span class="hljs-built_in">int</span>
</code></pre>
<p>&#x7F16;&#x8BD1;&#x6B64;&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x4F1A;&#x663E;&#x793A;&#x6E05;&#x5355;9.7&#x4E2D;&#x7684;AST&#x3002;</p>
<p>&#x6E05;&#x5355;9.7  <code>MyAppConfig</code> &#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7684;AST</p>
<pre><code class="lang-Nim"><span class="hljs-type">StmtList</span>
  <span class="hljs-type">TypeSection</span>
    <span class="hljs-type">TypeDef</span>
      <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;MyAppConfig&quot;</span>
      <span class="hljs-type">Empty</span>         <span class="hljs-comment"># &lt;1&gt;</span>
      <span class="hljs-type">RefTy</span>
        <span class="hljs-type">ObjectTy</span>
          <span class="hljs-type">Empty</span>     <span class="hljs-comment"># &lt;1&gt;</span>
          <span class="hljs-type">Empty</span>     <span class="hljs-comment"># &lt;1&gt;</span>
          <span class="hljs-type">RecList</span>
            <span class="hljs-type">IdentDefs</span>
              <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;address&quot;</span>
              <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;string&quot;</span>
              <span class="hljs-type">Empty</span>     <span class="hljs-comment"># &lt;1&gt;</span>
            <span class="hljs-type">IdentDefs</span>
              <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;port&quot;</span>
              <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;int&quot;</span>
              <span class="hljs-type">Empty</span>     <span class="hljs-comment"># &lt;1&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x7A7A;&#x8282;&#x70B9;&#x7528;&#x4E8E;&#x4E3A;AST&#x4E2D;&#x7684;&#x6CDB;&#x578B;&#x7B49;&#x989D;&#x5916;&#x529F;&#x80FD;&#x9884;&#x7559;&#x7A7A;&#x95F4;&#x3002;</1></p>
</blockquote>
<p>&#x6E05;&#x5355;9.8&#x4E2D;&#x7684;AST&#x5305;&#x542B;&#x5927;&#x91CF;&#x7A7A;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x7528;&#x4E8E;&#x6CDB;&#x578B;&#x7B49;&#x53EF;&#x9009;&#x6784;&#x9020;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x7D22;&#x5F15;&#x4F4D;&#x7F6E;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5BFC;&#x822A;AST&#x662F;&#x4F7F;&#x7528;[]&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x7D22;&#x5F15;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x60A8;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#x770B;&#x5230;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x77E5;&#x9053;&#x9700;&#x8981;&#x751F;&#x6210;&#x7684;AST&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x4E86;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x751F;&#x6210;&#x5B83;&#x7684;&#x4EE3;&#x7801;&#x4E86;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B8F;&#x6A21;&#x5757;&#x5305;&#x542B;&#x7684;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x4F7F;&#x4E3A;&#x7279;&#x5B9A;&#x6784;&#x9020;&#x751F;&#x6210;AST&#x7684;&#x8FC7;&#x7A0B;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x67D0;&#x4E9B;&#x57FA;&#x672C;&#x8FC7;&#x7A0B;&#x624B;&#x52A8;&#x751F;&#x6210;&#x6E05;&#x5355;9.7&#x4E2D;&#x7684;AST&#xFF0C;&#x56E0;&#x4E3A;&#x5B8F;&#x6A21;&#x5757;&#x4E2D;&#x5F53;&#x524D;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x8282;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x6E05;&#x5355;9.8&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x5927;&#x91CF;AST&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5982;&#x6E05;&#x5355;9.7&#x6240;&#x793A;&#x3002;</p>
<p>&#x6E05;&#x5355;9.8.&#x4E3A;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x751F;&#x6210;AST</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> createRefType(ident: <span class="hljs-type">NimIdent</span>, identDefs: <span class="hljs-built_in">seq</span>[<span class="hljs-type">NimNode</span>]): <span class="hljs-type">NimNode</span> =     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-literal">result</span> = newTree(nnkTypeSection,     <span class="hljs-comment"># &lt;2&gt;</span>
    newTree(nnkTypeDef,        <span class="hljs-comment"># &lt;3&gt;</span>
      newIdentNode(ident),     <span class="hljs-comment"># &lt;4&gt;</span>
      newEmptyNode(),          <span class="hljs-comment"># &lt;4&gt;</span>
      newTree(nnkRefTy,
        newTree(nnkObjectTy,
          newEmptyNode(),      <span class="hljs-comment"># &lt;4&gt;</span>
          newEmptyNode(),      <span class="hljs-comment"># &lt;4&gt;</span>
          newTree(nnkRecList,
            identDefs
          )
        )
      )
    )
  )
</code></pre>
<blockquote>
<p><1> &#x6B64;&#x8FC7;&#x7A0B;&#x63A5;&#x53D7;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>NimNode</code> &#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5B83;&#x6307;&#x5B9A;&#x8981;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x540D;&#x79F0;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x5305;&#x542B;&#x6807;&#x8BC6;&#x7B26;&#x5B9A;&#x4E49;&#x5217;&#x8868;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x6709;&#x5173;&#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#x7684;&#x4FE1;&#x606F;</1></p>
<p><2> &#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4F7F;&#x7528; <code>newTree</code> &#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x5141;&#x8BB8;&#x5728;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x4E2D;&#x8F7B;&#x677E;&#x6DFB;&#x52A0;&#x5B50;&#x8282;&#x70B9;&#x3002;</2></p>
<p><3> &#x6BCF;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x90FD;&#x4F5C;&#x4E3A;&#x5916;&#x90E8; <code>newTree</code> &#x8C03;&#x7528;&#x7684;&#x53C2;&#x6570;&#x3002;</3></p>
<p><4> &#x6709;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x521B;&#x5EFA;&#x8282;&#x70B9;&#x7684;&#x8FC7;&#x7A0B;&#x66F4;&#x5BB9;&#x6613;&#x3002;</4></p>
</blockquote>
<p>&#x6E05;&#x5355;9.8&#x6240;&#x793A;&#x7684;&#x4EE3;&#x7801;&#x9010;&#x4E2A;&#x624B;&#x52A8;&#x521B;&#x5EFA;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x4F7F;&#x7528; <code>newTree</code> &#x8FC7;&#x7A0B;&#x3002;&#x5B83;&#x5C06;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#x4E0E;&#x96F6;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#x4E00;&#x8D77;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x8FD9;&#x4E9B;&#x5B50;&#x8282;&#x70B9;&#x4F1A;&#x81EA;&#x52A8;&#x6DFB;&#x52A0;&#x5230; <code>newTree</code> &#x8FD4;&#x56DE;&#x7684;&#x65B0;Nim AST&#x8282;&#x70B9;&#x4E2D;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#x90FD;&#x4EE5; <code>nnk</code> &#x524D;&#x7F00;&#x5F00;&#x5934;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x8FC7;&#x7A0B;&#x7684;&#x4E3B;&#x4F53;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E00;&#x884C;&#x663E;&#x793A;&#x4E86; <code>nnkTypeSection</code> &#x8282;&#x70B9;&#x7684;&#x521B;&#x5EFA;&#x3002;&#x8FD9;&#x4E0E;&#x6E05;&#x5355;9.7&#x6240;&#x793A;&#x7684; <code>dumpTree</code> &#x7684;&#x8F93;&#x51FA;&#x76F8;&#x5339;&#x914D;&#xFF0C;&#x53EA;&#x662F;&#x8F93;&#x51FA;&#x4E0D;&#x5305;&#x542B;nnk&#x524D;&#x7F00;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#x6E05;&#x5355;9.7&#x4E2D;&#x663E;&#x793A;&#x7684; <code>dumpTree</code> &#x8F93;&#x51FA;&#x548C;&#x6E05;&#x5355;9.8&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x60CA;&#x4EBA;&#x7684;&#x76F8;&#x4F3C;&#x6027;&#x3002;&#x8282;&#x70B9;&#x7684;&#x5D4C;&#x5957;&#x65B9;&#x5F0F;&#x751A;&#x81F3;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x6D89;&#x53CA; <code>newTree</code> &#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x4E13;&#x95E8;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x4E13;&#x4E1A;&#x7A0B;&#x5E8F;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x3002;</p>
<p> <code>newIdentNode</code> &#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x521B;&#x5EFA; <code>nnkIdent</code> &#x8282;&#x70B9;&#x3002;&#x5B83;&#x63A5;&#x53D7;&#x5B57;&#x7B26;&#x4E32;&#x6216; <code>NimIdent</code> &#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x4ECE;&#x4E2D;&#x521B;&#x5EFA;&#x9002;&#x5F53;&#x7684; <code>nnkIden</code> &#x8282;&#x70B9;&#x3002;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; <code>newTree</code> &#x521B;&#x5EFA;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x66F4;&#x8BE6;&#x7EC6;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD8;&#x9700;&#x8981;&#x5206;&#x914D;&#x6807;&#x8BC6;&#x3002; <code>ident</code> &#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x4EFB;&#x4F55;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x4F8B;&#x5982;&#x53D8;&#x91CF;&#x6216;&#x8FC7;&#x7A0B;&#x540D;&#x79F0;&#xFF0C;&#x4F46;&#x5F88;&#x50CF;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x5C1A;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3002;</p>
<p> <code>n</code>  <code>ewEmptyNode</code> &#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>nnkEmpty</code> &#x8282;&#x70B9;&#x3002;&#x5B83;&#x53EA;&#x662F; <code>newTree(nnkEmpty)</code> &#x7684;&#x522B;&#x540D;&#x3002;</p>
<p> <code>createRefType</code> &#x8FC7;&#x7A0B;&#x4E0D;&#x4F1A;&#x751F;&#x6210;&#x6E05;&#x5355;9.7&#x6240;&#x793A;&#x7684;&#x5B8C;&#x6574;AST&#x3002;&#x5B83;&#x9519;&#x8FC7;&#x4E86;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8EAB;&#x4EFD;&#x8BC6;&#x522B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x5047;&#x8BBE;&#x5B83;&#x4EEC;&#x662F;&#x5728;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x751F;&#x6210;&#x7684;&#x3002;&#x5355;&#x4E2A; <code>nnkIdentDefs</code> &#x8282;&#x70B9;&#x8868;&#x793A;&#x5B57;&#x6BB5;&#x5B9A;&#x4E49;&#xFF0C;&#x5305;&#x62EC;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#x3002;&#x4E3A;&#x4E86;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6E05;&#x5355;9.9&#x663E;&#x793A;&#x4E86; <code>toIdentDefs</code> &#x8FC7;&#x7A0B;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x5C06;&#x8C03;&#x7528;&#x8BED;&#x53E5;&#x5217;&#x8868;&#x8F6C;&#x6362;&#x4E3A; <code>nnkIdentDef</code> &#x8282;&#x70B9;&#x5217;&#x8868;&#x3002;</p>
<p>&#x6E05;&#x5355;9.9.&#x5C06;&#x8C03;&#x7528;&#x8BED;&#x53E5;&#x5217;&#x8868;&#x8F6C;&#x6362;&#x4E3A; <code>IdentDefs</code> &#x8282;&#x70B9;&#x5217;&#x8868;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> toIdentDefs(stmtList: <span class="hljs-type">NimNode</span>): <span class="hljs-built_in">seq</span>[<span class="hljs-type">NimNode</span>] =
  expectKind(stmtList, nnkStmtList)     <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-literal">result</span> = @[]          <span class="hljs-comment"># &lt;2&gt;</span>

  <span class="hljs-keyword">for</span> child <span class="hljs-keyword">in</span> stmtList:                <span class="hljs-comment"># &lt;3&gt;</span>
    expectKind(child, nnkCall)          <span class="hljs-comment"># &lt;4&gt;</span>
    <span class="hljs-literal">result</span>.add(         <span class="hljs-comment"># &lt;4&gt;</span>
      newIdentDefs(     <span class="hljs-comment"># &lt;6&gt;</span>
        child[<span class="hljs-number">0</span>],       <span class="hljs-comment"># &lt;7&gt;</span>
        child[<span class="hljs-number">1</span>][<span class="hljs-number">0</span>]     <span class="hljs-comment"># &lt;8&gt;</span>
      )
 )
</code></pre>
<blockquote>
<p><1> &#x786E;&#x4FDD; <code>stmtList</code> &#x8282;&#x70B9;&#x7684;&#x7C7B;&#x578B;&#x4E3A; <code>nnkStmtList</code> &#x3002;</1></p>
<p><2>&#x7528;&#x7A7A;&#x5E8F;&#x5217;&#x521D;&#x59CB;&#x5316;&#x7ED3;&#x679C;&#x53D8;&#x91CF;&#x3002;</2></p>
<p><3>&#x904D;&#x5386; <code>stmtList</code> &#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B50;&#x8282;&#x70B9;&#x3002;</3></p>
<p><4>&#x786E;&#x4FDD;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x7C7B;&#x578B;&#x4E3A; <code>nnkCall</code> &#x3002;</4></p>
<p><5>&#x5C06; <code>nnkIdentDefs</code> &#x8282;&#x70B9;&#x6DFB;&#x52A0;&#x5230;&#x7ED3;&#x679C;&#x5E8F;&#x5217;&#x4E2D;&#x3002;</5></p>
<p><6>&#x521B;&#x5EFA;&#x65B0;&#x7684; <code>nnkIdentDefs</code> &#x8282;&#x70B9;&#x3002;</6></p>
<p><7>&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x3002;&#x4F8B;&#x5982;&#xFF0C; <code>child</code> &#x7684;&#x7B2C;&#x4E00;&#x4E2A;child Call&#x2192; Indent&#xFF01; <code>address</code> &#x3002;</7></p>
<p><8>&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x3002;child&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;child&#x7684;child&#xFF0C;&#x4F8B;&#x5982;Call&#x2192; StmtList(StmtList)&#x2192; Indent  &quot;string&quot;&#x3002;</8></p>
</blockquote>
<p>&#x5C06;&#x4F20;&#x9012;&#x7ED9;t <code>oIdentDefs</code> &#x8FC7;&#x7A0B;&#x7684; <code>stmtList</code> &#x53C2;&#x6570;&#x662F; <code>config</code> &#x5B8F;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C; <code>stmtList</code> &#x7684;AST&#x5C06;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-type">StmtList</span>
  <span class="hljs-type">Call</span>
    <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;address&quot;</span>
    <span class="hljs-type">StmtList</span>
      <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;string&quot;</span>
  <span class="hljs-type">Call</span>
    <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;port&quot;</span>
    <span class="hljs-type">StmtList</span>
      <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;int&quot;</span>
</code></pre>
<p> <code>toIdentDefs</code> &#x8FC7;&#x7A0B;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x83B7;&#x53D6;&#x6B64;AST&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x4E0E;&#x4E4B;&#x5339;&#x914D;&#x7684; <code>nnkIdentDef</code> &#x8282;&#x70B9;&#x5217;&#x8868;</p>
<p>&#x89C1;&#x6E05;&#x5355;9.7&#x3002;&#x4EE3;&#x7801;&#x76F8;&#x5F53;&#x77ED;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x7F29;&#x77ED;&#xFF0C;&#x4EE3;&#x4EF7;&#x662F;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#x68C0;&#x67E5;&#x3002;</p>
<p> <code>expectKind</code> &#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x786E;&#x4FDD;&#x8F93;&#x5165;AST&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x610F;&#x5916;&#x7684;&#x8282;&#x70B9;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x7F16;&#x5199;&#x5B8F;&#x65F6;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x5B8F;&#x53EF;&#x80FD;&#x4F1A;&#x5F97;&#x5230;&#x5F02;&#x5E38;&#x7684;AST&#xFF0C;&#x6DFB;&#x52A0;&#x8FD9;&#x6837;&#x7684;&#x68C0;&#x67E5;&#x4F7F;&#x8C03;&#x8BD5;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F7F;&#x7528; <code>doAssert</code> &#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#xFF1A;</p>
<ul>
<li>&#x8BED;&#x53E5;&#x5217;&#x8868;&#x8282;&#x70B9;&#x7684;&#x5B50;&#x7EA7;&#x88AB;&#x8FED;&#x4EE3;&#x3002;</li>
<li>&#x4F7F;&#x7528;[]&#x8FD0;&#x7B97;&#x7B26;&#x8BBF;&#x95EE;&#x6BCF;&#x4E2A;&#x5B69;&#x5B50;&#x7684;&#x5B69;&#x5B50;&#x548C;&#x5B59;&#x5B50;&#xFF0C;&#x4EE5;&#x68C0;&#x7D22;&#x4E0E;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x4E24;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x3002;</li>
<li>newIdentDefs&#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x65B0;&#x7684;nnkIdentDef&#x8282;&#x70B9;&#x3002;</li>
<li>&#x65B0;&#x7684;nnkIdentDefs&#x8282;&#x70B9;&#x5C06;&#x6DFB;&#x52A0;&#x5230;&#x7ED3;&#x679C;&#x5E8F;&#x5217;&#x4E2D;&#x3002;</li>
</ul>
<p>&#x663E;&#x7136;&#xFF0C;&#x8F6C;&#x6362;&#x53D6;&#x51B3;&#x4E8E;AST&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x7D22;&#x5F15;&#x3002;&#x8C22;&#x5929;&#x8C22;&#x5730;&#xFF0C;&#x7ED3;&#x6784;&#x4E0D;&#x5E94;&#x8BE5;&#x6539;&#x53D8;&#xFF0C;&#x9664;&#x975E;&#x914D;&#x7F6E;&#x5668;&#x5E93;&#x7684;&#x7528;&#x6237;&#x5728;&#x914D;&#x7F6E;&#x5B8F;&#x7684;&#x4E3B;&#x4F53;&#x4E2D;&#x4F20;&#x9012;&#x4E86;&#x4E00;&#x4E9B;&#x610F;&#x5916;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5728;&#x672C;&#x8282;&#x7A0D;&#x540E;&#x90E8;&#x5206;&#xFF0C;&#x60A8;&#x5C06;&#x770B;&#x5230;&#x6B64;&#x4EE3;&#x7801;&#x5982;&#x4F55;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x505A;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x6545;&#x969C;&#x66F4;&#x5177;&#x4FE1;&#x606F;&#x6027;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x60A8;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x914D;&#x7F6E;&#x5B8F;&#x4E2D;&#x751F;&#x6210;&#x6B63;&#x786E;&#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x3002;&#x60A8;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x6DFB;&#x52A0;&#x5BF9; <code>createRefType</code> &#x548C; <code>IdentDefs</code> &#x7684;&#x8C03;&#x7528;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">let</span> identDefs = toIdentDefs(fields)
<span class="hljs-literal">result</span>.add createRefType(typeName.ident, identDefs)
</code></pre>
<p>&#x5728;&#x5B8F;&#x4E2D;&#x5B9A;&#x4E49;&#x7ED3;&#x679C;&#x53D8;&#x91CF;&#x540E;&#x6DFB;&#x52A0;&#x8FD9;&#x4E24;&#x884C;&#x3002;&#x7136;&#x540E;&#x5728;&#x5B8F;&#x7684;&#x672B;&#x5C3E;&#x6DFB;&#x52A0; <code>echo treeRepr(result)</code> &#x4EE5;&#x663E;&#x793A;&#x751F;&#x6210;&#x7684;AST&#x3002;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#xFF0C;AST&#x5E94;&#x8BE5;&#x4E0E;&#x6E05;&#x5355;9.7&#x6240;&#x793A;&#x7684;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x786E;&#x8BA4;&#x751F;&#x6210;&#x7684;AST&#x6B63;&#x786E;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x4EE3;&#x7801;&#x5E76;&#x663E;&#x793A;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#x5199;&#x5165; <code>echo repr(result)</code> &#x6765;&#x5B8C;&#x6210;&#x6B64;&#x64CD;&#x4F5C;&#x3002;&#x7F16;&#x8BD1;&#x540E;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">type</span>
  <span class="hljs-type">MyAppConfig</span> = <span class="hljs-keyword">ref</span> <span class="hljs-keyword">object</span>
    address: <span class="hljs-built_in">string</span>
    port: <span class="hljs-built_in">int</span>
</code></pre>
<p>&#x8FD9;&#x662F;&#x8FD9;&#x4E2A;&#x5B8F;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E5F;&#x662F;&#x6700;&#x957F;&#x7684;&#x90E8;&#x5206;&#xFF01;&#x5269;&#x4E0B;&#x7684;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x82B1;&#x90A3;&#x4E48;&#x957F;&#x65F6;&#x95F4;&#x3002;</p>
<h3 id="943-&#x751F;&#x6210;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7A0B;&#x5E8F;">9.4.3 &#x751F;&#x6210;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7A0B;&#x5E8F;</h3>
<p>&#x914D;&#x7F6E;&#x5B8F;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x5355;&#x4E2A;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x3002;&#x4F46;&#x6B64;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x9700;&#x8981;&#x6784;&#x9020;&#x51FD;&#x6570;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x3002;&#x672C;&#x8282;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x6784;&#x9020;&#x51FD;&#x6570;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x5B83;&#x53EA;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9700;&#x8981;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x5F88;&#x7B80;&#x5355;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> newMyAppConfig(): <span class="hljs-type">MyAppConfig</span> =
  new <span class="hljs-literal">result</span>     <span class="hljs-comment"># &lt;1&gt;</span>
</code></pre>
<blockquote>
<p><1>&#x65B0;&#x8C03;&#x7528;&#x7528;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x3002;</1></p>
</blockquote>
<p>&#x8BE5;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0E;&#x4E0A;&#x4E00;&#x8282;&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x751F;&#x6210;&#xFF0C;&#x4F46;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x6709;&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6A21;&#x677F;&#x6765;&#x4EE3;&#x66FF;&#x624B;&#x52A8;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x53CA;&#x5176;&#x4E3B;&#x4F53;&#x7684;AST&#x3002;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x5217;&#x8868;&#x663E;&#x793A;&#x4E86;&#x6240;&#x9700;&#x7684;&#x6A21;&#x677F;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">template</span> constructor(ident: untyped): untyped =
  <span class="hljs-keyword">proc</span> `new ident`(): `ident` =
    new <span class="hljs-literal">result</span>
</code></pre>
<p>&#x5C06;&#x6B64;&#x6A21;&#x677F;&#x6DFB;&#x52A0;&#x5230; <code>configuration.nim</code> &#x6587;&#x4EF6;&#x4E2D;&#x914D;&#x7F6E;&#x5B8F;&#x7684;&#x6B63;&#x4E0A;&#x65B9;&#x3002;</p>
<p>&#x6B64;&#x6A21;&#x677F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C06;&#x5176;&#x547D;&#x540D;&#x4E3A; <code>newIdent</code> &#xFF0C;&#x5176;&#x4E2D; <code>Ident</code> &#x662F;&#x4F20;&#x9012;&#x7ED9;&#x6A21;&#x677F;&#x7684; <code>Ident</code> &#x53C2;&#x6570;&#x3002; <code>ident</code> &#x53C2;&#x6570;&#x8FD8;&#x7528;&#x4E8E;&#x6240;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x3002;&#x5982;&#x679C;&#x8981;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FD;&#x6570;( <code>MyAppConfig</code> )&#x8C03;&#x7528;&#x6B64;&#x6A21;&#x677F;&#xFF0C;&#x5219;&#x5B9E;&#x9645;&#x4E0A;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4EE5;&#x4E0B;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> newMyAppConfig(): <span class="hljs-type">MyAppConfig</span> =
  new <span class="hljs-literal">result</span>
</code></pre>
<p>&#x4F46;&#x5982;&#x4F55;&#x5728;&#x914D;&#x7F6E;&#x5B8F;&#x4E2D;&#x4F7F;&#x7528;&#x6B64;&#x6A21;&#x677F;&#xFF1F;&#x7B54;&#x6848;&#x5728;&#x4E8E;&#x5B8F;&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>getAst</code> &#x8FC7;&#x7A0B;&#x3002;&#x6B64;&#x8FC7;&#x7A0B;&#x5C06;&#x6A21;&#x677F;&#x6216;&#x5B8F;&#x8FD4;&#x56DE;&#x7684;&#x4EE3;&#x7801;&#x8F6C;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;AST&#x8282;&#x70B9;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x7531;&#x4E8E; <code>getAst</code> &#x548C;&#x6A21;&#x677F;&#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728; <code>createRefType</code> &#x8C03;&#x7528;&#x540E;&#x7ACB;&#x5373;&#x6DFB;&#x52A0; <code>result.add getAst(constructor(typeName.ident))</code> &#x3002;&#x60A8;&#x7684;&#x914D;&#x7F6E;&#x5B8F;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">macro</span> config*(typeName: untyped, fields: untyped): untyped =
  <span class="hljs-literal">result</span> = newStmtList()

  <span class="hljs-keyword">let</span> identDefs = toIdentDefs(fields)
  <span class="hljs-literal">result</span>.add createRefType(typeName.ident, identDefs)
  <span class="hljs-literal">result</span>.add getAst(constructor(typeName.ident))

  echo treeRepr(typeName)
  echo treeRepr(fields)

  echo treeRepr(<span class="hljs-literal">result</span>)
  echo repr(<span class="hljs-literal">result</span>)
</code></pre>
<p>&#x73B0;&#x5728;&#x60A8;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x518D;&#x6B21;&#x7F16;&#x8BD1;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x770B;&#x5230;&#x6784;&#x9020;&#x51FD;&#x6570;&#x8FC7;&#x7A0B;&#x5DF2;&#x7ECF;&#x751F;&#x6210;&#x3002;</p>
<h3 id="944-&#x52A0;&#x8F7D;&#x7A0B;&#x5E8F;">9.4.4 &#x52A0;&#x8F7D;&#x7A0B;&#x5E8F;</h3>
<p>&#x6700;&#x540E;&#x4F46;&#x540C;&#x6837;&#x91CD;&#x8981;&#x7684;&#x662F;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x3002;&#x5B83;&#x5C06;&#x4E3A;&#x6211;&#x4EEC;&#x52A0;&#x8F7D;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x89E3;&#x6790;&#x5B83;&#xFF0C;&#x6700;&#x540E;&#x7528;&#x5176;&#x5185;&#x5BB9;&#x586B;&#x5145;&#x914D;&#x7F6E;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x3002;&#x5BF9;&#x4E8E;&#x524D;&#x9762;&#x51E0;&#x8282;&#x4E2D;&#x663E;&#x793A;&#x7684;&#x5305;&#x542B;&#x5730;&#x5740;&#x5B57;&#x7B26;&#x4E32;&#x5B57;&#x6BB5;&#x548C;&#x7AEF;&#x53E3;&#x6574;&#x6570;&#x5B57;&#x6BB5;&#x7684;&#x914D;&#x7F6E;&#x5B9A;&#x4E49;&#xFF0C;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x5E94;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> load*(cfg: <span class="hljs-type">MyAppConfig</span>, filename: <span class="hljs-built_in">string</span>) =
  <span class="hljs-keyword">var</span> obj = parseFile(filename)           <span class="hljs-comment"># &lt;1&gt;</span>
  cfg.address = obj[<span class="hljs-string">&quot;address&quot;</span>].getStr     <span class="hljs-comment"># &lt;2&gt;</span>
  cfg.port = obj[<span class="hljs-string">&quot;port&quot;</span>].getInt           <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x4ECE;&#x6587;&#x4EF6;&#x540D;&#x52A0;&#x8F7D;JSON&#x6587;&#x4EF6;&#x5E76;&#x5C06;&#x5176;&#x4FDD;&#x5B58;&#x5230;obj&#x53D8;&#x91CF;&#x4E2D;&#x3002;</1></p>
<p><2> &#x4ECE;&#x89E3;&#x6790;&#x7684;JSON&#x5BF9;&#x8C61;&#x4E2D;&#x83B7;&#x53D6;&#x5730;&#x5740;&#x5B57;&#x6BB5;&#xFF0C;&#x68C0;&#x7D22;&#x5176;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x914D;&#x7ED9;&#x914D;&#x7F6E;&#x5B9E;&#x4F8B;&#x7684;&#x5730;&#x5740;&#x5B57;&#x6BB5;&#x3002;</2></p>
<p><3> &#x4ECE;&#x89E3;&#x6790;&#x7684;JSON&#x5BF9;&#x8C61;&#x4E2D;&#x83B7;&#x53D6;&#x7AEF;&#x53E3;&#x5B57;&#x6BB5;&#xFF0C;&#x68C0;&#x7D22;&#x5176;&#x6574;&#x6570;&#x503C;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x914D;&#x7ED9;&#x914D;&#x7F6E;&#x5B9E;&#x4F8B;&#x7684;&#x7AEF;&#x53E3;&#x5B57;&#x6BB5;&#x3002;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#xFF0C;</3></p>
</blockquote>
<p>&#x56E0;&#x4E3A; <code>getNum</code> &#x8FC7;&#x7A0B;&#x8FD4;&#x56DE; <code>BiggestInt</code> &#x7C7B;&#x578B;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x672C;&#x793A;&#x4F8B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5E95;&#x5C42;&#x914D;&#x7F6E;&#x683C;&#x5F0F;&#x662F;JSON&#x3002;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x9996;&#x5148;&#x89E3;&#x6790;JSON&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x8BBF;&#x95EE;&#x89E3;&#x6790;&#x7684;JSON&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x5B57;&#x6BB5;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x914D;&#x7ED9;&#x914D;&#x7F6E;&#x5B9E;&#x4F8B;&#x3002;</p>
<p>&#x6CE8;&#x610F; <code>getStr</code> &#x548C; <code>getNum</code> &#x7684;&#x4E0D;&#x540C;&#x7528;&#x6CD5;&#x3002;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#x7528;&#x4E8E;&#x5206;&#x522B;&#x4ECE;JsonNode&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x4E2D;&#x68C0;&#x7D22;&#x57FA;&#x7840;&#x5B57;&#x7B26;&#x4E32;&#x548C; <code>BiggestInt</code> &#x503C;&#x3002;</p>
<p>&#x5730;&#x5740;&#x5B57;&#x6BB5;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x56E0;&#x6B64;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528; <code>getStr</code> &#x83B7;&#x53D6;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x4E0E;&#x7AEF;&#x53E3;&#x5B57;&#x6BB5;&#x7C7B;&#x4F3C;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#x8BE5;&#x5B57;&#x6BB5;&#x662F;&#x6574;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528; <code>getNum</code> &#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x5728;&#x751F;&#x6210;&#x8FC7;&#x7A0B;&#x65F6;&#x7531;&#x5B8F;&#x786E;&#x5B9A;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x8BED;&#x53E5;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x6709;&#x5173;&#x914D;&#x7F6E;&#x5B57;&#x6BB5;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x5B83;&#x4EEC;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x4EE5; <code>IdentDefs</code> &#x7684;&#x5F62;&#x5F0F;&#x5904;&#x7406;&#x4E86;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91CD;&#x7528;&#x4EE5;&#x524D;&#x751F;&#x6210;&#x7684; <code>IdentDef</code> &#x6765;&#x751F;&#x6210;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x770B;&#x770B; <code>MyAppConfig</code> &#x5B9A;&#x4E49;&#x4E2D;&#x8FD9;&#x4E9B; <code>IdentDef</code> &#x7684;&#x6837;&#x5B50;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-type">IdentDefs</span>
  <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;address&quot;</span>
  <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;string&quot;</span>
  <span class="hljs-type">Empty</span>
<span class="hljs-type">IdentDefs</span>
  <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;port&quot;</span>
  <span class="hljs-type">Ident</span>  <span class="hljs-string">&quot;int&quot;</span>
  <span class="hljs-type">Empty</span>
</code></pre>
<p>&#x7ED3;&#x6784;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x6709;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x5305;&#x542B;&#x5B57;&#x6BB5;&#x540D;&#x548C;&#x7C7B;&#x578B;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6765;&#x751F;&#x6210;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#xFF0C;&#x6211;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5728;&#x6B65;&#x9AA4;&#x4E2D;&#x7F16;&#x5199;&#x5B83;&#x3002;
&#x9996;&#x5148;&#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>createLoadProc</code> &#x8FC7;&#x7A0B;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">proc</span> createLoadProc(typeName: <span class="hljs-type">NimIdent</span>, identDefs: <span class="hljs-built_in">seq</span>[<span class="hljs-type">NimNode</span>]): <span class="hljs-type">NimNode</span> =
</code></pre>
<p>&#x5C06;&#x6B64;&#x5B9A;&#x4E49;&#x6DFB;&#x52A0;&#x5230; <code>configuration.nim</code> &#x6587;&#x4EF6;&#x4E2D;&#x914D;&#x7F6E;&#x5B8F;&#x7684;&#x6B63;&#x4E0A;&#x65B9;&#x3002;
&#x5C31;&#x50CF;&#x524D;&#x9762;&#x5B9A;&#x4E49;&#x7684;c <code>reateRefType</code> &#x8FC7;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x7C7B;&#x578B;&#x540D;&#x79F0;&#x548C; <code>IdentDefs</code> &#x8282;&#x70B9;&#x5217;&#x8868;&#x3002;&#x8BE5;&#x7A0B;&#x5E8F;&#x5C06;&#x4F7F;&#x7528;&#x534A;&#x81EA;&#x52A8;&#x65B9;&#x6CD5;&#x751F;&#x6210;&#x5FC5;&#x8981;&#x7684;AST&#x3002;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x4E00;&#x4E2A; <code>cfg</code> &#x548C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; <code>Ident</code> &#x8282;&#x70B9;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x5E94;&#x4E3A;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x7684; <code>obj</code> &#x53D8;&#x91CF;&#x521B;&#x5EFA; <code>Ident</code> &#x8282;&#x70B9;&#xFF1A;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">var</span> cfgIdent = newIdentNode(<span class="hljs-string">&quot;cfg&quot;</span>)     <span class="hljs-comment"># &lt;1&gt;</span>
<span class="hljs-keyword">var</span> filenameIdent = newIdentNode(<span class="hljs-string">&quot;filename&quot;</span>)     <span class="hljs-comment"># &lt;2&gt;</span>
<span class="hljs-keyword">var</span> objIdent = newIdentNode(<span class="hljs-string">&quot;obj&quot;</span>)     <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x5C06;&#x5B58;&#x50A8;&#x914D;&#x7F6E;&#x5BF9;&#x8C61;&#x5B9E;&#x4F8B;&#x7684;cfg&#x53C2;&#x6570;&#x3002;</1></p>
<p><2> &#x5C06;&#x5B58;&#x50A8;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x53C2;&#x6570;&#x3002;</2></p>
<p><3> &#x5C06;&#x5B58;&#x50A8;&#x89E3;&#x6790;&#x7684;JSON&#x5BF9;&#x8C61;&#x7684;obj&#x53D8;&#x91CF;&#x3002;</3></p>
</blockquote>
<p>&#x5C06;&#x6B64;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x5230; <code>createLoadProc</code> &#x8FC7;&#x7A0B;&#x7684;&#x4E3B;&#x4F53;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x5B83;&#x521B;&#x5EFA;&#x4E86;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x8282;&#x70B9;&#xFF0C;&#x5B58;&#x50A8;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x548C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x751F;&#x6210;&#x52A0;&#x8F7D;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">var</span> body = newStmtList()     <span class="hljs-comment"># &lt;1&gt;</span>
body.add quote <span class="hljs-keyword">do</span>:           <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-keyword">var</span> `objIdent`= parseFile(`filenameIdent`)     <span class="hljs-comment"># &lt;3&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x5B9A;&#x4E49;&#x5B58;&#x50A8;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x4E3B;&#x4F53;&#x7684;&#x53D8;&#x91CF;&#x3002;</1></p>
<p><2>  <code>quote</code> &#x8FC7;&#x7A0B;&#x8FD4;&#x56DE;&#x8868;&#x8FBE;&#x5F0F;&#x7684;AST&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5728;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x5F15;&#x7528;&#x8282;&#x70B9;&#x3002;</2></p>
<p><3> &#x751F;&#x6210;AST&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F; <code>varobj=parseFile(fileName)</code> &#x3002;</3></p>
</blockquote>
<p>&#x5C06;&#x6B64;&#x4EE3;&#x7801;&#x9644;&#x52A0;&#x5230; <code>createLoadProc</code> &#x4E3B;&#x4F53;&#x7684;&#x672B;&#x5C3E;&#x3002;</p>
<p>&#x8BE5;&#x4EE3;&#x7801;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>StmtList</code> &#x8282;&#x70B9;&#xFF0C;&#x4EE5;&#x4FDD;&#x5B58;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x3002;</p>
<p>&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684; <code>StmtList</code> &#x8282;&#x70B9;&#x6765;&#x4FDD;&#x5B58;&#x52A0;&#x8F7D;&#x8FC7;&#x7A0B;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x3002;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5B8F;&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x5F15;&#x7528;&#x8FC7;&#x7A0B;&#x751F;&#x6210;&#x7B2C;&#x4E00;&#x6761;&#x8BED;&#x53E5;&#x3002; <code>quote</code> &#x8FC7;&#x7A0B;&#x4EE5;&#x4E0E; <code>getAst</code> &#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; <code>NimNode</code> &#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x58F0;&#x660E;&#x5355;&#x72EC;&#x7684;&#x6A21;&#x677F;&#xFF0C;&#x800C;&#x662F;&#x5141;&#x8BB8;&#x60A8;&#x5C06;&#x8BED;&#x53E5;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x53CD;&#x5F15;&#x53F7;&#x5C06;&#x5176;&#x5F15;&#x7528;&#x6765;&#x66FF;&#x6362;&#x5F15;&#x53F7;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C; <code>objIdent</code> &#x8282;&#x70B9;&#x6301;&#x6709;&#x7684;&#x540D;&#x79F0;&#x88AB;&#x66FF;&#x6362;&#x5230; <code>var</code> &#x5B9A;&#x4E49;&#x4E2D;&#x3002;f <code>ilenameIdent</code> &#x8282;&#x70B9;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x7C7B;&#x4F3C;&#x7684;&#x66FF;&#x6362;&#x3002;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x751F;&#x6210; <code>var obj=parseFile(fileName)</code> &#x3002;</p>
<p>&#x4E0B;&#x4E00;&#x6B65;&#x662F;&#x904D;&#x5386; <code>IdentDefs</code> &#x5E76;&#x57FA;&#x4E8E;&#x5B83;&#x4EEC;&#x751F;&#x6210;&#x6B63;&#x786E;&#x7684;&#x5B57;&#x6BB5;&#x8D4B;&#x503C;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">for</span> identDef <span class="hljs-keyword">in</span> identDefs:                  <span class="hljs-comment"># &lt;1&gt;</span>
  <span class="hljs-keyword">let</span> fieldNameIdent = identDef[<span class="hljs-number">0</span>]          <span class="hljs-comment"># &lt;2&gt;</span>
  <span class="hljs-keyword">let</span> fieldName = $fieldNameIdent.ident     <span class="hljs-comment"># &lt;3&gt;</span>
  <span class="hljs-keyword">case</span> $identDef[<span class="hljs-number">1</span>].ident                   <span class="hljs-comment"># &lt;4&gt;</span>
  <span class="hljs-keyword">of</span> <span class="hljs-string">&quot;string&quot;</span>:
    body.add quote <span class="hljs-keyword">do</span>:
      `cfgIdent`.`fieldNameIdent` = `objIdent`[`fieldName`].getStr           <span class="hljs-comment"># &lt;4&gt;</span>
  <span class="hljs-keyword">of</span> <span class="hljs-string">&quot;int&quot;</span>:
    body.add quote <span class="hljs-keyword">do</span>:
      `cfgIdent`.`fieldNameIdent` = `objIdent`[`fieldName`].getInt     <span class="hljs-comment"># &lt;6&gt;</span>
  <span class="hljs-keyword">else</span>:
    doAssert(<span class="hljs-literal">false</span>, <span class="hljs-string">&quot;Not Implemented&quot;</span>)
</code></pre>
<blockquote>
<p><1>&#x904D;&#x5386; <code>IdentDefs</code> &#x8282;&#x70B9;&#x3002;</1></p>
<p><2>&#x4ECE; <code>IdentDefs</code> &#x8282;&#x70B9;&#x68C0;&#x7D22;&#x5B57;&#x6BB5;&#x540D;&#x3002;</2></p>
<p><3>&#x5C06; <code>Ident</code> &#x8F6C;&#x6362;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x3002;</3></p>
<p><4>&#x6839;&#x636E;&#x5B57;&#x6BB5;&#x7684;&#x7C7B;&#x578B;&#x751F;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x3002;</4></p>
<p><5>&#x5BF9;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x5B57;&#x6BB5;&#xFF0C;&#x751F;&#x6210; <code>getStr</code> &#x8C03;&#x7528;&#x3002;</5></p>
<p><6>&#x5BF9;&#x4E8E; <code>int</code> &#x5B57;&#x6BB5;&#xFF0C;&#x751F;&#x6210; <code>getNum</code> &#x8C03;&#x7528;&#x548C;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x3002;</6></p>
</blockquote>
<p>&#x5C06;&#x6B64;&#x4EE3;&#x7801;&#x9644;&#x52A0;&#x5230; <code>createLoadProc</code> &#x4E3B;&#x4F53;&#x7684;&#x672B;&#x5C3E;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x3002;&#x4F46;&#x5B83;&#x4F1A;&#x751F;&#x6210;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BED;&#x53E5;&#x4F9D;&#x8D56;&#x4E8E;&#x914D;&#x7F6E;&#x6B63;&#x6587;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x5BF9;&#x4E8E;&#x524D;&#x9762;&#x51E0;&#x8282;&#x4E2D;&#x663E;&#x793A;&#x7684;&#x914D;&#x7F6E;&#x5B9A;&#x4E49;&#xFF0C;&#x5B83;&#x5C06;&#x751F;&#x6210;&#x4EE5;&#x4E0B;&#x4E24;&#x6761;&#x8BED;&#x53E5;&#xFF1A;</p>
<pre><code class="lang-Nim">cfg.address = obj[<span class="hljs-string">&quot;address&quot;</span>].getStr
cfg.port = obj[<span class="hljs-string">&quot;port&quot;</span>].getInt`
</code></pre>
<p>&#x4F7F;&#x7528;&#x8BE5;&#x4EE3;&#x7801;&#xFF0C;&#x8FC7;&#x7A0B;&#x4F53;&#x73B0;&#x5728;&#x5DF2;&#x5B8C;&#x5168;&#x751F;&#x6210;&#x3002;&#x73B0;&#x5728;&#x5269;&#x4E0B;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;AST&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B8F;&#x6A21;&#x5757;&#x4E2D;&#x5B9A;&#x4E49;&#x7684; <code>newProc</code> &#x8FC7;&#x7A0B;&#x8F7B;&#x677E;&#x5B8C;&#x6210;&#x3002;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">return</span> newProc(newIdentNode(<span class="hljs-string">&quot;load&quot;</span>),     <span class="hljs-comment"># &lt;1&gt;</span>
    [newEmptyNode(),     <span class="hljs-comment"># &lt;2&gt;</span>
     newIdentDefs(cfgIdent, newIdentNode(typeName)),           <span class="hljs-comment"># &lt;3&gt;</span>
     newIdentDefs(filenameIdent, newIdentNode(<span class="hljs-string">&quot;string&quot;</span>))],     <span class="hljs-comment"># &lt;4&gt;</span>
    body)                <span class="hljs-comment"># &lt;4&gt;</span>
</code></pre>
<blockquote>
<p><1> &#x8FC7;&#x7A0B;&#x7684;&#x540D;&#x79F0;&#x3002;</1></p>
<p><2> &#x8FC7;&#x7A0B;&#x7684;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#xFF0C;&#x7A7A;&#x8282;&#x70B9;&#x7528;&#x4E8E;&#x8868;&#x793A; <code>void</code> &#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x3002;</2></p>
<p><3> &#x7B2C;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#x4E3A; <code>cfg</code> &#x3002;</3></p>
<p><4> &#x7B2C;&#x4E8C;&#x4E2A;&#x8FC7;&#x7A0B;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#x4E3A;&#x6587;&#x4EF6;&#x540D;&#x3002;</4></p>
<p><5>  <code>StmtLis</code> t&#x8282;&#x70B9;&#xFF0C;&#x5305;&#x542B;&#x8981;&#x5305;&#x542B;&#x5728;&#x8FC7;&#x7A0B;&#x4E3B;&#x4F53;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x3002;</5></p>
</blockquote>
<p> <code>newProc</code> &#x8FC7;&#x7A0B;&#x751F;&#x6210;&#x5BF9;&#x8FC7;&#x7A0B;&#x5EFA;&#x6A21;&#x7684;&#x5FC5;&#x8981;AST&#x8282;&#x70B9;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x540D;&#x79F0;&#x3001;&#x53C2;&#x6570;&#x3001;&#x8FD4;&#x56DE;&#x7C7B;&#x578B;&#x548C;&#x8FC7;&#x7A0B;&#x4E3B;&#x4F53;&#x6765;&#x81EA;&#x5B9A;&#x4E49;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6240;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5728; <code>config</code> &#x5B8F;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8C03;&#x7528;&#x6765;&#x751F;&#x6210; <code>load</code> &#x8FC7;&#x7A0B;&#x3002;&#x53EA;&#x9700;&#x5728; <code>getAst</code> &#x8C03;&#x7528;&#x4E0B;&#x9762;&#x6DFB;&#x52A0; <code>result.add createLoadProc(typeName.ident&#xFF0C;identiDefs)</code> &#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5168;&#x90E8;&#xFF01;&#x8BA9;&#x6211;&#x4EEC;&#x786E;&#x4FDD;&#x73B0;&#x5728;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#x3002;</p>
<h3 id="945-&#x6D4B;&#x8BD5;&#x914D;&#x7F6E;&#x7A0B;&#x5E8F;">9.4.5 &#x6D4B;&#x8BD5;&#x914D;&#x7F6E;&#x7A0B;&#x5E8F;</h3>
<p>&#x5728;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x7684;JSON&#x6587;&#x4EF6;&#x3002;&#x5728; <code>configuration.nim</code> &#x6587;&#x4EF6;&#x65C1;&#x8FB9;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; <code>myappconfig.json</code> &#x7684;&#x65B0;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5411;&#x5176;&#x4E2D;&#x6DFB;&#x52A0;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-json">{
  <span class="hljs-string">&quot;address&quot;</span>: <span class="hljs-string">&quot;http://google.com&quot;</span>,
  <span class="hljs-string">&quot;port&quot;</span>: <span class="hljs-number">80</span>
}
</code></pre>
<p>&#x8FD9;&#x5C06;&#x7531;&#x6D4B;&#x8BD5;&#x4E2D;&#x7684;&#x914D;&#x7F6E;&#x5668;&#x8BFB;&#x53D6;&#x3002;&#x6E05;&#x5355;9.10&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x6D4B;&#x8BD5;&#x5B83;&#x3002;</p>
<p>&#x6E05;&#x5355;9.10.&#x6D4B;&#x8BD5;&#x914D;&#x7F6E;&#x5B8F;</p>
<pre><code class="lang-Nim"><span class="hljs-keyword">import</span> json

config <span class="hljs-type">MyAppConfig</span>:
  address: <span class="hljs-built_in">string</span>
  port: <span class="hljs-built_in">int</span>

<span class="hljs-keyword">var</span> myConf = newMyAppConfig()
myConf.load(<span class="hljs-string">&quot;myappconfig.json&quot;</span>)
echo(<span class="hljs-string">&quot;Address: &quot;</span>, myConf.address)
echo(<span class="hljs-string">&quot;Port: &quot;</span>, myConf.port)
</code></pre>
<p>&#x5C06;&#x6E05;&#x5355;9.10&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x5230; <code>configuration.nim</code> &#x6587;&#x4EF6;&#x7684;&#x5E95;&#x90E8;&#x3002;&#x7136;&#x540E;&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;&#x8BE5;&#x6587;&#x4EF6;&#x3002;&#x60A8;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x4EE5;&#x4E0B;&#x8F93;&#x51FA;&#xFF1A;</p>
<pre><code class="lang-bash">Address: &lt;http://google.com&gt;
Port: 80
</code></pre>
<p>&#x8FD9;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5168;&#x90E8;&#x3002;DSL&#x5B8C;&#x6210;&#x4E86;&#xFF01;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x60A8;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x5BF9;&#x5982;&#x4F55;&#x5728;Nim&#x4E2D;&#x7F16;&#x5199;DSL&#x4EE5;&#x53CA;&#x5B8F;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x6709;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x4F7F;&#x7528;&#x751F;&#x6210;&#x7684;DSL&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x6DFB;&#x52A0;&#x5BF9;&#x66F4;&#x591A;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6216;&#x8005;&#x5BFC;&#x51FA;&#x751F;&#x6210;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x8FC7;&#x7A0B;&#xFF0C;&#x4EE5;&#x4F7F;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x4E2D;&#x4F7F;&#x7528;&#x3002;</p>
<h2 id="95-&#x5C0F;&#x7ED3;">9.5 &#x5C0F;&#x7ED3;</h2>
<ul>
<li>&#x5143;&#x7F16;&#x7A0B;&#x7531;&#x4E09;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7ED3;&#x6784;&#x7EC4;&#x6210;&#xFF1A;&#x6CDB;&#x578B;&#x3001;&#x6A21;&#x677F;&#x548C;&#x5B8F;&#x3002;</li>
<li>&#x901A;&#x7528;&#x8FC7;&#x7A0B;&#x51CF;&#x5C11;&#x4E86;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x3002;</li>
<li>&#x6982;&#x5FF5;&#x662F;&#x4E0E;&#x6CDB;&#x578B;&#x76F8;&#x5173;&#x7684;&#x5B9E;&#x9A8C;&#x6027;&#x7279;&#x6027;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x60A8;&#x6307;&#x5B9A;&#x5339;&#x914D;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x7684;&#x9700;&#x6C42;&#x3002;</li>
<li>&#x60A8;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x901A;&#x7528;&#x8FC7;&#x7A0B;&#x4EE5;&#x51CF;&#x5C11;&#x4EE3;&#x7801;&#x91CD;&#x590D;&#x3002;</li>
<li>&#x6A21;&#x677F;&#x662F;&#x4E00;&#x79CD;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x6269;&#x5C55;&#x7684;&#x9AD8;&#x7EA7;&#x66FF;&#x6362;&#x673A;&#x5236;&#x3002;</li>
<li>&#x6A21;&#x677F;&#x652F;&#x6301;&#x536B;&#x751F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x63A7;&#x5236;&#x5BF9;&#x5176;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x8BBF;&#x95EE;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x6A21;&#x677F;&#x548C;&#x5B8F;&#x662F;&#x552F;&#x4E00;&#x53EF;&#x4EE5;&#x5C06;&#x4EE3;&#x7801;&#x5757;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x7684;&#x6784;&#x9020;&#x3002;</li>
<li>&#x5B8F;&#x901A;&#x8FC7;&#x4EE5;&#x62BD;&#x8C61;&#x8BED;&#x6CD5;&#x6811;&#x7684;&#x5F62;&#x5F0F;&#x8BFB;&#x53D6;&#x3001;&#x751F;&#x6210;&#x548C;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x6765;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x60A8;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x4EFB;&#x4F55;Nim&#x4EE3;&#x7801;&#x7684;AST&#x8868;&#x793A;&#x3002;</li>
<li>&#x73B0;&#x5728;&#x60A8;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5B8F;&#x6784;&#x9020;AST&#x6765;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="08.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第八章 外部程序接口FFI">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第九章 元编程","level":"5.2","depth":1,"previous":{"title":"第八章 外部程序接口FFI","level":"5.1","depth":1,"path":"08.md","ref":"./08.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"09.md","mtime":"2023-01-30T11:51:57.847Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-02-02T15:44:52.102Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

